{
  "video_id": "-RMj2R6g7NY",
  "channel": "HighLoadChannel",
  "title": "День открытых дверей HighLoad++",
  "views": 821,
  "duration": 7187,
  "published": "2025-05-27T05:21:29-07:00",
  "text": "Начнём с того, что подобных конференций не существует. Самые хардкорные темы только у нас. Я просто не знаю, что сказать. Самая лучшая на свете. Да, крупнейшая ID-конференция в России. По-настоящему лидеры GoН сообщества в нашей стране. Профессиональный рост вас существенно ускорится. Считаю, что на такие конференции обязательно нужно ходить, потому что они помогают увидеть то, как сделано у других, не изобретать велосипеды, учиться на чужих ошибках, а перенимать чужой опыт. Широкий спектр тем, огромное количество докладов. Ну, на всём хайлоуде их 200. Да, приходите на конференцию, это очень сильно поможет вам расти профессионально. Сюда приходят люди, мы все айтишники, часто интроверты. Не стеснятся всё равно подходить, потому что здесь это очень легко. И даже те, кто не совсем склонны в других обстоятельствах общаться, здесь они будут готовы, они будут рады. И самое главное, что народ очень дружелюбный. Если вы любите нетворкинг, интересует общение с очень опытными, технически сильными ребятами, ага, вот там тот чувак говорил прикольное про вот эту штуку. Когда у меня уже будет всё на руках, я непосредственно перейду к этой задаче, то я смогу более точно обратиться. Наша конференция лучшая. Всем привет. Это день открытых дверей Highlo 2025. И мы начинаем. А у нас сегодня гибридный формат. Мы здесь в офисе ВК оффлайн. Нас смотрят участники онлайн. Те, кто подключились к трансляции, мы вас сразу приветствуем и просим оставаться с нами до конца. Там будет самое интересное. Пишите, задавайте свои вопросы, мы увидим все ваши комментарии, поэтому будьте активны. А участникам в зале, на самом деле адресовано то же самое. А мы сегодня настроены даже не на то, чтобы рассказывать, а скорее на диалог. Поэтому будьте готовы. Мы будем спрашивать, часто уточнять ваше мнение. И поэтому поднимайте руку, когда есть что сказать обязательно. А о чём же мы сегодня поговорим? Ну, хочется рассказать о том, что такое конференция High Load, как она проходила в прошлом и какой она будет в 2025 году. Расскажем, чем живут наши спикеры, а, и что будет в программе. Но тут, опять же, на самом деле хочется прямо диалога, какой-то дискуссии. И мы даже приготовили блокноты. Я вижу, мы сегодня прямо хотим записывать все идеи, мысли, которые сегодня здесь будут озвучены и появятся. А сразу хочется начать с приятного, что получит спикер конференции Hуд. Ну, смотря на этот список, я вижу, что многое. И хочу сначала сказать то, что услышала от эксперта, который работает с большим количеством конференций не только в России. Он сказал, что мало кто делает столько для спикеров. Илоу, на самом деле, самая заботливая конференция. Ну, судя по этому списку, так и есть. вижу, что первый пункт освещён вообще не полностью. Хочу немножко поподробнее здесь сказать. А в этом пункте заложено многое. Хайлоууд даёт вам куратора, а участника программного комитета, который будет с вами на протяжении всей подготовки доклада. Также здесь есть коуч в этом пункте зашит, который будет навигировать, помогать готовить презентацию, ваши выступления. А ещё у нас есть редактор, корректор презентации, который будет исправлять ошибки, показывать вам, где и что вы не учли, чтобы вы были уверены, что ваша презентация просто идеальная. Я даже не буду перечислять, сколько всего ещё есть, потому что есть мастер-классы, тренинги, очень много образовательного, обучающего контента, который доступен нашим спикерам а в процессе подготовки доклада. А дальше идёт пункт, я вижу, ну, он такой про возможности на конференции. И на самом деле хочется обратить внимание, что наши спикеры получают доступ ко всему, что происходит на площадке. Ну, базово - это доклады, зона выставки, а далее идут разнообразные форматы, нетворкинг. У нас есть комната докладчиков. Это спикерская очень такая крутая зона, специально закрытая для спикеров. Там можно комфортно подготовиться, отдохнуть. Ну, в общем, много всего. Приходите и пользуйтесь. Следующие пункты про логистику, так называемую. И мы, на самом деле, сделаем всё. Привезём, отвезём, поселим в отеле, покатаем на такси за счёт нашей конференции. Вот. Также накормим. А вот эти кофе-брейки на Хайлоуде, мне кажется, это как столы в Гарри Поттере, которые вот постоянно пополняются. Вот эти волшебные. Как-то так это обычно выглядит. Серьёзно. Ну и последний пункт. Мне коллеги говорили, что он такой самый значимый, прикольный, а, бесплатный билет на одну из следующих конференций Онтиков в течение года. Мм, классная действительно опция. А, кстати, я не представилась. Меня зовут Вика. Я программный менеджер конференции Hуд, поэтому где-то в конце будет слайдик. Спасибо. Где-то в конце будет слайдик с моим контактом. И если у вас появятся любые вопросы по программе участию в конференции, то обязательно пишите, а я всегда с вами на связи. Ну, собственно, всё, что я перечислила, было у спикеров High 2024, и мы не планируем снижать планку, а всё будет так же. Мы всегда собираем цифры, какую-то статистику, вы видите её на экране, но мы решили ещё немного изнанки такой обнародовать сегодня, показать статистику, которую ещё собрали. А, пожалуйста, комментируйте, врывайтесь, дорогие участники программного комитета, если будет что сказать, сейчас буду показывать слайды, что у нас там, что мы собрали. Можно я один коммент сделаю? Давай мы покажем чудеса логистики. Мы сделаем магию. Вот я знаю, что один человек, я с ним сейчас поменяюсь местами, всё станет круче. Фёдор, идём, идём, идём, идём. Давай, давай. Ну, пойдём, пойдём, пойдём. Хорошо. Да меня-то в лицо все, что, что началось-то? Импровизация. Лицо все знают. А ф а Фредда нет. Я из зала поговорю, если что. А мы с ним поменяемся. Так, коллеги, без несогласованных механик, пожалуйста. Я вижу, что наш программный менеджер недовольно. Вот, кстати, программный менеджер Вика - это вот человек, который своими руками держит всю нашу банду, а, и заставляет работать, поэтому действительно святой человек. Да, ракеировка действительно была несогласована. Ну ладно. А так вот, коллеги, вы, наверное, успели ознакомиться со слайдом. Мм, если у нас здесь нет чем поделиться, то мы пойдём дальше. А, вижу, здесь представлена отрасль, в которой работает компания. И здесь, наверное, общий комментарий. Зачем вообще мы это показываем? Хотим тем, кто планирует подавать доклад, немного так подсветить, показать вот изнутри то, что мы собираем аналитику. А кто же всё-таки участники High? То есть для кого вы будете делать доклад. А следующий слайд - это направление должности. Это тоже должно помочь, если вы собираетесь анализировать аудиторию и выбирать прямо понимать целенаправленно для кого. Вот те люди, которые, соответственно, посещают нашу конференцию. Ну, тут видно, что в основном это всё-таки разработчики. Кэндразработчики. Да-дада, точно. Но там ещё не полный вывод. Вы заметьте, что если посмотреть на этот слайд и предыдущий, видно, что продуктовые разработки планомерно увеличиваются, а прослойка аутсорса уменьшается, но при этом компенсации существует. Спасибо за полезную аналитику. Идём дальше. Здесь уровень должности. А правильно ли я понимаю, что из этого слайда можно сделать вывод, что йлоуд на самом деле, ну, не для новичков? То есть джунов здесь мало, там midle плюс получается, да? Лучше всего ориентироваться на мидла и всё, что выше. Саш, какой коммент? Давай скажи, не стесняйся. Ты чего? Да я хотел сказать вот как от ПК. Да, вот можно на пару слайдов назад мы проскочили, а, а у меня лампочка загорелась. Да, вот продуктовая разработка, если мы используем эту аналитику для того, чтобы решить, что рассказывать на конференции, а, небольшой хинт о том, что у нас в ПК происходит и что нам приносят. Нам постоянно приносят, а, доклады о том, как фунциклирует тот или иной продукт. А, пожалуйста, приносите не то, как он фунциклирует, а как он устроен и какие факапы и прочее были во время разработки этого продукта. Вот это прямо топ, то, что хочется видеть, наверное, так. А, но вот если это просто я поясню немножко вот эту историю, потому что вдруг принесут про продукт какой-то, а это очень сложно защищать. У нас очень очень серьёзный комитет. Короче, у нас не продуктовая конференция, если кратко. Ну вот, вот у нас, кстати, да, прикольно, что мы говорим, что у нас продуктовый этот, но мы периодически говорим на ПК, что мы не продуктовая конференция. А я извиняюсь, у кого как. Ко мне приходят, избагривают все доклады про математику, базы данных и другие непонятные штуки, в которых И где здесь продукт, да, и где там продукт? Вот. Ну, об этом и речь, да? Если у вас есть доклады про Мотан, то вот Александр может не про Матан, а про дискретку. Сколько ж объяснять-то? Ладно, давайте дальше, да? Давайте дальше. Тут ещё есть интересный слайд. Мы спрашиваем, для чего участники приезжают к нам на конференцию. И здесь, наверное, можно заметить, что на первых местах остаются, ну, такие причины, как развитие, действительно расширение кругозора. А узнавание чего-то нового и изучение там опыта, который случился у коллег и который можно переиспользовать и забрать себе в работу. Если тут нечего добавить, можем пойти дальше. Не, вот тут надо отметить некоторые пункты честные, да, то, что встретить друзей, коллег, там отдохнуть от работы. Отличные пункты. Спасибо людям, которые честно признаются, что и на конфы для этого тоже можно ходить. Ты попробуй эти процентики сложить и увидишь некоторую магию, что поиск решений, если сложить эти два пункта, больше, чем поиск решения. А можно ли из этого сделать вывод, что если встретиться с друзьями, то все проблемы решены? Вопрос философский. Ну и ещё кое-что. Я вижу здесь есть пункт, чтобы выступить с докладом. И это, соответственно, наши докладчики отвечают. Но я уверена, что предыдущие все моменты они тоже для себя закрывают, на самом деле. А следующий слайд - это топ докладов. Хотели показать, что было в двадцать четвёртом году, но не покажем. Да. Да. Ну давай всё-таки покажем, да. И пока мы смотрим, на самом деле тут есть определённая методика, по которой мы это всё считаем. Но перед этим хочется спросить, а кто был на этой конференции в 2024 году? Так о, люди набираются. Ну, треть залов была. А вот были ли вы на этих, на одной из этих выступлений? Что-то меньше? О, ну набирается, набирается. Хорошо. А есть ли доклады, которые вы считаете, что стоило бы сюда включить, но их нету? Ну, тоже руки есть, в общем-то. Ещё меньше, но есть. Саш, у тебя микрофон есть, что ты руку тянешь? Да ты можешь говорить. Не, ну тут всё просто, как бы вы охватили, наверное, самые популярные. Я не знаю, как это была статистика посчитана. Я вполне верю, что логично, потому что мы все мы вроде умные люди, но как бы нету некоторых докладов, которые были очень нишевые. И на самом деле вот мы пишем здесь честно топ докладов, но я считаю, что должна быть где-то история про топ нишевых докладов. Потом Да. Да, Саша, мою подводку, ну, подводку я сделал. Саша хорошо продолжил. Что я хотел рассказать? Э, да, это в первую очередь самые массовые доклады. В любом случае, чтобы собрать статистику, нам нужна массовость. Соответственно, есть очень много очень классных докладов, но они нишевые. Про них мы ещё попозже остановимся. А у нас же будет, по-моему, да, с Да, про это мы ещё поговорим. То есть, что такое классный доклад и так далее, просто чуть попозже. А мы же ещё хотели, кажется, делать какой-то такой топ вот как раз нишевых такой. Ой, я честно вам скажу, я это пробовал делать. Я делал что-то типа такое, как это называется, не хитпарад, да, со стороны программного комитета, но там очень много, ну, знаете, вот, ну, то есть что мне интересно лично, да, то есть вот этот доклад очень классный, но я понимаю, что статистически, ну, не так много людей будет. Честно, что кластеры просто рассыпались? Ну там как бы статистики не на коллеги, коллеги, Гер, всё очень просто. Берёшь доклады Боргорта Александра, который он курирует и делает. Это будет топ нишевых докладов наших. Вот это реально лучшие доклады вот у этого человека нишевые все практически все. Всё так. Я, пожалуй, соглашусь. Больше никто не берёт. Никто не понимает, о чём речь иногда. Всё верно. Всё верно. Что же нас ждёт в двадцать пятом году? Ну, многое зависит, на самом деле, от вас, от того, как будет собираться программа, но важно сказать, что в этом году мы большее внимания хотим уделить практическим форматам, мастер-классам, воркшопам, и мы выделим для них сильно больше слотов. Поэтому, если у вас есть что-то подходящее, материал, который можно сделать мастер-классом, обучающим, практическим, то, пожалуйста, welcome. Будем очень рады таким заявкам. Ну и, соответственно, про доклады. Прямо сейчас вы видите QR-код, и там лежит сайт cfphow.ru. Там есть много всего очень полезного для докладчика. Буквально всё вы потом прочитаете, зайдёте. То, что мы говорим здесь, оно такое уникальное. Там этого нет. Мы хотим добавить как-то, да, усилить. Ну, я тут хочется подсветить, что самые первые доклады, самые ранние, у них есть, на самом деле, возможность быть рассмотренным с меньшим конкурсом. Соответственно, у вас больше шанса попасть в программу. Чем раньше вы подаёте, тем больше шансов по, ну, к нам попасть. И это правда работает. То есть это не реклама, это реально так. Ну, в общем, написан дедлайн, доклады принимаются, написано там, да, 20 июля, как вы поняли. Советуем подавать раньше, правда? М, действительно, так. Здесь ещё написано, что все заявки рассматривает программный комитет. Это действительно так. У Хайлоуда есть огромнейший программный комитет экспертов, сильных практиков, которые работают с каждой из заявок, которая к нам поступает. И, соответственно, этот программный комитет Ой, ой-ой-ой, да, это я правильно, правильно. Сразу начать надо в одном лице. А, да, программный комитет Хайлоуда очень большой. Там порядка 50 человек, если не больше, наверное, даже грузится долго. Видите, кликер традиционно сломался, всё в порядке. Да, я поняла, почему это произошло. Вот так вот. Высокие нагрузки. Так, супер, вернулась. Вот. А здесь не все. А, но здесь хочется отметить Олега Бунина, генеральный директор компании Онтика и руководитель программного комитета. А, но здесь действительно не все. Их очень много участников программного комитета. И важно ещё то, что программные комитеты конференции Онтика, они плотно взаимодействуют друг с другом. Онтика делает много конференций, и их программные комитеты связаны, у них большая сеть контактов. Поэтому, если ваш доклад даже на какую-то узкоспециализированную тему, мы точно найдём эксперта, который поможет нам докопаться до сути. И даже найдём конференцию под вас, я бы сказал. Точно. А иногда они собираются с нуля для этого. Дадада. Так и есть. А, ну а сейчас начнётся часть про программу. А, и более такая разговорная часть, да? А почему важно-то вот на вот этих все лица посмотреть и на и на предыдущем слайде? Эти лица занимаются немного разными частями программы, что очень важно понимать. Поэтому послушайте, пожалуйста, кто чем занимается в секциях, потому что постоянно на хайлодах к нам приходят ээ ребята деврелы, докладчики и так далее. Они спрашивают там: \"А что с моим докладом?\" Да или \"Что с докладом этого человека?\" А этот доклад, он ревьюется, например, программа комитента, который за вот за Divops отвечает больше, да, и там немножечко своя жизнь происходит. А поэтому очень очень внимательно выбирайте секции. И на самом деле, если у вас есть какой-нибудь друг или подруга из программного комитета, лучше уточнить, да, обычно мы помогаем выбрать более релевантную, периодически не туда попадают, и в итоге, короче, происходит такая котасия местами. Всё. Ну и, соответственно, начинается часть про программу, поэтому я потихонечку ориентируюсь, передаю слово участникам программного комитета. А сейчас будут делиться сакральными знаниями те, кто на сцене, и первый такой человек - это Фёдор Васильев. Давайте аплодисменты. Это я. Да. Значит, смотрите, мы немножко эту секцию изменили. Раньше мы рассказывали, э, что надо на конференции, а теперь мы поиграем с залом. У нас есть же микрофон в зале, да? Вот. И вы нам будете рассказывать, а что, собственно, какие секции и что к чему. Давайте кликер. Да. А где он ещё один? Дай я пока пощёлкаю. А, да, сначала же путь спикера. Точно. Вот это, собственно, то, что должен пройти каждый, наверное, каждый из нас здесь, сидящих на сцене, это проходил, если что. То есть мы знаем, о чём говорим. Вот я думаю, что половина зала как минимум тоже, может быть, и больше. И всем желаю оказаться там. Соответственно, что первое надо сделать - это подать заявку. Об этом уже говорилось. Есть форма, там есть поля. В принципе, там всё объяснено. Э, подавайте, дерзайте. Темы на ваш выбор. Вот. Далее. Вашу заявку берёт кто-то из программного комитета. Это происходит добровольно. То есть, ну, допустим, я или Саша или другой Саша, там, Лёша, вот видит в админке падает заявка, там, не знаю, какие-нибудь алгоритмы мутана нашего любимого, да, который дискретка. Вот, и такой: \"Я хочу эту тему\". Берёт, кликает, забирает. С этого момента он назначается автоматически куратором этой заявки. А этот человек из член из ПК, это кто-то из нас или из тех ребят, кто на слайде был показан раньше. Вот он связывается, создаётся чатик в телеге. с вами связываются, в том числе лично этот человек, который куратор, и с этого момента он ведёт вашу заявку. А не удивляйтесь, он будет задавать странные вопросы, может быть, а может, не странные. Вот на них надо ответить. Это нужно для того, чтобы потом эту заявку мы рассмотрели на так называемой защите. Про неё я рассказывать не буду. Это такая кулуарная процедура. На ней не присутствует спикер, но присутствует его куратор, и он является там его адвокатом. То есть вот так. Соответственно, куратор должен защитить заявку. Если она проходит защиту в программном комитете по определённой процедуре, тогда заявка принимается в программу конференции идёт дальнейшая подготовка. Вот там будут созвоны, репетиции. Довольно строго спрашиваем. Надо соблюдать тайминги. Это важно. У нас, к сожалению, не все соблюдают тайминги. И мы можем дисквалифицировать. Да, у нас такие случаи есть, бывают. Хочется, чтобы их было меньше. Поэтому, пожалуйста, читайте, что вам пишут. Пожалуйста, так сказать, относитесь ответственно. Ну, как бы мы готовим серьёзную конференцию. Вот. Ну, и самое главное, пройдёшь все эти круги ада, подготовки, репетиции, оффлайн-онлайн прогоны. Коучи у нас есть, они тоже очень сильно придираются там ко всему, ко к цвету слайдов. Наш любимый вот тёмная, кстати, презентация. Вот мы уже придрались, что она тёмная-то. Мы больше любимы по- доброму придира. Мы по-доброму придираемся. По- доброму. Да, да, да. Ну, не все. Да, не все. И ты забыл главный лайфхак. А ты самый главный лайфхак разбыл, что чем раньше вы подадитесь, тем проще пройти. Так было же уже мате слышали. Да, да, это всё. Так, я это многократно буду повторять, потому что когда вы приходите раньше, у нас есть больше времени, чтобы поковыряться в заявке и максимально её а разобрать, б продать. Всё так. Абсолютно верно. Это реально так. А в конце, когда вы приходите, у нас там 50 заявок в конкуренции и там шесть мест, да? Сколько у нас было последней? Что-то такое было. И там как бы, извините, о к десяти как бы и то ещё успеть надо. Это ещё в лучшем случае. А ещё надо не забывать, что вот если бы не было Елизаветы и Виктории, у нас бы вообще бы была, потому что как бы логистика у нас - это некоторая виртуозность процесса. Надо отдать должное их мастерству. Они как бы виртуозны. Поплодируем. Поаплодируем организаторам. Не, это очень ценный навык. Просто Фёдор не дорассказывает это. Представь тех членов ПК, которые там тихо CTO, техледы заставить что-то сделать, втиснуть это в расписание, а ещё прожонглировать абсолютно. Ну и самое главное, последнее - это выступить огненно на конференции. Вот это, конечно, самое главное. Это итог, так сказать, всей этой подготовки. Кстати, эта подготовка длится обычно 4-5 месяцев, если что. Вот. Ну, как бы и да, к этому надо быть готовым. Так, да, хотел сказать, давайте дальше. А кликер-то у меня. Так, вот теперь, значит, переходим к этой реформированной секции. Мы так ещё не делали. Сегодня будет премьера. А, объявляется, так сказать, направление, и я у вас спрашиваю, а вот про что можно здесь рассказать? Кто смелый? Хоть какую-нибудь тему набросьте. Вот давайте микрофончик, да, руку поднимайте, вам быстро будут давать микрофон. Александр, давайте. Да, видимо, про движки баз данных, про оптимизации, про какие-то, может быть, новые базы, про ускорение работы с существующими. Ну вот не всё так, всё так, да, абсолютно. А ещё что? Вон туда, пожалуйста. Ага, спасибо. Вот туда. Привет. Я бы по про как Роуч послушал с удовольствием, потому что он на бумаге такой великолепный, а на практике никто не пользовался. Принимается. Переезд с нереляционки на реляционку и об с нереляционки на реляционку. А и обратно. Туда обратно. И ещё раз. Да, туда обратно. Всем приятно. Вон туда, пожалуйста. Хорошее название для докладать. А у нас есть такой же. А ты заметь, два последних идеи самые интересные, потому что какроч больше не Open source, насколько я помню. Вот. Вот, во-первых, кому он нужен, но всё равно интересно послушать. А вот с реалиционки туда и обратно - это весёлая история. Да, согласен. Обратите внимание, мы всё записываем. Так что, пожалуйста. Про сети, которые соединяют разные ноды баз данных, систем хора, СХД, Роки и так далее. А ты про рафты какие-нибудь имеешь в виду? Нет, про именно про сетевую часть. А, ну там есть ещё другие тематики более широкие. Там это тоже будет не спойлерим. Это самая хайповая тема. Я понимаю больше всего, дорогие коллеги, можно задавать вопросы и набрасывать также и в трансляции про графовые базы данных. Графовы О, отлично, отлично, отлично. А у нас, кстати, даже это редкость, да? А я даже знаю две компании, которые могут про это рассказать. Саш, да ты всех знаешь. Ну да. Приглашай, приглашай. Так, ещё кто-то хочет распределённые имям кэши? Ага, хорошо. Подожди, мемкэш же уже умер. Подождите, что-то не inмеory кэши. А ин я не про конкретный продукт, я про то, чтобы избавиться от редиса в сторону чего-нибудь более интересного. Не знаю, что же может быть лучше, чем редис. Только волкей. Волкей, да ладно, ребята, давайте последний последний раз. Кому там что? Вот. Да, девушка есть идея. Э, можно рассказать про безболезнение миграции. Откуда? Куда? Например, с одного кликхауса на другой и Ага. Безюм. А можно тут чуть поподробнее с кликхауса на кликхаус или как? Ну, между разными базами использование безма. О, неработающие технологии. Я люблю их. Прекрасно. Ладно, давайте пойдём. Которые тоже уже рассказывали. Кстати, будет в Питере про дебизиум доклады, несколько докладов. Пойдёмте дальше, а то у нас на самом деле много тем. Смотрите, вот на самом деле, ну, в принципе, вы о чём-то таком и говорили. Это такая подсказка, если бы никто ничего не сказал. Но как понятно. сказали и видите, там светофорчик у нас в уголку красненький. Это что значит? Это значит, что данная тематика, она очень популярна. То есть прямо ух, это действительно так. Это самая популярная тематика, на мой взгляд, э на Хайлоде. Вот. И конкуренция очень высокая. То есть как бы если вы хотите подавать э доклад в эту тему, то вы должны быть готовы, что вас будут допрашивать, что к вам будут повышенные требования и что вы должны чем-то удивить. То есть должен быть какой-то интересный takeйвей обязательно. Вот. И должны быть какие-то такие, ну, короче говоря, конкуренция высокая, но подаваться надо. Ну, это и самые интересные доклады обычно, то есть они очень глубокие, всем надо хранить и хранить персистентно, не теряют данные. База это база - это вечно. Да, я вас расстрою. База - это не всегда про персистентность, да. Так вот, а я бы сказал, тёмная лошадка. Вот давайте подскажите мне, что здесь можно поддать. Подожди, там всё просто. Смотри. Во-первых, уязвимость виртуальных машин, дальше, смарт-контракты и уязвимости. Блокчейн не как смартконк. Подожди, Саш, да мы. Ну, подожди. Или садись в зал, иди. Да. Понимаешь, в чём проблема? Я накидываю. Я надеюсь, что кто-то зацепится зад, так сказать, мысли и скажет: \"Нету там уязвимости\". Понимаешь? Мы же должны вовлечь аудиторию в процесс дискуссии. Вовлекаем, коллеги, прекращаем штрейк брехерство. Там мы идём единым фронтом по расписанию. Хорошо. Кто-нибудь из зала что-нибудь может предложить по этому по этой теме? Микрофончик, пожалуйста. Пожалуйста, как ускорить этот распределённый реестр? Наконец-то ответ есть у кого-нибудь? Может быть, никак. Никак. Это правильный ответ. Вот давайте. Да. А почему блок почему вам, скорее всего, не нужен блокчейн? Им надо взять просто реляционку или другую базу данных. Отлично, отлично, отлично, отлично. Принимается. Блокчейн вам не нужен, да? Доклад называется. Отлично. Да, шикарно. Вот. Ну да, лет пять назад это было на хайпе. Докладов было много, а сейчас, как видите, мало. Коллеги, а можно я вот расскажу про коллега сказал как к блокчейну, короче, отказаться от блокчейна и взять реляционку, да? А вот здесь доклад сходу, да? Э, будьте внимательны, пожалуйста, да, потому что, ээ, мы волонтёры, и мы берём часто то, что нам интересно. Поэтому вам может повести, что если вы хотите, э, рассказать о том, как отказаться от блокчейна и перейти на реляционку, вы попадёте, например, к Александру, который из вас вытянет всю технину про блокчейн, а не про реляционку. А, поэтому, а, если вы подадите в базы данных, то из вас, скорее всего, вытянут именно базы данных, да. Поэтому будьте внимательны, куда вы подойдёте. Вы тоже вот мы как кураторы выбираем то, что нам очень знакомо. И обычно вот, ну, периодически так получается, что мы как бы можем немножечко только это поднажать на эту тему. Поэтому, если вы не хотите про блокчейн, скажите немножечко, подайте в другую секцию. Вот, в общем, не нарывайтесь, если не готовы. Ладно. Зелёненький светофор, докладов мало, конкуренция низкая. Можно вот с таким докладом, как Виктор, да, как у Виктора, прямо залететь прямо с обоих к ног, как говорится. Вот. В целом это интересно, безусловно. Ну не знаю, не знаю. У нас были ZXШрки на хайлоуде двадцать четвёртого года, если я не путаю его с Питером или на Питер, или на вот конкуренция с шнарками будет очень высока. Если вот кто-нибудь придёт и расскажет про оптимизацию проф или ZX шнарки на Этериуме, это уже спорный вопрос. Что интереснее? Ну, подаются-то народу меньше всё равно. Ну, это да. Ладно, математика на твоей стороне. Ну, хорошо, давайте дальше, а то всё-таки у нас ещё очень много безопасность. Ну, по безопасности как бы, наверное, всё понятно или нет? Хоть одну тему из зала про безопасность. Всё ли у нас безопасно? Да, что-то у нас да не безопасно опять. Виктор, я не первый раз в этом бизнесе. Да. А про авторизацию, аутентификации очень мало докладов. На devсконфе размочили, про Кейковок начали рассказывать, наконец-то. Передаю Саше микрофон. Белоцерковский. Саша, давай, давай, продолжай. На, а я больше всего люблю такие доклады, которые раскрывают какую-то историю, которую вроде бы мы, а, как бы понимаем, как она работает. доклад про то, как и используется в коллекторском деле в банках. А так вот, а по игнаи большие языковые модели LЛLM. Как вы думаете, что, ну, что хочется услышать вам в этой секции? А это вопрос в зал туда? Давайте. Ну, хочется услышать про агентов, которые наконец-то заменят программистов, аналитиков, руководителей и будут нормальный результат выдавать, а не то, что выдают сейчас, а потом начнут заменять друг друга. Да. Вот когда что такое нормальный результат, да? Это скорее всего оптимизация обучения, да, оптимизациям, обучением и так далее. Ну, я немножко не про это. Я про то, что сейчас большие модели, даже если они сделаны в виде агентов, э, давая друг другу задания, по сути, ну, там процентов 10 у лучших моделей выходит результат в 10% случаев, вернее. Ага. И даже хорошо обученные дают всего 10%, а все остальные начинают галлюцинировать, уходить от ответа, ну и так далее. Там очень много сейчас в современных статьях именно про это прошу прощения, можешь не переживать ещё лет 15, потому что всё ещё самый эффективный биitmap в компании пишу или я, или мой senor девелопер. Поэтому клото свеженький не смог. И я видел руку там сзади. Саша, давай мы у тебя отберём, а там немножко руками поменеджерим, да. А есть ли жизнь безвидии? Есть. Вот приходи ко мне, у меня есть специальный слайд. Он объясняет всё. Не представляешь, у нас был разговор, что приготовить на эту встречу, и Александр сказал: \"Давайте сделаем круглый стол, как жить безвидии\". Или как-то так. Это да было хорошо. Принято дальше. Хочется, ну, каких-то прикладных кейсов, то есть не погружаться глубоко в эмэльку, а именно там какие-то интересные продуктовые решения. Причём, было бы интересно какое-то сравнение увидеть, услышать применительно. Вот не в целом, а вот такая-то лэмка самая лучшая, а для конкретного какого-то кейса, там, не знаю, бандерация отзывов там или ещё что-нибудь. Исследование, в том числе российских вариантов, которые просто по опишке подключаешь. Всё просто. Берёшь клод, пишешь на Питоне его иш. Нет, нет, я не про это. Я про то, чтобы просто какой-то вот, чтобы я как стартап, например, там послушал такой доклад и пошёл: \"Ага, значит, вот для этой цели мне лучше пойти заказать опишку там яндексовскую.\" Действи что-то типа плана к действию, да, что хочется вот это, иди туда, да. Ну, например, да, причём желательно вот наши, которые не нужно через интересные места оплату делать. Да, у нас на тех founders есть такие. Я прошу прощения, там вот ещё рука одна была и там ещё у меня, значит, тоже предложение небольшое. Хочется услышать доклад на тему, когда же лэмкам можно будет верить. Никогда нужен. А людям можно верить. А, а вдруг там будут другие ответы? И хорошо, Саша, принято. Ээ, да. Сейчас попробую с формулировкой поиграться. Хочется услышать доклад, не? А мы попробовали применить какие-то параметры и о у нас классно получилось, а какую-то математическую основу, наверное, под этим. То, что мы неугад параметры подбирали, а мы прямо думали и знали, что делали. Вот. Ну, то есть такой в сторону ноутчпопа опять же, но то есть проL-дизайн вы имеете в виду внутренний? Да. Да. А простите, это другое. У нас в семействе High Load конференции есть конференция АКОН. Вот как раз туда надо сходить и потрясти людей. Не, ну вы подавайте к нам, а мы разберёмся. А он хитрый коварит, это балансировщик строит. Я понял. Шёл. Колле, коллеги, принято вот. Да. Так, коллеги, ну можно про безопасность, наверное, мультиагента. про безопасность агентных систем, мультиагентных систем, особенно в интерзах. Также тема про архитектуру агентных систем. Кажется, это было бы интересно. Понятно. Гер, запиши, запиши. Я уже записал. Принято. Давайте ещё одну, а потом я скажу мою мечту. Мою мечту. Вот. Да. Можно, точнее, мне кажется, было бы интересно послушать про анализ в логов приложений или микросервисов, которые бы, ну, с помощью LM моделе могли сразу выявлять какие-то взаимосвязи между сервисами и так далее, чтобы тебе не нужно было анализировать и руками, там, глазками заходить, я не знаю, ээ, в Кибану и смотреть логи, а ты уже уже зашёл куда-то, и тебе всё показали, что почему и как их исправить. Принято. Принято. А у меня мечта - это увидеть, вот я недавно прочитал статью о том, что есть MCP, есть АТО А2, а вот как масштабировать агентные системы пока нету ничего, потому что прикрутить там Кавку, как это всё делать и так далее, оно всё ещё не приспособлено. прикрутили. У меня предложение там была рука, если я правильно помню, это Ян. Вот. Не, мы мы едем дальше. Дома никогда не закон уже давно тянул. Ну, тянул давно. Мы мы едем дальше, к сожалению, потому что у нас, да, это популярная секция и часто достаточно дискуссионная, поэтому вот именно в эту секцию я призываю вас подавать максимально рано, даже если это на стадии идеи, потому что это, наверное, в эту секцию мы обычно много тратим времени на обсуждение докладов. Лайтовая подсказка. Есть технология, называется vibe stream. Почитайте исходники, придите, расскажите ровно то, что хочет Саша. Да. А слушай, если ты здесь, вот это же твоя любимая тема, давай, может, ты её расскажешь? Ну давай. Я не знаю, что там рассказывать, но давай я расскажу. А, а можно тизер? Как бы давай послушаем, что А давай попробуем. Ну, зал. И в этот момент тишина. Это немножко. А тут можно задать вопрос: \"А все это есть ли у кого-то мысли, что это такое?\" Да, можно ру. Там была рука. Можно Александр Александр будет отдуваться за зал. Геораспределённые системы там всякое всякие умные маршрутизаторы там, не знаю, построение этих мм сетевых маршрутов. Смотри, в принципе, да, но сейчас будет неожиданно финтушами. В H ком comput я в том числе запихиваю то, как работают видеоигры. Потому что, если кто-то смотрел, как происходит ренринг картинки, вы бегаете, там такая месь в оптимизации весёлых, про которые хочется услышать. И и ты мне сейчас напомнил, например, про платформу онлайн-гейминга, которые безусловно пусть приходят, рассказывают, я за любой кипе, но в целом это секция про то, как что-то очень маленькое или очень большое запихнуть на что-то очень маленькое, то бишь, там рендеринг чего-нибудь на видеокамерах, определённые вы что кластер сразу бери па да всё, это всё h компуютинг, потому что если вы думаете Hкомпьютинг вас обошёл стороной, а я готовил три доклада по Hкомпьютингу. И если что, Hкомпьютинг есть в браузере, там есть-модели, с которыми вы взаимодействуете напрямую или косвенно. Я придумал кластер на этих на бейджах PhD. Да, да, всё так там Webassмбли сюда же улетает часто у нас, да, там и прочее счастье. Google активно его продвигает. Почти весь Chrome - это AG компю. Если бы половина того, что там не было, у нас бы Google хуже работал. Персонально ваша выдача, а не концептуально Google. Угу. Конкуренция здесь, соответственно, маленькая достаточно, потому что этим, в принципе, не очень там прямо, так скажем, много людей занимается и компаний, а, но это одна из самых интересных. И здесь нуж, на самом деле, желательно что-нибудь ещё продакшн, но мы здесь понимаем, что тема узкая, поэтому теоретически возможно и и без вот прямо вот этого. А интернет вещей что может быть интересно в этой секции вам? Я здесь сразу хинт подкину, что есть промышленные интернет-веща, это заводы, цифровые двойники туда же уходят у нас периодически, а в интернет-вещей и ээ так скажем консюмерские, то есть то вот ЖК, например, интернет вещей и так далее. Как думаете, что может здесь интересно быть вам, например, послушать? Не, Александр, это хорошо. Вчера я была на конференции пиш и там был взлом как раз промышленных систем. Вот хочется послушать про уязвимости интернета вещей. Да, у нас есть даже докладчик-то. Ну, собственно, опять же, прикладные какие-нибудь штуки про про умный дом, но не в плане там, а, вот есть такое устройство, а именно было бы интересно, вот берёшь там, не знаю, какую-нибудь Ардуинку, берёшь вот там какие-то, не знаю, датчики, вот это вот всё и, не знаю, систему вентиляции дома про переделываешь. Ну, хорошо, да? Или пытаешься работать с видеокамерой тоже. А её устройство. Да, я хотел бы тоже присоединиться к вот к преддущему докладчику. Как раз интересно послушать, с одной стороны про то, как что-нибудь сделать с помощью этого интернета вещей, но с другой стороны также интересно прослушать про то, чтобы вот после того, как ты дома на этом интернете вещей сделали, чтобы с твоим домом после этого ничего не сделали. Потому что в новостях в основном интернет вещей светится всякими историями. Да. А мы там взломали миллион этих вещей, получили доступ ко всему подряд. Да. Там вон история была, как пылесосы взломали, да, а у них там они с камерами ездят по дому. О, там пользователи самых неожиданных ракурсах оказались в интернете. Вот про это очень хочется послушать. А у нас здесь часто возникает вопрос, как с интернетом вещей. Что интересней эээнд а именно выбор протоколов? обмена там с облаком типа или eventхhub или что-нибудь ещё. А или и как написать в принципе бэкэнд для всего этого счастья низколатент с низкой латентностью, так скажем, либо клиентская история, либо посерединке. Вот. Потому что и то, и то, и то большие темы для разговора. Вот эээнд или, ну, условно фронтend. Вот моё мнение тут простое. Да, бэкэнд он у всех примерно одинаковый, что в продуктовой разработке, что в интернете вещей, а вот клиентская история разительно отличается. И клиентскую историю как раз послушать интереснее, да, ну, потому что бэкэнда вон там все показывали сколько, да, все про него знают. Я извиняюсь, только в Айоте нету клиента. Это H компьютинг в чистом виде. Ну, здесь я имею в виду, и Саша тоже, наверное, имеет в виду клиентскую скорее как-то на земле выглядит. То есть эти железяки так далее, как безусловно, но мне же надо пиарить H компьютинг. Подожди. А, ну да, да, точно, точно. А, да, кстати, это интересно. У нас был на соседней конференции на Industrial Plus+ кажется там выступал или у нас на Хайлоде выступал докладчик с рассказом о том, как они счётчики считают. Очень интересная история, потому что там куча legси и прочего. А у нас был доклад и про цифровых двойников и Айот. Два больших доклада года два назад. Да, было. И там всё было очень интересно. Да. Ну, смотрите, что мы здесь ждём. А, но здесь мы ждём какие-то технические темы. Вот, э, как вы даже как выбирать, например, базы данных для АйоA и какое-то сравнение, даже если оно эмпирическая, то бишь на ощупь, а это было проведено под какой-то нагрузкой, это уже, в принципе, можно рассматривать, как доклад, можно докрутить. А как выбирать протоколы, какие какая проблема адресации, например? Короче, вот много здесь всего там как адресовать вот в интернете вещей передвигающиеся девайсы, например, тоже почему бы и нет. там как IP6 и прочее вот это всё делать. А конкуренция здесь минимальная мне кажется, прямо реально минимальная, потому что в в РФ сейчас в принципе не очень много компаний этим занимаются. Ну приходите, приходите из интернета вещей. Я вот не знаю даже как там с интернетом вещей. Вот у нас дата-центры в космосе, где у нас это же интернет вещей или нет? Это не интернет вещей. Мы не пом Давай так. Я помню эту дискуссию. Я не помню результаты этой дискуссии. Да-дада, я не помню. Ладно, это же компьютинг. О, передаю слово Алексею. Лёш, подожди. Вот у нас тут вопрос есть из зала. Ты пока принимай, так сказать, да. Вопрос из зала такой. Не из зала, а из из чата. Будут ли в этом году под капотом другие направления, как в прошлых годах? Речь идёт о секциях, как в прошлом году PHP и Go. Это прямо даже не секции были. Это были отдельные конференции, которые проводились в специальных залах прямо в рамках хайлоуда. А в Москве это было? Ну, по-любому Саша Макаров спросил. Да, я тоже хотел сказать. Может, и Макар, да, вопрос. Он мог, да. Вот. А на самом деле на данный момент ответа нет. Он будет 8 июля дан. Да, сейчас, если июня, 8 июня через пару недель будет ответ. Пока мы сами не знаем, но чем больше вы вот такое спрашиваете, тем больше вероятность того, что это будет. Поэтому спрашивайте, набрасывайте. Лёш, передаю тебе слово. Погнали. Коллеги, привет. Я Алексей МТСН и рад представить три очень важные темы московского хайлоуда. А первое, вообще, какая моя задача - это подсветить всякие все нюансы и, э, сделать так, чтобы вы подавали заявки. Первая тема - это сердце. Highot+ архитектура и масштабируемость. Вот э тема очень серьёзная, на неё больше всего подают заявок и в ней больше всего мест. Оп, назад. Вот. А и больше всего на базы всё-таки. Ну, в общем, много мест. Они конкурируют. Да. Да. Они как раз конкурируют друг с другом. Да. Давайте послушаем. Будем будем набрасывать о том, что микросервисы далеко не всем нужны. Так, так, так, так, так. Аккуратненько. Там есть и, конечно же, будет всегда люди микросервис и ЦИК Юрес, но мы не будем про это всё вспоминать. Алексей, продолжайте. А, ну был доклад же у Саши Рыбака про про монолит. Вот у нас много уже докладов про монолиты опять стало, если что. Монолит возвращается, это факт. Ну да. Ну, в общем, разные течения есть, да. Интересно будет про всё прослушать. Ещё идея? Вот там рука есть. Не, Александр, прости, там была раньше тебя. О'кей, следум дойдёт. Ну, тут вообще про всё, что угодно можно рассказать достаточно масштабное, да? Любой крупный ээкэнд, ээ, под облаком, не под облаком. Ага. Как кав, как хластера Кавки обмазать дибезиумом? Конечно, конечно, конечно. Не знаю. любо любое приложенько, которое там на 100 + notт работает. Да. Да. Интересно. Ещё это направление, оно такое смежная и зачастую непонятно, то ли сюда, то ли сюда. Вот и люди подают вот вот. Да, я тоже сам подаюсь в основном на масштабируемости архитектуру. И, ну, я, наверное, в основном про архитектуру, да, отдельно как бы послед, но он на масштабах. Какой был твой последний доклад? Не про это. Всё-таки тогда я предлагаю вот там есть ещё одна рука. Нормально. Спасибо, коллеги. Знаете, мы на самом деле с Сергеем пришли как раз спросить, куда бы нам податься. Э мы работа это это очевидно, да. Я пару лет назад рассказывал про архитектуру, про то, что мы сделали свой инструмент, а сейчас хотелось бы рассказать про то, как из этого получился цифровой двойник ITСбера, про то, как её использует безопасность, автоматически открывается по архитектуре, доступы. И вот вопрос такой: нам сюда или есть другая секция? Подавайся сюда. Но я так скажу, если даже подаёшься в какой-то из секций, то куратор куратор возьмёт доклад именно по теме и перенаправит в нужную секцию. В общем, на мой взгляд, секция не самая большая проблема. Вот я бы добавил, что на самом деле, вот давайте так, вот мы говорим про секции, тематики и так далее. Это всё очень эфемерно. Это только примеры, о чём интересно поговорить. Нет, я я понимаю. Я просто к тому, чтобы не перекидывать, чтобы уменьшить количество хов, да. Не переживайте, просто подавайте вообще не хоп будет один. Этот доклад увидит как член ПК, да, которому интересен этот доклад, и он возьмёт его и пойдёт будет защищать. Важный момент рассказать, о чём вы хотите поговорить именно вот это. Это я понимаю. Я как бы спокойно прошлый раз прошёл и рассказал. Я понимаю, что там надо писать. Тут вопрос у нас тоже возникает дискуссия, да, мы можем это сделать там на час, а можем на шесть, а можем на восемь. Это может быть три доклада нам на 40 минут. Нас 30 минут. А нам на 30 минут. Я понимаю. И вот смотрите, дальше у нас будет пичко. А ещё дальше я расскажу про разные форматы выступления. Вот мы с вами там поговорим обязательно. Да. Да. Так, ещё ещё будут идеи. В общем, в этой теме мы ожидаем, что будут подаваться доклады про системы, про построение систем с высокими нагрузками. Но здесь я тоже замечу, что высокие нагрузки - это не миллионы, миллионы RPS. Высокие нагрузки, они рознят друг другу. Например, если вы строите какие-нибудь персональные витрины, а то там одна цифра нагрузок, там и 500 высокий нагрузки, а или, ну, в общем, персонализация - это одно, а работа там с кэшем - это другое. Вот, в общем, вот такие вот темы ожидаем. Лёш, а можно я наброшу? Давай. Тут есть, тут пропущен один важный пункт. Я не я не помню, кто был спикером Кером, но там, короче, была история, как с одного Legacy, очень старого переходили на мини старое Leg, чтобы потом перейти на новое, почти не старое Legy. И там было пять уровней миграции. Я вот я не помню спикера, но, честно, вот это доклад, который мы очень дрались, и он очень милый. Да, да, доклад. Мы в этом сезоне его рассматривали, что-то такое вспоминаю. Ну вот я не уверен, в этом сезоне или в прошлом. Ну короче, ну там что-то со старого спринга что-то на более новое. Нет, не нет, там не спринг был. Я я бы точно запомнил. Так, коллеги, просла самое главное - это объясните. Что значит красно-жёлтый светофор? Красно-жёлтый светофор, да. Это, во-первых, это красиво. Это красиво. В общем, дело в том, что заявок много, но и мест тоже много. Поэтому мы обозначили здесь вот двойным цветом. Вот, короче, мы заспорили и не смогли решить, какой там должен быть светофор, поэтому сделали вот так. Чевых тем конференции. Так что мы просто готовы много принимать этих тем. Да. Да. Ну и сначала я спектром нарисовал, научился в Google доке это делать. Очень классно. Так, дата инженеринг. дата инженерка. В общем, в современном мире, в цифровой экономике, в мире персонализации, в мире датадрайвинг принятия решения, когда принимается решение на основе данных, датаинжениринг, а играет чуть ли не ключевую роль. А тут инженерное искусство пересекается с миром данных. Вот и мы, соответственно, ожидаем каких докладов от вас. Так, Александр, вот ты можешь это значит как оптимизация работы лифтов. Где лучше лифту стоять, чтобы меньше двигаться? Ну что там от датасаенса, даталейков, что там ДВХ, анализ, что ещё там большие данные. Собственно, частично здесь может быть задета, наверное, лэмки тоже, потому что, ну, собственно, большие данные им надо где-то хранить. Слушай, а может есть что-то более интересующее в этих, то есть сферы-то большие? Ну ладно, уже ушёл микрофон. О, кто быстрей. Знаете, очень интересует про кровавый enterprise, когда всё-таки bigataта становится бигдатой. Я знаю там немножко про ВТБ и их объёмы. Я знаю про Сберы, их объёмы. Вот хотелось бы, ну, понятно, что сравнить тяжело, но хотя бы в примерных цифрах, да, когда там на каком терабайте ломается современный стек из того, что пришло после оракла, да, когда там постгры сломается, когда Игнайт перестаёт нормально масштабироваться и вдруг становится монолитом. У меня можно будет на это очень творческий ответ. Вот сейчас 30 секунд. Я где-то 5 лет назад или сем на позицию аналитика данных брал человека, который может мне разрешить задачу про оптимальное катание на лифтах. Задача звучит так: \"У тебя есть 10 лифтов, надо оптимизировать их хождение\". О, кто-то знает эту задачу? Я знаю ответ. Заходишь в Сбер, там значит на Кутузе на 32 три разных входа. Три разных входа с тремя разными алгоритмами хождения лифтов. Выбирай любой. Я прошу прощения, но вот где-то 10 лет назад этой задачкой мучил меня мой начальник. Где-то 5 лет назад я перестал всех даты инженеров мучить этой задачкой. Кажется, что там где-то вот на каком-то объёме данных всё просто ломается, всё нормально. В какой-то момент всё получится. Предлагаю пойти дальше, Алексей. А, да, да. Здесь мы ожидаем построение тельпилайнов. Ops, data quality system. Вот здесь ты переключи, покажи светофор. А, ну ты же рассказываешь про это, да? Да. Вот. И в общем, так как вы пришли, небольшой небольшой секрет. В общем, дата. Давно не было, насколько я помню, докладов. Говорили от представительниц прекрасной половине человечества. В общем, если будет продата, то плюс 30%, я думаю, вероятность. Чети расстрою. У нас есть конференция дата и Тёнул. Дада. И вот там всё про дата quality там тоже есть. Да, я ходить. Я тоже там в ПК. Вот. А вот в общем-то это про датаинженеринг. Могу посоветовать себя показывать полный путь моделей, жизненный цикл, жизненный цикл данных при подаче заявок. Это, в общем, будет интересно. Так, следующая тема- технологии будущего и специализированные темы. Это тема для энтузиастов. Это тема про технологии, которые только начинают свой путь в в популяризацию или про очень узкий, но а очень важные Подожди, это типа запускаем ML-модели на RIS F? Поднимите руку, поднимите руку, кто знает, что такое F. Это тоже, ну, о, это неплохо. Какой показатель? Дата-центры в космосе, например. О, дата-центры в космосе. Космосе будет доклад на питерском хайлоде. Вот советую. Вот. А есть идеи, коллеги? В микрофончик, пожалуйста. Можно вопрос? А вот специализированной темы какой-нибудь там суперхардкорд в каких-нибудь сетях он входит? Будет ещё будет. Подождите, молодой человек, рано аудитория. Я просто не знаю, что такое специализированные темы. Да, это все темы, которые не попали в другие. Не, подождите, про сеть отдельно будет, и там можно что угодно. Тут имеется в виду скорее то, что что мы сейчас в основном не применяем, но что нам может быть в будущем интересно. То есть вот что-то только что стреляющее, что-то вот такое необычное, потому что сети мы используем все. Подожди. ML и Risk F два доклада на Ну, R уже понятно. Может ещё есть идея-то IPV6? Ну, слушай, а вот будущее по больному, да, зашёл сразу, да? IPV8. Ой, боже мой. Давайте УИ V7 сначала освоим. А, ну это да. Не, ну, кстати, юиды, кстати, версии семь очень проблемные, если что. Ну вот я говорю, давайте сначала их освоим хотя бы. Да. Да. Извини, Алексей. Алексей. Так, всё. Вот, в общем-то, такие темы мы ожидаем по этой, а тема низкоконкурентная, поэтому если вы подадите, то высокая степень вероятностей попасть в программу High Load+. А у нас же на Питере как раз есть пример хороший. Мы там взяли по криптографии офигенного спикера, и он рассказывает про гомоморфные криптографии, плюсики, минусики, как это сделать безопасно и не шарить пруфы. А не было ли это на прошлом Питере? Нет, это я тебя расстрою на этом, кажется. Может на прошлом я уже у меня чуть-чуть всё сливается, но я тебе поверю. А, хотя нет, это был ум тех на этом будет. Да, ещё на этом будет из интересного тоже про децентрализацию то же самое. С одной стороны, он подпадает про блокчейн децентрализация, с другой стороны это всё-таки специализированная тема. Да. Да. От тебя добавлю, что High+ - это сообщество практиков, которые каждый день каждый день решают сложные технические задачи. И поэтому, если у вас есть какой-то доклад, а, в котором вы получили конкретные результаты, есть опыт положительный или отрицательный, но главное, что он есть. Вот не думайте, что это слишком просто вот или узкотематично. Подавайте доклад, а программный комитет, куратор уже поможет докрутит, прокрутит, в общем, углубит и расширит. Саша что-то хочет сказать, Саша? Да, можно я скажу, потому что я больше всех орал, чтобы эти темы отсюда убрали, а их не убрали, и поэтому я не примену откомментировать это. Вот здесь вот есть специализированная тема, и идёт дальше, а, например, биллинг и платёжные системы под нагрузками, что как бы визуально может выглядеть как абсолютно хайлодная тема типа архитектуры и так далее. А, но и то же самое поисковые системы и так далее. Что здесь имеется в виду? что вы уходите в специфику именно процесса, который, а, менее будет интересен широкой аудитории. И есть вероятность, мы к этому придём ещё, что если так и произойдёт, то есть будет там 60% про матан, который делается в поисковых системах, который поймёт не только лишь каждый, а а вокруг немножко там стриминга кавки и так далее, то, во-первых, это пойдёт в специализированную тему, а во-вторых, есть вероятность, что в более маленький зал, но это спойлер перед нашим следующим блоком. Вот или поза следующим блоком. Вот что. Пойдёмте дальше. Ну, IPV6 я всё равно записал, да? IPv6 прекрасная узкая тема. Да. Да. Ещё раз всем привет. У меня основная сфера интересов - это инфраструктура. Причём инфраструктура очень динамическая. Чтобы вы понимали, насколько мне это интересно. Мы недавно с коллегами, буквально недавно, целый стартап на эту тему открыли, так что тянуть не буду. В общем-то, следующая тема - это платформа инжениринг. Коллеги, неожиданно внезапный платформ инжениринг. Да, подождите, а у меня можно вопрос? А чем дата инженера от платформы инженеринга отличаются? Они там что в одном случае дата, а в другой случай платформа. Ну вообще-то да. Всем давай сначала зал послушаем, потом я обязательно про это расскажу. Мне как раз интересно тоже мнение зала на этот вопрос. Может быть также зал начал тянуть руки. Вон вон он руки есть. Ну это всё те же. Это про INF, про софт Network, про там, не знаю, сорта Кубера и всего, что поверх настроено или что имеется в виду. Вот я ещё присоединяюсь к преведущему оратору. Хочется здесь услышать, как это, определение, что такое платформа. Так, так, так, так, так, так. Давайте вот там руки есть. Давайте попробуем по ним пойти. Да, слушайте, а я бы такую тему закинул. Клиентские пути какого-нибудь эээкэнд разработчика. А ты закидывай, мы примем. Не, ну я две темы не выкинул. На поговорить. Вот. Потому потому что все забыли, что клиентский путь, да? Что что на разработчика не смотрят как на клиента. Он там ээ какое-то десятое колесо в большой телеге, да, там и ему прежде чем то, что сделать ему надо там Кубер, Истио, Викторио. Круто. Мы всё пишем. Вот там Ян. Может, мы ему дадим микрофон? Нет. Может, у него есть Не, не. Да, давай попробуем. Вопрос такой, смотрите, меня ещё со времён, когда появились масштабируемые системы, э, стал интересовать такой вопрос: а можно вообще сделать такую систему, чтобы в припиковой нагрузке она автоматически забирала, например, с тестовых и девовских серверов э ресурсы и перекидывала в пром. И чтобы это ещё безопасно было и одновременно прозрачно для разработчика. Безопасники не одобрят. Я понимаю, да. Система нужна. А система нужна, да? Система нужна, но понимаешь, там же есть ещё виртуализация и прочее. То есть, чтобы как-то так ресурсики раз подвинул, гриндей прошёл, потом подвинул обратно или там Новый год встретили, всё хорошо вернули. 10 лет назад мой начальник тоже такое хотел. Мы это сделали. Да, есть проблемка. У 10 лет назад была проблемка в том, что кубера не было. Вот и мы думали, как бы нам не рожая Кубер, придумать Кубер. Вот сейчас это всё будет работать, всё хорошо. Просто скоро мы в это светлое будущее дойдём. А про ИАК больше, про практические реализации. Мы тут и акаком обмазывали, мягко говоря, офигели к тому, насколько это неудобно и болезненно. И в общем, хочется вот таких вот succesсторий про тривиальные повседневные инструменты и ак вокруг них. Ну и про Пумино это мы, наверное, сами расскажем. Это ты типа к сиди приклурутим агенты или не смотри Inнфраструк и этот этот ИАК старый старый не новый. А, о'кей. Нормально. Ну, на самом деле, мне очень понравилась тема про, ну, думать про разработчика, про его клиентский путь. По факту, когда мы говорим про платформу, мы в первую очередь, ну вот там, скажем так, вот в некоторых сейчас кругах именно витает такое понятие, как платформа. Многие компании ими уже мыслят. Это как раз-таки речь про то, что разработчик должен не думать про то, что у вас есть база данных, у вас есть какие-то стенды и так далее и тому подобное. А потом у нас будет другая проблема. Ты начинаешь стартап, нанимаешь одного такую инженер, вместо того, чтобы фичив про 24 на7 гнать, он начинает платформу делать. И через 10 лет мы начнём делать фича. Фичин стартапчику нужны. Именно. Именно. Зачем делать одно и то же много раз? Они все будут делать одно и то же много раз. Это нормально. Ну вот посмотрим. Ну смотрите, мы на самом деле про это уже много поговорили. Немножко про светофор. Он с одной стороны у нас есть конкуренция за такие доклады, с другой стороны они всегда котируются. Обычно в таких докладах всегда есть у вас уже прот. Вы что-то освоили, соответственно, у вас уже есть фактура для нас. С другой стороны, конкуренция не заоблачная, так что оранжевый. Ну что, продолжим. Теперь другая сторона этой медали. Подожди, что вы думаете о ней? Сэршники вообще есть в зале, да? А я извиняюсь, а почему у нас три темы одинаковые? Чтобы было А ты думаешь, они одинаковые? Ну я пытаюсь затроллить аудиторию, чтобы они начали понимать. Ну давайте про это поговорим. Да смотри, у нас в зале нет походу ни одного. Почему у тебя нервный смех был? Давайте ему вон ещё Александр тянет. Давайте мы Алексея выслушаем. Вот сзади ещё зелёный. Сейчас, сейчас по очереди зелён. Нет, не надо. Ну, здесь про другую сторону платформ, собственно. Мониторинг, э, поддержка, реакция на инциденты, там, не знаю, как там что-нибудь всё начало падать, а мы тут всё под поймали и выжили. Аэ, что ещё? всякие алертинги, гарантированные каналы доставки в том числе, потому что, ну, мало ли, мониторинг мониторингов, простите, тоже иногда тема важная. Мониторинг мониторингов - это просто лайк. Мы такую штуку сейчас делаем, как раз так, что знакомая история, прямо лайк. Жду заявку, доклада. Да, мне вот хочется больше историй тут про факапы услышать. Да, там как это топ докламип есть. Фелмип будет не спойлери. Да ладно. То топдоклад на прошлом Хайлоуде был как раз про факап. Вот про факап у нас будет отдельно. Про отрицательный опыт тоже интересно. Да, да, даже очень интересно, на самом деле. Да, вот доклады именно про Факап, ну, со стороны компании очень хорошо всегда заходят. Не знаю, успели ли вы заметить, топ, ну, топ- один доклад в прошлый раз получился именно про Факап. Ну, там просто рассказ был со стороны эксплуатации как раз. А вот дока доклады про фокапы, но не со стороны, когда не профакапилась эксплуатация, а кто-то другой, он в эту секцию войдёт. М, может быть, всё принимаем. Всё принимаем. Разберёмся, я скажу кратко. Смотрите, тут ещё можно добавить, что на самом деле DevOps здесь рядом ходит, так что его мы не забываем. Он у нас есть и часто идёт как отдельная подконференция. Светофор оранжевый, потому что доклады мы эти очень любим, но, соответственно, есть конкуренция. При этом аудитория тоже, ну, как сказать, это не супермассовые доклады, так что их много, меньшие залы, скажем так, часто идут. Ну что, продолжаем. Есть ещё немножко тематическая тема. Это языки, программирования, технические стеки. Ну, давайте попробуем подобравать, что у вас тут болит. Будем честны, потому что тема она немножко широковата. Давай попробуем. Смотри, ты же помнишь, что самый правильный язык программирует C++, а если не C++, то Раст. Ну, как бы всё. Продолжай, да? А всё, смотри, там как бы всё просто у тебя как бы C++ go pтоon. Вот. И больше-то языков-то нету, как бы то, что я умею ночью на Джаве написать, не считается. Ну го го. Так я и говорю, C++ раз. Ну, слушай, аудитория молчит, значит го не существует. Не, почему? Ну вот, вот микрофон, пожалуйста, на первый. Нене нет, давайте ему не давать. Это точка исключения. С точки зрения мадстатистики один человек не показатель. А давайте попробуем руки по поднимать. А у кого го в продакшене? Так, а питон? Ну, питона больше, кстати. Питона больше. Во. А у кого есть раст? А во а почему у тебя рука дрожит? Боится. В отпуск не отпускают. Второй год. Нет, смотрите, то есть тем есть очень много докладов именно про такие узкие темы. Они полезные. С одной стороны, их не так много часто возникает, потому что мы говорим именно про хайловод, когда у нас есть провод, большие нагрузки и так далее, да? То есть не просто нюанс в каком-то языке, да? А как он у вас в проде выстрелил и так далее. Не, ну мы же все знаем, что вот есть красивые языки, а есть похп. Поэтому оранжевый и красный. Да. Ну давайте не обесценивать другие языки, да. Но при этом при этом не так много докладов, соответственно, тут реально попасть. Ну что ж, продолжаем. Ещё одна вкусная тема высокопроизводительные вычисления. А давайте поговори. Вам микрофон не давать. Так, держите. Так, это моя зона ответственности. Как это мне микрофоны не давать? Тут же всё понятно. Если видите симпт, значит подать доклад надо. Если вы видите ГПУ, подать доклад надо. А если вы просто хотите про это поговорить, тоже надо подать доклад и мы я с хочется спросить, да? А кто знает, что такое симт? О, ну люди есть, слушай, вот подавайся. Не, ну давай так. Мы же, скорее всего, эту запись ещё люди посмотрят и по и мы там надеемся, что вот те самые люди, которые пишут на расте с симдом, они придут к нам, и всё будет логично, конечно. Так, коллеги, у кого-то есть ещё мнение, что что такое высокопроизводительное числение, о чём здесь интересно поговорить? Ну тогда поехали дальше, да? Давайте дальше. У нас, да, тут всё на самом деле очень просто. Когда у вас есть большие числа, когда у вас есть железо, как с ним работаете и так далее, всё это всегда интересно. Э, поэтому зелёный и краткость сестра таланта. Аплодисменты за этот слайд. Наконец-то, наконец-то. Как кратко. Не, ну вообще там пропущен ещё один пункт, я считаю. Там просто надо было написать высокопроизводительное вычисление, а потом вычисление на ГПУ, и тогда бы было бы всё правильно. И давайте поясни тут название другое. Давайте поясним, наверное, что такое суперкомпьютеры здесь, да? Потому что суперкомпьютеры что-то такое. А это, во-первых, сетевой иconконнект. Мы ждём доклады про оптимизацию там и ключевые слова здесь Infinity Band, Milanox и вот это вот всё. А дальше программный стек это ныне, кажется, почивший уже MPI. А что там у нас ещё есть? Ещё есть нума система, потому что, как известно, у нас новый процессор AMD. Вы покупаете один процессор, а вас подставляют у вас четыре процессора. Просто вы не знаете, как их правильно. Коллеги, у нас уже доклад начался, давайте подаваться на следующий Моск лучше с такими вещими. Давай, да. В общем, вот такая вот история. То есть мы смотрим на вот вот такие вот ключевые слова здесь и ждём. Очень спасибо, Саша. Ну и самое вкусненькое файл Meтап, про которые мы немножко уже заспойлерили. Дадада. Это то самое мероприятие, где нету записи, во-первых, чтобы вы понимали. То есть там можно услышать именно из первых уст ту самую историю. Тольда, только лично. Соответственно, очень рекомендую, вот личная рекомендация, приходить за 15 минут в зал, за 30 к лучше за 30, если вы хотите занято всё будет, потому что за 5 минут вы будете стоять уже в коридоре и смотреть это с телевизора. Дадада. Да. И вот в лучшем случае туда будет трансляция, которая я во они не транслируются, коллеги. А мне можно сейчас? Я уверен, что это смотрит. Давайте просто похлопаем, потому что у нас тут полтора землякопа организатора есть. Давайте им похлопаем. А кто-нибудь был на фейлмитапе? Ну и как вам понравилось? Да, это был топ всем нравится. Всем рат очень популярный формат просто. Ну, кстати, к слову скажу, что вот он в топ как бы не попадает, но технически он обычно примерно в лидерах топа всегда. Да он топ- один по по аудитории однозначно. Ненене, вы не забывайте, это стат под грешность, мы их просто выкидываем. Ну ладно, давайте дальше, да, есть ещё немножко другой формат. Это непривычная рам то есть всё, что не касается, скажем так, наших с вами ежедневных обязанностей и так далее. Ну вот, кстати, вот говорили дата-центр в космосе и так далее. Это на самом деле такой интересный пример доклада, вроде как про нашу тему, но на самом деле не совсем, потому что это очень изощрённая тема. Ещё А я извиняюсь. А вот у нас нам надо явно это у нас же двадцать пятый год идёт, скоро двадцать седьмой, надо про хардвера поговорить. Что думаешь? Пойдём про хардвера поговорим. Про железо? Ну, мы надо говорить, конечно. Конечно, всё, короче, пойдём делать вот всё договорились. Замёта на скоро двадцать седьмой. Ну, смотрите, тут буду краток. То есть основные примеры тем - это околонаучные выступления. В идеале там у нас были доклады именно от учёных, которые рассказывали про свою деятельность. Это очень интересно бывает по, да, научпоп. Это, да, по сути, научпоп, да. Смотрите, мы очень много говорили про то, что, ну, какие критерии мы предъявляем, и, наконец-то, мы к ним и подошли. Что такое сильный доклад с позиции программного комитета конференции? Основные критерии, вот вы, в общем-то, можете их видеть, я по ним очень кратко пройдусь. То есть, в первую очередь, важен личный опыт. То есть это то, что вы сами пощупали, то, что вы сами знаете и какие проблемы и грабли вы собрали. Конечно же, мы очень будем любить цифры и любые бенчмарки и так далее. То есть, если вы принесёте их, это прямо всегда очень-очень большое преимущество, на самом деле. Вот тут немножко отступление. Очень большое преимущество, когда вы приходите уже с контентом. То есть, если у вас там образно вот есть пример, там, вот я вот так бы рассказал эту презентацию, вот она практически готова, это всегда облегчает жизнь программного комитета, да, на самом деле и вашу, потому что вам меньше банально надо рассказывать в моменте, вы можете показать её. Ну, пункт глубина, он очень похож на все остальные. То есть это опыт, это масштабирование, это какие-либо такие вещи. Практическая польза - это квинтессенция всего этого. Мы обычно любим задавать себе вопрос: \"А что слушатель, который вот послушал ваш доклад, вынесет для себя вот такую вот основную мудрость, чтобы он в идеале на следующий день мог бы использовать сво так называемый takeaway\". Мы говорим кратко какойway докладывать любимое выражение, до одного наших из наших коллег. В общем-то, все эти пункты, если вы их можете выполнить, вы сильно повышаете качество вашего доклада для программного комитета. Конечно же, это не значит, что их все надо обязательно выполнять. То есть, если что-то по каким-то причинам у вас специально опущено и вы знаете, и вы можете объяснить, почему это не нужно в данном докладе, без проблем, но это вам поможет. Ещё добавлю. Хотел добавить, Гер, что важно не только на что вы перешли, то есть про решения про свои рассказать, да, а почему вы на них перешли, то есть какие-то инженерные. О, да, очень, очень классный момент. Когда вы перешли на какую-то базу данных, хотите про это рассказать, мы точно спросим: \"А почему же вы другую базу данных выбрали и почему вы на неё переходите?\" Потому что это очень важный вопрос. Выбом вопросом, да, и практическая польза. А в идеале это, чтобы посетители конференции захотели применить ваш опыт прямо на докладе. Вот у меня лично был такой опыт. Я на созвоне, мне было очень интересно. Спикер рассказывал про оптимизацию кликхауса, и я еле сдержался. Довёл созвон до конца и всё. И пош, слушай, ну хотя бы через стейдж, надеюсь, применяли, да? Ну отлично. Тут руководство, да, да, через Ну и смотрите, очень важный момент. сильный доклад, который мы вот только что рассказали критерии, это не значит, что он массовый. Это, к сожалению, это абсолютно нормально, что очень сильный и очень хардкорный доклад он будет на узкую аудиторию. То есть к вам придут и, ну, то есть вы можете выбрать для себя, когда вы подаёте доклад. Вы всегда делаете этот выбор. На самом деле вы должны ответить для себя, а для кого вы его делаете. Это либо массовый зритель, соответственно, он не будет сильно погружён в тему, и это и и вы будете вынуждены рассказать ему подоплёку, проблематику, объяснить, это всё время вашего доклада. Либо наоборот, вы можете всё это упустить и уйти в дикую технину, которую поймёт только один Александр, например. И да, к вам придёт Александр, но больше народа может не прийти. При этом ваш доклад будет очень классный, он будет котироваться, про него будет запись, как и про все другие доклады. То есть это всё равнозначный доклад. Просто он будет в меньшей аудитории, на меньшее количество людей. Обычно вы этих людей ещё будете в лицо уже заранее знать. И мы такое тоже берём, да. И на самом деле мы такие очень любим доклады. То есть, смотрите, важный момент, у нас нету предпочтения к какому-то из этих чаш весов. То есть они все классные. Просто вы для себя должны, когда делаете доклад, сделать выбор для кого. А можно я тогда потроллю, кто делает презентацию? Не, если это два пункта, просто они проразные, нельзя одно делать зелёным, другое красным, потому что вы по умолчанию не во всех культурах зелёный хорошо, красный плохо. Поэтому вы, кажется, немножко когда делали прези, я бы её про то не про хорошо или плохо? Ну это вы так думаете. У у Гриша говорит, что вот есть некоторый набор это предикшенов. Тут то же самое не нажамная тема, если что. Гри с языка снял. С языка снял. А, конечно, конечно. Хорошо. Это холиварная тема ПК. Тёмная тема или светлая? Да. Смотрите, давайте заканчивать форматами выступлений. Мы уже говорили про то, что стандартный формат - это просто доклад. Вот мы сейчас перед вами рассказываем, как горшки делать, например, да, и, например, диалога у нас нету. Что у нас сегодня происходит? Это что-то скорее больше похожее на мастер-класс, где мы и сами общаемся, и показываем вам что-то. Ну, там, например, если бы я сейчас показывал вам, что как делать горшок, как делать презентацию, это был бы мастер-класс. И третий формат, когда бы мы вместе бы делали этот горшок или вместе делали презентацию - это так называемый воркшоп. Важный момент, вовлечённость растёт. То есть в воркшопе вовлечённость дикая, и люди запомни, вот точно запомнил чуть ли не на всю жизнь, что вы им рассказывали. Но и сложность подготовки такого до, ну, то есть воркшоп обычно делается на на два слота, но и подготовка тоже сложнее. Зато вы останетесь в сердечке человека. Это прямо наверняка. А слабо ответить разницу мастер-класса и воркшопа? Что ещё раз? слабо рассказать разницу между воркшопом и мастер-классом. Кроме того, что вы картинки разные нарисовали? Ну, я постарался рассказать. Ну, давай повторю тогда на всякий случай, что, соответственно, разница в чём? Мастер-класс вы показываете, как вы в моменте делаете. Обычно вы можете лучше подготовиться здесь с позиции того, что вы можете собрать очень сложный демостенд, на который вы в моменте там, я не знаю, нагружаете базу данных и делаете бенчмарки и так далее. Но проблема в чём? Такой стенд, его надо эксплуатировать, его, ну, с ними надо обращаться. Это обычно сложность, которую вы знаете, заранее подготовившись. На воркшопе вы просто взяв тот же самый стенд и сделав тот же самый Bчmмарк, позволить себе не можете. Соответственно, Workshop - это когда ваши зрители делают то же самое, но зритель он приходит неподготовленный, и это очень важно. То есть вы не сможете дать ему какую-то глубину, вы сможете дать ему основы, чтобы он понимал, а что дальше, ну, образно в будущий раз в какую сторону гуглить, чтобы он вспомнил вот эти те самые слова, чтобы он пощупал, чтобы, я не знаю, если вот мы, например, с коллегой делали воркшоп про сети, наша цель была, чтобы люди просто поняли, что вот, ну, как пакетик устроен, как он ходит, да, базово, конечно же, он не, ну, человек не запомнит точно, как что там устроено, он, по крайней мере, в следующий раз сможет погуглить в нужную сторону. Ну да, давай. Да, от руководства в лице Вики поступила разнарядка, потому что там ещё 10 слайдов моих, но мы решили их скукожить до 1но минуты примерно. То есть, что важно помнить помимо того, что коллеги уже сказали, пожалуйста, помните две вещи. Первое - это, а, уточняйте, если у вас нет деврела, уточняйте у пиар-службы. Можете ли вы рассказывать это в таких э словах, как вы рассказываете, и в таких картинках, как вы рассказываете? Потому что вам может показаться, что этот мем смешной, но на самом деле он не смешной с позиции компании. И компания не хочет видеть, чтобы этот бы чтобы этот мем засветился где-то в соцсетях. Типа: \"О, смотрите, прикольно докладчик из такой-то компании прикольные мемы постит\". А если у вас есть деврел, спросите деврела явным образом. Там вы с пиаром обсудили или нет? А мы отлавливаем такие вещи периодически. Мы, в принципе, не очень любим, что этим заниматься, потому что нам в целом как бы не очень это нужно, да. А, но бывали у нас случаи, когда PR снимал, а, доклады докладчиков именно по этой причине, в тот момент, когда нам это было очень неудобно, нам нуже нужно было искать доклад. А второе, если вы чувствуете, что вы не вытягиваете, то есть вы уже даже согласовались с нами, да, а по докладу мы его приняли по докладу, но вот не не вырастает цветочек по какой-то причине. Снимайтесь, вы не попадаете ни в какой чёрный список, мы не обсуждаем там ха-ха-ха, вот этот чувак снялся, да? А мы это понимаем, и мы ну можем предложить какие-то опции, перенести и так далее. То есть здесь стесняться не надо. лучше заранее сказать, чем, а, потом оказаться, что там за неделю до сдачи ничего не готово. А вот всё 10 слайдов скукожились до двух предложений. Передаёвчик. Зато зато очень важно, потому что на самом деле из-за этого бывает очень много проблем, и многие хорошие доклады не увидели свет ровно, потому что компания сказала on proof. Давайте будем избегать ситуации. Саша, спасибо тебе, ты очень классно рассказал. Смотрите, здесь мы хотим спросить у вас, вот мы сейчас обсудили очень много тем и так далее. Может, у вас появились какие-то вопросы и предложения? Ключевое предложение, потому что у нас есть, на самом деле, очень много плюшек за предложения, которые применились к конференции на больших масштабах. А давайте мы вот начнём не с Александра, вот вот потому что это не Я просто был на позиции Александра. Я поэтому тут надо уметь в диспатче. Я, знаете, что хотел поделиться. Ээ такая такая вещь. То есть ты копил себе там эту тему год там пришёл, выстрелил её за 30 минут. Если она сложная, вот то, что у тебя было нарисовано сложное, то с тобой бы рады были поговорить, но люди просто не успели подготовиться. Да, вот им бы заранее прямо буквально тезисы все полные доклады опубликовать, чтобы люди подготовились и пришли тебя спрашивать предметно, потому что они иногда вопросы там через полгода там приходят, да, говорят: \"Слушай, наконец-то я дошёл до твоей темы, я готов та А вы, когда подаёте заявку, вы в тезисы можете вписать довольно много\". И так делают, более того, но их не читает. Слушай, а у меня такой вопрос. Если человек не читает тезисы, а просмотрит ли он вот эти 30 секунд? Ну не знаю, вот как бы такую проблему, что хочется подготовить аудиторию, да, чтобы люди прогрелись заранее, да, и поспорили. Не, и это, смотри, я хотел бы, чтобы работало, как ты говоришь, на практике все люди разные. Кто-то хочет тезисы читать, кто-то готов только тайтлы. У нас, на самом деле, есть ээ формат, где мы, где докладчик перед конференцией через каналы Онтика может публиковать как раз шорцы и другие форматы, где можете рассказать про свой доклад. Это тоже есть, кстати. Да, такое есть. Только это надо будет вам записать, подготовиться, если вы готовы. Мы только за. Давайте так. Когда вы будете в следующий раз подаваться и пройдё, ну, пройдёте и будете выступать, вы можете обратиться к членам программного комитета, к вашему куратору. Он обязательно сведёт вас с нужными людьми, и это всё работает. То есть, это всё уйдёт в маркетинг. И да, да, маркетинг всегда с удовольствием принимает информацию, которую может опубликовать. Они и рады будут более того. Да. Дададада. Так, а вот там теперь можно Александру честно дать коротенький вопрос. Вот. Озвучилось мастер-класс, даклад и workркшоп. А, во-первых, тайминги. Во-вторых, я услышала фразу, что есть, э, стремление к более к увеличению воркшопов или чего-то такого. Соответственно, подаваться можно не только на доклад. Ну и говорит, что там типа я хочу провести воркшоп. Да, всё так чуть ли не прямо название можете написать. Мастер-класс двоеточий, workкшоп двоеточие. Под workкшоп, смотрите, под workкшоп мы можем выделить сколько угодно слотов. То есть слот - это, стандартный слот - это 45 минут. На самом деле около часа, потому что 40 на выступление плюс 15 на вопросы. Нет, вообще на выступ, ну 45 максимум весь слот. 50 максимум. Ладно. На workкшоop можно выделить два-три слота, четыре, сколько надо будет. Реально. То есть тут не проблема это. Ну да, вот вопрос был. Да, да. А, ну а доклад - это да, ну 3040 минут плюс из практики мы можем подготовить площадку под вас, как вы скажете. То есть там, например, столы поставить, это всё работает. То есть вон мы даже интернет могли, ну могли, как сказать, точку отдельную доступа делали. И это тоже работает. А я правильно понял, что Highot - это вот чисто хардовая конфа? То есть про, собственно, людей, которые этот хайлот делают, я вообще ни одной секции не увидел, не услышал. Подожди, а Тимлид у нас есть отдельная конференция Тимлидкон в Номледы и не все в Тимледы метят. То есть есть куча разработчиков, которые тоже как-то развиваются, которые тоже как-то выгорают, которым тоже как-то надо и технически развиваться, и совтовой, и так далее. в рамках. А, да, Саша, давай ты расскажешь. Вот как я это вижу. Моё мнение может быть не как бы одним из мнений нашего ПК, но у нас есть конференция для ПХП, отдельная сапконференция, у нас есть отдельная Pro SRE, у нас сейчас вообще очень много отдельных узкостримовых конференций. Мне кажется, с одной стороны, это плюс, с другой стороны, минус, но тем не менее, пожалуйста, вот ты как хардовый человек, иди на более узкую, там database internal i confamlead конф, pпp конф и так далее, и так далее. Так, давайте вопросы из зала. Подожди, Саш, а закончи мыслью предложи какой-то вариант. Ну, собственно, там какую-то, не знаю, там секцию и не секцию, но хотя бы подумать о том, что софтовые какие-то доклады, им тоже может быть место на хайлоде. Двух словах, есть узкотематические вещи, и туда можно попробовать попасть, но сразу скажу, что очень большой шанс, что Тимлит Конфы похожие конференции заберут. Но попробовать можно. Попробовать. Там не очевидно. Там, видишь, люди, смотрите, мы сейчас начинаем теоретизировать. У меня есть предложение вот эту часть чуть-чуть перенести out the scope. И вот у нас будет кусок автопати. Давайте потом обсуж совсем времени нет уже. А там были вопросы сзади, я вот вижу. Вот. Да, да. А можно я ещё это? Да. У нас аналог нашего пкашного созвона. Белоцерковский тянет руку, значит. Саша всегда тянет руку. Интеллигентно, но там всё время разговоры. Хотел бы, ворвался. Ребята отдыхают там. Да. Саша, очень простая причина. У нас даже сейчас пухнет адженда от того, что мы хотим взять. Она распухнуть не можем. Мы уже на улице сидим практически там периодически, да. А второе по поводу отдельной секции и так далее - это предложение не к нам, это предложение к партнёрам. А мы всегда открыты к этой истории. партнёры, приходите, что угодно вот мы соберём из из докладов, из э любую тему, в общем-то. А так мы ориентируемся на то, что нам аудитория говорит. Пока что нам аудитория вот не говорит, что однозначно нам нужно на хайлоде вот четыре доклада по этому объединённую секцию. Вот. А так мы просто пухнем. У нас места нету от того, что мы хотим взять. К сожалению, к счасть, давайте дальше. Я прошу прощения. Вот. Да, здравствуйте. Да, добрый вечер, коллеги. А, тут, оказывается Путин с Турцией встречался. Простите, я очень долго ехала. Не, вот можно без политики, пожалуйста. Без политики. Вопрос такой. Гемификацию в рамках конференции планируется, развивали и хотите предложение? А, хотим предложение. Не, потому что мы, я как главная зануда всё время хочу всё гимифицировать, потому что мне кажется это хорошимшим путём. Приходите, обсудим. Арина, а гемификация для спикеров или для для кого? Нет, для участников, очевидно. А у нас есть разные категории. Это компания МВС, Архитектура Лката, есть опыт, рады сотрудничать. Лёнтересно. А, понятно. А я не знаю, но очень любопытно. Пообщаемся тогда. Спасибо. Приходите. Да, гемификация - это круто. Я тоже поддерживаю. О, Виктория, да. А, да. Ну хорошо, давайте последний, наверное, и питчинг, а то уже вообще Да, я, кстати, про архитектурные катать абсолютно классная вещь. мы в Сбере делали. И очень хотелось бы, наверное, всё-таки какую-то секцию действительно, куда ээ расти, ну или что может ещё, кроме вот и сложной программерской части, куда расти там программисту, куда расти там, не знаю, DevOps инженеру именно в софтовых скилах и именно на этой конференции? Почему другие сложно вот на другие уходить? Потому что это ещё одна конференция, и весь день слушать доклады только про там сложные какие-то штуки, гпушки и так далее, тяжело, хочется переключиться и отдохнуть. У меня есть классная ответ. Не нравится литконов, есть автопатия. На автопателя объясним, куда расти. Нет, смотри, я я после своего доклада 2 часа отвечал на вопросы, причём большая часть людей убегала на другие интересные доклады, потому что, ну, времени, как всегда, в обрез, всё очень плотно, все уже всё записали, но пообщаться ещё хотелось. Апати не хватило. Вот всё правильно. Вот, вот для этого и нужны автопати. Вот в после первого дня автопати нужно для чего? Для того, чтобы все микросервисы смогли синкнуться. Всё же логично, как бы у нас как бы как цифровые агенты, у нас как бы люди повторяют микросервис, всё хорошо. Тут Тут, кстати, ещё один нюанс по поводу автопати, что на автопате у нас тоже есть активности, и мы как раз изучаем, что делать-то, собственно, вот если вам прямо интересно на вы готовы на автопате вот стинкнуться в какую-то дополнительную там по софтскилам, напишите нам в отзывы. Это нам очень нужно. Мы очень много обсуждали. Кстати, отзывы работают. Если что, пишите туда, что вы желаете. Да, да, мы хотели круглый стол собрать. Может, что соберём? Круглый стол про что? Ну, начинается. Давайте поедем дальше. Подожди, мы уже с тобой круглый стол про железо делаем. Всё хорошо. Мы же уже почти договорились. Вик, давай пичинг поехали. Вика, кто знает, что такое пичинг? Давай начнём с простого. Да, совершенно верно. То есть теперь давай повторим на микрофон. Это представление идеи. комденаспособ окни покрутим короче у кого есть мысли по поводу потенциальных докладов о давайте рассказывайте а мы обсудим ну я я немножко может быть длинно да потому что у нас цифровой двойник Сбера именно в части IT не в части всей компании Сбер в части именно ITбера я 2 года год назад рассказывал про архитектуру, как вообще устроена архитектура в Сбере, какие слои и так далее. Вот она у нас вся цифровая. А ещё по нашей архитектуре открываются каждый день доступы автоматически безопасность забирает эту архитектуру для своих процессов и следит за периметром, например, по IP контрактам и так далее там. Э то есть наш продукт проник, в принципе, во все сферы ITСбера. Ну, там для примера несколько там ээ ну, наверное, мне циферки сейчас не стоит говорить, но много людей пользуются нашим продуктом. У нас мало там больше, чем можно представить даже большую компанию каждый день. Это айтишники, заходящие, пользуюся пользующиеся нашей системой. А ещё у нас куча фейлов, потому что мы думали одно, а на самом деле все эти гипотезы можно было сразу смыть в унитаз, потому что они не работали. То есть мы сделали не спрашивая пользователей, дали, они сказали: \"Гадость, пользоваться невозможно\". Мы сделали другое, опять гадость, пользоваться невозможно. Потом мы всё-таки сходили к пользователям, попросили дать обратную связь и с помощью обратной связи сильно улучшили э наш продукт. И не только наш. У нас, если вот брать всё окружение, которое пользуется нашим продуктом, это там десятки разных автоматизированных систем. Вот про это можем рассказать. И может быть даже не один доклад, а может быть и один, не знаю. Там и про безопасность есть. То есть может могут люди от безопасности прийти, рассказать, как они используют, там сканируют на уязвимости и так далее. Доклад в Проде. Тема интересная. Есть фейлы. Я за. Примерно за фейлы, да. Ну, в общем-то, практически опыт есть и и масштаб. А что значит ты говоришь? Можно на ты, да? А там есть что значит несколько докладов? Вот раскрой тему. Как? Потому что много большой объём можно разбить на несколько. Да я я как как это дам вы вместе? Да вместе работаем, да? Ну то есть ээ наверное так ко мне часто приходит часто приходит рассказать про инструмент управления архитектурой в Энтерпрайзе. Вот и у нас мы отошли там от классического подхода там только системы. Мы вот там по любой системе можно там до IP-адреса спуститься, и нам начинают, ну вот вот это всё прямо практически, то есть нам уже у нас спрашивают финансисты: \"А сколько стоит там шаг бизнес-процесса с точки зрения IT?\" Ну вот, например, пока не на всё можем ответить, но вот детальность проработа то есть про косты рассказать сможете. Я правильно услышал? Вот это, кстати, классная тема. Я я могу рассказать про про концепцию вообще, как это запустить, там про объекты на каждом уровне. Там можно рассказать очень нишевую историю, там как, например, безопасность что-то защищает, но это лучше вместе с безопасностью. Можно вот про историю, как выявить там систему с высоким CTO и низкой технологической зрелостью, например, ну вот смотрите, вот с чего бы я начал раскручивать этот доклад, вот придя, ну мы всегда с докладчиком первый раз встречаемся, кура назначается куратором, соответственно, с ним общаемся. Вот какие бы у меня были первые вопросы, а я бы уточнил. Ну пока что я услышал очень много описания вашего и вашей готовой системы. Соответственно, ээ я бы отталкивался здесь от пользы, которую мы хотим рассказать. слушателю. Пока я не совсем её понимаю и её надо прокапывать. То есть, мне кажется, у вас много возможных интересных тем. Это надо точно конкретизировать и разбивать на несколько заявок. Это точно. Соответственно, я бы отталкивался от вопроса, как может слушатель сделать то же, что самое, что и вы сделали. Вот пока вот я вот это не услышал. Слушай, ну это корпорация entтерпрайз, не каждый сможет повторить. С одной стороны, да, но с другой стороны, какое-то уникальное знание мы должны вынести. Ну давайте так. Есть проблема определённых докладов, чтобы они не были отчётными. То есть вот мы сделали и вот мы молодцы. Вот короче, если takeway не будет, то не возьмёт. Перевожу по-простому, да. Нужен, а вот мне про финансы понравилось. Вот прям косты - это прямо мастх. Об этом очень мало рассказывают, а жалко, потому что это всем интересно. Ну да, это как-то и это сложно. Это реально сложно считать косты. Вот вы, я так понимаю, вы уже это делаете. Я тоже пытаюсь. И это прямо боль, это прямо сложно, это прямо есть о чём рассказать, поделиться. Ну, я правильно понимаю, здесь лучше как раз зайти вот, ну, на программный комитет и пообсуждать, в какую сторону там лучше это разработь. Смотрите, тут можно в несколько сторон, вы не забывайте, да? Вы можете подать заявку, на самом деле, а можете на самом деле несколько от одного человека подать и в каждоый из них расписать нюансы. И плюс там есть прямо отдельная секция для программного комитета, и вы как раз-таки можете эти, да, обращение к программному комитету. И вы там можете как раз все эти подробности рассказать. Вот очень важный момент, что вот вот мы пытались подсветить. Какие нюансы вы можете там указать на слайдах, когда показывали, да? Вот если вернёмся очень, наверное, мне кажется, будет полезный слайд как раз видеть перед собой, что такое сильный доклад. И вот чем больше вы раскроете вот эти пункты, тем нам проще будет вас понять. Ну, наверное, так скажу. Вот. Ну и перейдём дальше. То есть вот вы там, допустим, знаете, что у вас стоит в проме, особенно если вы только вышли на проект и оно уже 10 лет релизится и было Legси. И вот, и мало кто знает, ну, с точки зрения архитектуры, вот мы там придумали, как это всё вытащить. Вот смотрите, если вы ответите мне на вопрос вот как мне сделать похожее, и я вот после прослушивания вашего доклада это пойму, то вот это есть тейкавеи, про которые мы говорим, да? Понятно. Спасибо. Ну, можно я последнее кратенько? Смотрите, мы там и практическую пользу согласны рассказывать, там и цифровые примеры. То есть я правильно понимаю, что мы можем сделать несколько заявок немножко в разные области? Так и надо сделать. В вашем случае однозначно так и надо сделать. У нас есть ещё формат, когда люди чуть ли не из года в год продолжают рассказ про одну и ту же систему с разных сторон. Да, это абсолютно нормально ссылаться на предыдущие доклады в них. Просто главное, чтобы он был самодостаточным. Да, давайте дальше. Кто ещё у нас готов? Да, спа, спасибо. У вас на втором слайде была такая строчка микросервисная архитектура истории успехов и провалов. Так вот, но мне кажется, что то, что мы можем рассказать, больше, наверное, подходит даже для фейлмитапа. Можем рассказать, сколько стоит нарушить закон конвея. Давай ты подашь. Я мне уже нравится, когда мне говорят слово закон конвея, я знаю, что ты явно знаешь смысловую нагрузку. Давай подавай. Я только Ну, слушайте, если это можно под запись, то лучше не на Фейме. Тогда мы можем отдельно доклад пустить. Да, ну подождите, давайте на FU будет более концентрированно, будет как бы меньше А смотри, да, я по-простому объясню. Meтап - это 10 минут у тебя выступление и нет презентации. То есть ты выходишь вот так вот вот на сцену стендап и вот так рассказываешь перед залом полным и всё как бы ничего. Вот если это тебе подходит, тогда туда. А если тебе надо 20 минут, 30 и нужна преза, тогда это отдельная презентация. Там больше отдельная заявка там. Ну как бы да, смотри, это не юмор, там очень понятный takeйкавей, но я смогу его рассказать за 10 минут без реквизита. Я тогда meтап норм. Так, у меня есть предложение. Давайте перестанем на людей давить. Подавай заявку, дальше разберёмся, куда это за и мы там будем давить. Да, лучше попробовать с обычной заявки начать, а дальше на файл meп мы успеем средирекректить. Да, да, всё. Так, а какой там порядок вообще по подачи на файлтап? У нас есть форма приёма заявки, соответственно, там, ну, заполняйте пункты, которые там будут. Очень важный пункт - это как раз-таки обращение к программному комитету. Вот всё, всю изнанку, вот всю суть вот туда описываете и всё. Короче, в свободной форме подаёшь и всё. Просто пишешь прямо вот в свободной форме. И второе тоже предложение по формату. Мы думали это сделать. Может быть, вы уж уже делали что-то вроде антидоклада, когда ты выходишь к аудитории, говоришь: \"Вот мы пытались сделать вот это, вот это, вот это\". Ничего не сработало. Как делать, мы не знаем. И нам не нужен пиар, нам не нужно как бы ответы. Нам вот надо или обняться и поплакать, или сказать, может быть, вы попробовали, у вас получилось, если кратко, это отличный формат доклада. Это вот как в науке, то, что отрицательный результат - это тоже очень важный результат. Такие доклады очень хорошо тоже заходят. Да, можно я повторю мысль? Подавай оба доклада, там разберёмся. О'кей, спасибо. Я не понял, что он будет делать 20 минут на сцене. Вот ещё интересен э у меня такая тема есть, знае на на тему поделиться опытом, ну, может быть, даже с молодёжью, не знаю, банальные всякие вещи, да. Вот что такое стрейс, например, как он работает, что что он показывает, да, все про него слышали, но как им пользоваться, может быть, никто не знает. Я не знаю, насколько это актуально там для синьоров, да, которые большинство составляют этой конференции. Но, наверное, у меня некоторые синьоры там на работе спрашивают, как пользоватьсярейсом. Поэтому я думаю, что всё равно не все знают, насколько это актуально. Вот такие банальные, вроде бы, повседневные постоянные вещи может быть в формате мастер-класса, воркшопа или, может быть, доклада, если там реально много. Смотри, в правильную сторону ж мыслит человек. Не абсолютно правильно. Главное не дойти до самого странного, чтобы на воркшопе начать объяснять разницу в Питоне процента F-строки и т строки. Вот главное вот до такого не дойти. И в принципе нормально. Не, ну знаешь, с практической пользы, да? Вот зачем нужен? Нуче кто-то им пользуется, чтобы что-то отдежить, да? Ну, естественно, и показать, как считать классические стрейсы. Ну да, меня всё устраивает. Ну вот тут можно добавить как раз про форматы докладов, то, что упоминали, Workshop и так далее. В чём ещё разница? Что Workshop вы должны рассказывать про относительно базовые, простые вещи на нём, чтобы люди поняли, смогли в моменте сделать. И как раз вот такие темы, они очень классные для воркшопа. Поддерживаю. То есть доклад о том, что Я уточню просто. Доклад о том, что такое стрейс в виде просто доклада и и цитирования там мана, он не такой полезный. Мастер-класс, хотя бы мастер-класс. А в идеале workкшоп - это вот то, на что люди придут толпой и с удовольствием сделают ещё раз. Можно я только к своему коллеге добавлю один комментарий. Вот маны, да, ман равно задать в перплексити запрос. Он хорошо умеет подбирать правильные статьи и материалы. Нет, это не то, что мы хотим увидеть. Если вы смогли зачитать весь ответ Perplexity, это не доклад и это не активность на конференции. А вот ваш личный опыт - это очень нужно. цены важно. Да, там был человек. А, а можно, прежде, чем мы перейдём, потому что коллеги намазали мёду, но на самом деле всё не так радужно в наших обсуждениях воркшопов. А запомните несколько вещей, если вы хотите практику показать. Это сценарий, а, и личный опыт. То есть личный опыт понятно, а вот сценарий далеко не всем понятно, что это такое. А если мы берём Sace или любую абсолютно хоть там какого уровня тулу и начинаем объяснять бессценарноя, это неинтересно. А если вы возьмёте Тулу и построите с помощью неё, а, полноценный, я не знаю, что-то, процесс, сценарий или так далее вместе со слушателями, вот это вот уже значительно повышается, потому что, коллеги, ну давайте быть честными, мы сколько зарубили воркшопов, Саша, пожалуйста, перестань мне уменьшать воронку. Ты уменьшаешь воронку. Не слушайте его. Он просто хочет уменьшить воронку нам. Давай по-другому. Ну вот он правду говорит. нормально, что волокшопов много зарезать. Да, да, давай просто скажем более общие. Любые фундаментальные доклады тре, ну, если вы приходите, хочу рассказать про что-то фундаментальное, если вы приходите без чуть ли не готовой презентации, шанс у вас сильно меньше. То есть для таких докладов чуть ли не само собой разумеющееся, что мы сразу видим, что конкретно и как вы будете рассказывать. То есть воркшоп обычно его обсуждение начинается с того, что у вас уже есть сценарий и вы чуть ли не уже обкатали на своей, ну, внутри вашей компании и объяснили, что вот смотрите, у меня там джуны теперь знают то, что синьоры не знают или, ну, типа того. Короче, готовиться будет надо. Короче, я понял. Я к вам приду с воркшопом, как вместо шаблонов на C++ писать. На C++ 20 появились реквайроментсы. Вот как с помощью них, короче, заместить шаблоны. Я у меня как раз всё, что Саша хочет, есть. Только это нафиг конференции не надо. Дадада. Вот это надо запомнить, что это вы должны воркшопом продать идею, а если вы просто думаете, что это популярно и так далее, это ты что в мире C++ - это очень популярный вопрос. Шаблоны или реквайрами со сфиной? Что ты? Давайте дальше. Да, у меня я дополнил предыдущего оратора по поводу мастер-классов воршопов. тоже про базовую идею. Имеет ли смысл показать людям, как запустить контейнеры в двадцать пятом году без ничего вообще? Что такое контейнер? Голенький RНC, Crраunль, прочие альтернативы наркоман местами, да, но надо углубить. Ну то есть, ну наско, ну в смысле это вот прямо, ну липконтейнер, да, куда ниже-то. Понимаешь, в чём проблема? Вот как бы он, как бы это грустно не было, периодически есть компании, которых заезд в кубер - это целый челлендж. Как бы всё нормально. Ну, нужен. Да, я тебя расстрою. 2025 год, не все куберизовались. Да, Саша тянет руку. Я бы с удовольстм на воркшопе поучаствовал, который бы в плане контейнеров и так далее провёл бы меня через путь про то, какие там Демон, Демонс сейчас в сети есть подманы, Скопио и так далее и тому подобное. То есть разложил бы вот, собственно, в процессе. У меня процентов на 80 просто готовый материал на эту тему есть, поэтому, то есть интерес есть. Я понял. Смотри, тут очень важен сценарий и очень важно понять, что у несёт с собой зритель. То есть тема интересная, но она должна быть практичная. То есть вот она очень практичная. Я сказал, там что-то углубить надо. Ну а то не, ну я к тому, что смотри, вот и вот мы с коллегой делали воршоп про сети. Вот я не знаю, вот как часто ты контейнер руками собираешь? Как часто ты, я не знаю, сеть руками настраиваешь? Ты же знаешь, что меня нельзя это спрашивать, потому что, скорее всего, я это о часто делаю. Да, не тот человек не того спросил. Александр вместо отпуска это делает гир. А ну ключевая ключевая мысль, что у Дора нулевой оверхд, да, мы это прямо типа руками можем увидеть. Кажется, это то, что можно продать и то, за что до сих пор хулеварт зачем-то. В общем, идея классная, по максимуму практичности и будет огонь. Я тебе могу за него сказать takeковей. Вот как бы я забываю на C есть вот есть контейнер D. Контейнер D - это набор интерфейса, а под ним лежит забываю вра есть. Да. А есть альтернатива CRAN, которая на А есть ещё, который который какой-то совсем странный, забываю, который крипи. Ну смотрите, тема продающаяся, тут спору нет, но сценарий практика. Ты не смотри, очень простой. Вот знать про то, что 1% населения Земли нужны очень специфичные контейнеры и нужны, которые очень быстро и умеют замораживаться. И есть контейнеры класс. Ты вот вот начинаешь, да, раскручивать тыквей. Всё правильно. Я же про это Рою. Просто его пронести. Давайте дальше пойдём, да. Вот. У тебя есть вариант выбрать из двух покемонов: Белоцерковский или Боргород. Борга заставит тебя на C++ писать, а я в научпоп превращаю. А ещё я посередине сижу, если че. Да никто не приходит. Всем, всем здравего все боятся. Что вы мой облик? Дальше, коллеги, коллеги, коллеги, давайте дальше. Там у кого микрофончик? Вот там сзади, сзади. Привстаньте, пожалуйста. Да, вижу я. Да. А, а меня зовут Игорь. У меня вот такой вопрос. Вы говорили, что интересен раз C++ го и так далее. Как жет на этом? Вот у меня такая идея доклада по Извини, что перебью. Приходи C#P интересно. У меня у меня не прямо C#P. У меня по анализу там проблем производительности приложений по профилировке и так далее. Анализу дампов. Я тебя жду. Я тебя жду, потому что я считаю, что C#P - это новая Джава, которая должна убить Джаву. Слушай, это так считают даже его создатели. Так что это, ну, нормально. Ну, как бы это популярное мнение, да? Приходи в общем. Приходи. Да. Да. Интересно фактуры и цифры. Да, не все его разделяют, но есть такое мнение. Подожди, то есть ты не любишь всешар? Давай мы потом поговорим. Сейчас началось, да, уже. Да, стандартные баттлы. Смотри, в таких докладах очень важны цифры. Чем их больше, тем, соответственно, он проще продаётся. О'кей. Ну я не просто про C#P, а именно про doтnet, про как анализировать, как решать какие-то проблемы. Вот про такое, да. Да. Огонь огонь. Повай. Потому что я посмотрел в прошлых годах, было очень мало докладов. Ещё будет очень классно, если ты это намажешь на практический кейс, где вы это использовали и вот у вас стреляло вот так-то было, вот так дебажили. Вот это классический доклад, очень хороший с историей. Да, спасибо. Мы все за Я я просто скажу, что Игорь, привет. Игорь, да. рассказывал про C#P, когда это ещё было не модным даже лет 10 плюс назад мы его ещё не было мы гото мы готовили с Игорем доклады Да я не против, пусть подаётся. Ну если великий Якодзуна не против, то Да. Ещё есть кто-то? Да, есть. Так вот. Так, а ещё третья тема, да? Давайте, давай. Ну, у вас написано питчем идеей, поэтому уж извините, да? Идея такая, так как поддерживать, эксплуатировать код, написанный нейросетями. Ойё, мы сдела человеками переписать людьми. Ненене, это давай так, там есть с этим есть проблема, потому что у меня, допустим, в компании Полиси я разрешаю пока только тесты писать, и то не очень сложные, однотипные. Ну вы недолго ещё продержите. А я боюсь, что ещё долго, потому что я вот чуть раньше говорил, написать bitтmap могут два синьора и я, если очень напрягусь. Извини, мы не совсем правильно. Э ты ты предлагаешь тему, да, на которую было бы интересно выступить. И лично для меня тема очень интересная, но вопрос практики, понимаешь? То есть вот эту практику интересно послушать. Вот Александр рассказал свою практику, да? Вот ещё интересно человек прошлорковский. Давай. Да, коллеги, у нас вот это обычно мы рекомендуем намлит, мне кажется. Ну вот такие темы мы рекомендуем налид практически сразу. Ну смотри, подожди, смотри, надо факту. Это же технический доклад, да? Тут как бы надо посмотреть, что подадут с кодом, но можем перекинуть на теле, если в текстеке уже это готово, то да, но я бы о таком не слышал, что кто-то это сделал. То есть на уровне процессов, да, я когда уровень процессов, оно отъезжает уровень процессо, она темлит на какой трек, опять же, там вот эта тема тема, треки и так далее, это фимерно, на это не смотрите. А если на Hello, то какой трек? Нало опять же тоже неважно. Ну у нас, по-моему, есть про этот Генаи как раз-таки. Да, это есть. И туда, кажется, это очень хорошо зараз, ещё раз внимание, неважно, не надо вот это трек не трек. Подаёте доклад и всё. Главное, чтобы было понятно из темы о чём и с описания о чём. А трек мы придумаем. Это даже если вы подались с докладом, который там натемлит по-хорошему, а вы пришли на Хайлот, мы без проблем это перекинем, да, технический момент. Критериит либо хайлот очень простые. Чем больше технин, тем больше это хайлот. Ну я надеюсь, что описание и так понятно, что вы сгенерили какие-то артефакты, их много, они работают, а поддерживать их, смотри, это проблематика, а хочется послушать про решение и про опыт какой-то. Подожди, от проблематики недалеко до опыта. Ну хорошо, спасибо. Вот интересно её послушать. Ну да, вот первый ряд давно ждёт. Давай. Наконец-то дали. Да ну да, наконец-то. На самом деле несколько идей про фейл можно, если не под запись, в том числе рассказать про опыт м как микросервисная система скатилась к релизным циклам в полгода. А вот это серьёзно. Это интересно. Серьёзная заявка, да. Вот. Ну там много под капотом было всего, о чём можно. Ну под запись это можно или нет? Вот это под запись можно. Лучше не под запись. Дададахме тамп. Тогда скорее всего. Ну как бы там критериев не так много, что является онлифмтапом. Я просто к чему я не не к тому, что людей от фейламитапа отговариваю, просто запись она чуть полезнее в том плане, что её можно как-то ну показывать людям в конечном итоге. Так что если вы можете всё-таки на публику это рассказать, это будет очень хороший доклад. Если не называть имён, может быть нормально. Ну, короче, всё упирается в то, насколько надо уровень секретности понижать или повышать. Ну да. Ну, собственно, компания всё равно от нас избавилась в качестве разработчиков с после некоторых событий, поэтому можно, ну, тут на ваше усмотрение, да. Вот. А с другой стороны, можно м показать, как выжить из того же там джанга монолита максимум и ещё и показать, может быть, масштабирование в, ну, по по требовани, ну, как по необходимости. Не, ну там придётся долго изголяться. Я и я тут недавно наконтрибьютил, и я знаю, что осин, который должны были донести, так и не донесли. Его несут ещё. Ну и и придётся сначала доказать это ещё на контрибюте звучало интересно. Ну это что, а что доказать? Вот вот, кстати, Александр прекрасную тему затронул. Вот ээ фичу не не могут всё донести, условно говоря, куда-то, да? А вы берёте и рассказываете, как сделать эту фичу, если её нет. Что делать? Ну, слушай, это правда совершенно другой доклад. По поводу оригинальной идеи. На самом деле такие вещи хорошо заходят. Опять же, с фактурой, с показателями, с цифрами. Там вот вот упомянули асинхронку, да, в суиш называется. Как раз интересно сравнить, а насколько вы можете разогнать синхронку, чтобы она была там на равне, например. А, ну и ещё один м вариант. Я, на самом деле, его даже в каком-то виде, по-моему, пытался отправлять предыдущий. Ну ладно. Есть у нас сейчас на текущем проекте внутренний пока гошный пакет, который мы используем для, ну, скажем так, организации RPC поверх НАТО. И он, скорее всего, всё-таки дойдёт когда-то досорса. Просто этот этот вопрос не форсили, поэтому как-то он вяло там так и лежит. И с одной стороны там было бы интересно, наверное, рассказать, почему он родился вот такой, как он функционирует, что он даёт, какие преимущества. С другой стороны, у меня уже накопилось, что рассказать, что если бы я сейчас к этой задаче подходил, я бы сделал вообще совершенно не так. Не, ну подожди, это что-то очень абстрактное. Это то же самое, как человек из СQ алхимии зачем-то юзает под капотом гри гринт. Ну, короче, файберы нафиг не надо. С одной стороны красиво, с другой стороны, бесполезно. Вот мы говорим здесь не про абстрактные доклады в вакууме, а про предметные доклады в вакууме. Ну, на примере конкретных там даже кусков кода каких-то и бенчмарке. Что? Подожди, я тут подсвечу, что почему вам понадобились RPC, в принципе, например, вот тут вот такую проблематику надо будет объяснить. Просто если мы будем рассказывать про вакууме, что мы решили, что нам нужен RPC на надсе и вот мы настрадались, мотивация. Не, мы не страдали, мы всё замечательно работает. Вот в том-то и поинт, что оно как задумано работает. Мы целенаправленно не пошли в использование GRPC. Аэ, решили использовать для этого брокера и и тебе и оно до сих пор нормально, хорошо работает. Можно я чуть-чуть сейчас вклюсь? Не быстренько, буквально смотри. Прекрасно, но, допустим, если приду я к тебе экспертам, мой вопрос, ну вот я знаю, что в GRPC есть 1 2 3 4 5, а теперь мне цифрами докажи. А если придёт Георгиева давай ты расскажешь, что ты спросил бы? Да нет, ну понятное дело, что спросить про инженерные решения, про сравнение спросим. Ну то есть каждый из нас каж, ну как бы мы будем спрашивать до того степень, пока нам не станет понятно, почему, зачем, как ещё желательно обязательно детективную историю, но это та это скорее мой напрос. Детективная история, почему не хочется GRPC, вытекает в том числе из того проекта, который вот пришёл к полугодовым релизом. Тут просто подс подсвечу, в принципе, к большинству докладов применимо. И когда вы рассказываете историю, вы, в частности, подсвечиваете проблемы возможные. Вы и главное, что вы объясняете на ней проблематику. Это самое дорогое. То есть большинство докладов, минимум треть доклада обычно посвящена боли, чтобы аудитория поняла. То есть, если вы просто рассказываете, что вот смотрите, как можно сделать одно на другом. Э-э, ну вопрос, я его не очень люблю, но он иногда формулируется. А чтобы что? У меня есть странное предложение. Мы так можем беседовать бесконечно. Я предлагаю сделать следующим образом. Мы досчитываем до трёх. Если нет, то мы переходим в то же самое обсуждение, но в курах. Потому что вот мне как бы из зала уже подсказывает наш, так сказать, опытный дирижёр, что кажется, что пора заканчивать. Давайте попробуем. Саш, заканчиваем, но у нас есть вопрос из онлайна последний. Вот его и на нём, наверное, закончим. А на самом деле он странный, но я его зачитаю. Ответ будет, короче, сейчас поймёте. А вопрос от Алексея Сундакова. А если речь про нагруженную систему, которая базируется на общих онсорсных инструментах, а не инфраструктуре Сбера, которая есть только в Сбере? Ну, собственно, большинство докладов, наверное, на нашей конференции базируется на openсоourсных решениях. Как бы ответ, наверное, да, это нам интересно. Это, собственно, про нас и есть как раз скорее доклады про инфраструктуру Сбера - это исключение, нежели правила. Можно я немножечко комментарии внесу? Неважно на какой компонентной базе. Takeaway, возможность перенести ваш knowledge в другие части важнее, чем open source, cloud source или ещё что-то. Ну давай явно здесь уточним. Если вы базируетесь на openourсе, тоway обычно сильно ближе для людей. То есть open source бери, ну как их правильно готовить. А когда вы рассказываете про вашу внутреннюю инфу, там кв уже надо, ну он ищется сложнее. Это обычно именно мотивация, что вот если бы вы там повторили или что-то ещё, вот это вот надо делать вот так вот. Другой формат теве, если кратко. Так что на этом всё, Вика, завершай. Да, давайте переключим на следующий слайд. Там были ещё важные QR-коды, да, вот этот приём докладов до 20 июля. Ещё раз напоминаем вам, что мы рекомендуем подавать их заранее. И можно нам, пожалуйста, предпоследний слайд? Да, хочется тоже показать контакты. Если у вас после этой встречи остались любые вопросы, пишите, звоните. Это мне, получается, да, это мои контакты. А, а по остальным вопросам, собственно, адрес поддержки вы тоже видите на экране. Итак, а на этом моменте мы завершаем трансляцию и прощаемся с нашими зрителями онлайн. Давайте, последний слайд и ну давайте, последний и на этом всё. Всё. Всем спасибо. Официально спасибо. Спасибо. Yeah."
}