{
  "video_id": "oNFNnpxzeH4",
  "channel": "HighLoadChannel",
  "title": "Как лучше разбираться в людях / Сергей Котырев (UMI.CMS)",
  "views": 16764,
  "duration": 3397,
  "published": "2018-01-16T13:44:48-08:00",
  "text": "Да, я IT-предприниматель, а, с двадцатилетним стажем. Вот так получилось, что с самого начала моей карьеры, кстати, здравствуйте. С самого начала моей карьеры мне пришлось управлять людьми. Вот. И как выпускнику технического вуза и айтишнику изначально я вдруг понял, что люди сложно поддаютсяри алгоритмизации, да, и вообще сложно познаются осознанию, пониманию, прогнозированию. Потом я пришёл к мысли, запустите мою презентацию, пожалуйста, а потом я пришёл к мысли, что люди вообще это самое сложное, с чем приходится работать. А потом я пришёл к мысли, что люди вообще, наверное, самое сложное, что есть во Вселенной. Вот мне так кажется сейчас, потому что о поведении, предсказании, поведения спиральных галактик мы, в принципе, знаем больше, чем о предсказании какой-нибудь девушки, моей жены, например, а или моего сотрудника или особенно сотрудницы моего отдела маркетинга, не говоря уже о пиарщицах. Вот. А вот о том, что ближайшая к нам галактика летит и через сколько-то миллиардов лет столкнётся с нашей галактикой, мы уже знаем точно абсолютно. Понимаете, аа вообще, а тут не зря был шаман. Это очень хороший знак и сигнал, потому что вам, айтишникам, рассказывать про психологию, нам, айтишникам, рассказывать про психологию, ну, понимаете, это, на самом деле, булсшет. Многие вообще не поверят. И всё, что я буду рассказывать, на самом деле, это чистой воды шаманства. Вот. Психологию нельзя назвать точную науку. И даже прикладную психологию нельзя назвать точной наукой. Моя задача - это доказать вам, что некоторые модели действительно работают. Вот действительно работают. И мне в моей практики, и в менеджменте, и в моей личной жизни, они очень помогли. Я вам расскажу про то, что у меня хорошо работает. И, соответственно, не буду рассказывать про то, что плохо работает. Вообще, почему психология не является точной наукой? А вот почему. Потому что, представьте себе, есть некий трёхмерный объект, в данном случае цилиндр, да? А любой психолог существует в неком двухмерном мире в рамках своей какой-то модели. Поэтому в рамках представим, что этот трёхмерный объект - это человек, его психика. Но один психолог в рамках одной модели скажет, что он в этом человеке видит круг, окружность, а другой человек скажет, что он видит квадрат. И они будут до хрепаты спорить, потому что они применяют разные методики. а психологического подхода. А вот теперь представим себе, что человек на самом деле не трёхмерный, а энмерный. Можете себе представить, вообразить? Человеческая психика настолько многогранна, что мы можем ещё вот кучу проекций себе вообразить, да, в инном мире, и в каждом мире будет своя фигура отражения. Но чем больше проекции мы соберём, тем больше представлений мы получим о реальной форме этого изначального предмета. Понимаете? И вот эти все психологические школы и теории, которые существуют, это не есть ничто иное, как вот отдельные проекции. И я вам сегодня расскажу о тех проекциях, которые мне помогли. Но для начала хочу сказать, что сначала я, конечно, к психологии, как любой айтишник, относился оченьочень подозрительно и даже с неким пренебрежением. Пока не столкнулся с несколькими теориями, которые на удивление действительно работают, работали и продолжают работать. Вот я про них сегодня и буду рассказывать. Значит, из всего многообразия всяких теорий и школ, вот этих вот, так сказать, отражений, да, реальности, а я выделю пять штук, которые работают у меня. Самая простая - это пять языков любви Гарри Чепмана. Потом, скажем так, некая школа, которую придумал Михаил Соломонович Гринфильд на основании BTI и NLP. Я чуть подробнее расскажу. Потом Process Communication - это новейшая теория, с которой я знакомился и которая тоже весьма годная и рабочая. Она пришла из НАСА, из США. А потом теория Гирта Хавштеда, она изначально про cross cultural differences, но очень хорошо применяется и в анализе личностных свойств человека. Ну и, наконец, психософия Афанасьева - это та, с чего я начал. Это та моя самая любимая, наверное, теория. И, но я о ней сегодня постараюсь, если время позволит, говорить поподробнее. Да. Вот, поднимите руки, пожалуйста, те, кому по долгу службы приходится управлять людьми. О, один задохнул с облегчением. Не приходится. А что вы здесь делаете? Вам это не надо. Это вашим начальником надо здесь быть. Ну что, у нас целевая аудитория. Хорошо. Очень приятно. А скажите, пожалуйста, кому приходило в голову, что люди как-то сложноваты, как бы непонятные, вот туповаты, я не знаю, непредсказуемы, уникальны, разнообразны. Ну, на слава богу, у нас целевая аудитория. Хорошо, поехали. Аа значит, начнём с самой простой книги, которая вообще читается за пару часов. Автор Гэрри Чепман. Пять языков любви. Вообще книга изначально от семейного психолога, который придумал эту тему, чтобы проанализировать причины разводов. Оказывается, что мы, э, свою любовь, причём любовь не только в семейном, да, или даже сказать в сексуальном смысле слова, а любовь к людям вообще, к сотрудникам, например, а, выражаем на пяти разных языках. И у каждого из нас есть какой-то один самый развитый язык. И остальные, на которых, в принципе, мы любовь не воспринимаем и не способны показывать. Вы, наверное, догадываетесь, что, в общем-то, сотрудники должны чувствовать, что вы их любите. Это как бы довольно эффективная для менеджмента штука. А вот существует пять языков. Первое - это служение. Дорогой, не хочешь, я тебе кофе принесу? Самый примитивный процесс служения. Самое сложное - это служить как бы своей семье, своей компании, свои дело, своим командой как бы тем, что не спать ночами, думать о них, искать где деньги на зарплату добыть и так далее. Это, кстати, мой язык любви. Я понимаю любовь только, когда мне служат. И я сам показываю любовь только служа другим людям. Не только людям, идее, миссии, команде, компании и так далее. А второй язык любви, а, прикосновение. Вот я терпеть не могу, когда меня трогают. А моя жена, наоборот, обожает это дело. Поэтому она говорит: \"Ты меня не любишь, потому что ты меня мало поглаживаешь, там ещё чего-то\". Ну мне это не близко, понимаете? Я свой психотип потом скажу. Вот. Но я понимаю, что ей это надо, потому что она на этом языке понимает, что она мне симпатична. Не, сексом всё нормально. Я имею в виду поглаживать просто так не вижу никакого смысла. А есть много людей, которые есть, и, соответственно, потрепать его по плечам, как бы ему приятно, до него дотрагиваются. Третье - это дарить подарки, принимать подарки. Есть люди, которые, грубо говоря, показывают свою любовь только через подарки и понимают, что его любят только, когда ему дарят подарки. Четвёртое - это качественно проведённое с человеком время. У меня был такой пример. А один сотрудник скис, программер хотел увольняться. Мы пошли с ним в кафе и часа три просто говорили. Ни о чём. обо всём. После этого он расцвёл, он понял, что, ну, он вообще не мой прямой подчинённый был, он был подчинённый нашего технического директора, да, но типа директор потратил на него время, он понял, что он мне дорог только за счёт того, что я с ним провёл время своё личное в кафе, потратил на него время. Это тоже очень большой сигнал. Это не мой язык любви. Я это делал немножечко через усилия, но прочитав эту книжку, я понял, какой у него язык любви, да, и, соответственно, сделал, показал на его языке, что он недорог. и он остался работать дальше и работал хорошо. А, и наконец пятое - это слова одобрения и поддержки. Тоже совершенно мне пофиг абсолютно. Я сам с трудом заставляю себя кого-то там поддерживать. Ну что ты профессионал, ты сам разберёшься со своими проблемами, правильно? И мне никакие языки, слова поддержки, одобрения не нужны. Я сам разберусь со своими проблемами. Есть люди, которым это очень важно. Соответственно, почитав эту книжку, мой товарищ Дмитрий Огорунов в своём издательстве Gameland просто на бейджах у каждого сотрудника написал его язык любви. И просто подходишь сразу смотришь, ага, кофе кофейку может принести или это самое вот девушка мимо. Да вот приятно же. Я не уверен, что это ваш язык любви. Нет, я промахнулся. Прочитайте книжку хорошую. Следующее - это MBTI по Гринфильду. Вообще тут я просто сделаю минутку оголтелой рекламы, потому что, ну, он мой учитель, и я у него с огромным удовольствием учился. Михаил Соломонович Гринфильд. Он книги не пишет, он ведёт тренинги по VIP-переговорам. Очень дорогие тренинги, очень долгие, но там чистая магия и шаманства. Я, например, пройдя у него обучение, в одной сделке заработал лишний миллион долларов, просто применив э- методику, которую он меня научил. Поэтому всё его обучение окупилось тысячекратно. Вот. Аа значит он базируется на MBTI классическом Myers Bricks. Да. Но я сам Myes Briкс не очень люблю. Он его трактовал таким образом, да? Плюс ещё он, ну, главный нлпишник в стране, в прошлом, как бы он ещё применяет некую смесь из психотипов MBTI и а Майс BCKS. Ну, в двух словах, например, идём мы на переговоры с каким-то человеком, да, а, топ-менеджером, ну, он обучает только топ-менеджеров, вот то этот топ-менеджер может быть абстрактным, а может быть конкретным. Понимаете разница между абстрактным мыслящим менеджером и конкретно мыслящим? Абстрактно мыслящий менеджер видит общее пространство до горизонта, перспективу на следующие 5 или 10 лет. Он терпеть не может детали. Как только вы начинае А если вы пришли, а вы конкретный, а конкретный, наоборот, перспективу не видит. Он видит деревья, а не лес, но он обожает копаться в деталях, в нюансах и так далее. И вот приходит какой-то конкретный продавец к абстрактному покупателю, да, и начинает его грузить деталями. Тот скисает через 5 минут, говорит: \"Так, иди, иди к моему заму\". Обычно у абстрактных ээ лидеров всегда конкретные замы. Вот. Наоборот, абстрактный продавец приходит ээ к конкретному заказчику и начинает ему рассказывать про космические корабли, бороздящие просторы Большого театра, а тот говорит: \"Не, ну конкретно рассказывай, пожалуйста, что, чего, сколько, когда, почему и так далее\". Ну вот это вот одно из измерений. Таких измерений очень много. И кейсов очень много. А мне это очень помогает и продавать, и нанимать, и управлять. А, хотя я повторяю, что я не являюсь поклонником MBTI, но давайте признаем, MBTI среди всех теорий прикладной психологии самая популярная в мире сейчас. Марс BRКckс. Поэтому изучить всё равно рекомендую, но ещё больше рекомендую учиться у Гринфильда. А если вы скажете ему мою фамилию, он вам даст скидку, поскольку курсы Я ничего с этого не имею, просто я ему очень благодарен, очень много от него узнал и научился, поэтому, поскольку это дорого, скидка имеет значение. Следующее - это теория Гирта Хавстеда. Значит, кто такой Гиртхавд? Это голландский учёный, который занимался вопросами cross cultural differences. То есть почему аа японский менеджмент так сильно отличается от американского, а русский так сильно отличается от немецкого? Опять же, это делалось по заказу трас национальных корпораций, и в итоге он построил очень стройную, красивую теорию, основанную на реальных исследованиях, аа которая за которые, ну, его там Forbс, по-моему, признал одним из самых, а, авторитетных бизнес-учёных в области психологии. Короче, я не имею возможности сейчас вам эту теорию рассказать, но я сделал одно очень большое открытие. Как на уровне наций и национальных особенностей в менеджменте, так и на уровне личностей конкретных внутри компании, эта теория одинаково хорошо работает. Поэтому рекомендую ей ознакомиться сейчас вкратце просто скажу следующее. Есть пять параметров. Power Distance index. Power distance - это значит то, насколько человек или общество, а, склонны признавать неравенство в обществе. Он может быть высоким, как, например, в России, как вы понимаете, да? Он может быть низким, как, например, в Голландии, Швеции или Израиле. Вот. То есть общество построено на неравенстве, либо общество построено на равенстве. То же самое абсолютно касается атмосферы в любой компании. Там либо Power Distance высокий, либо Power Distance низкий. В этом смысле роль менеджмента совершенно разная. Роль менеджмента в низком Powerдистан, да, - это играющий тренер на равных со всеми. Роль менеджера, топ-менеджера в компаниях с высоким паурдистансом - это царёк, которому все лижут. Ну, про Россию вы понимаете, да, как какая у нас традиционность. Но обратите внимание насчёт паурдистан. Аа если в целом в российских компаниях Power Distance высокий, то в российских IT-компаниях Power Distance низкий, мы вообще особенные. Именно поэтому айтишники так легко уезжают в развитые страны, а где как раздис низкий. Дальше, второй параметр - это индивидуализм, ну и, соответственно, противоположность ему коллективизм, да, понимаете? Американцы индивидуалисты, китайцы коллективисты. Третий параметр - это маскулиниity, то есть мужественность и противоположность ему женственность. Американцы какие: мужественные или женственные? Женственные американцы. А как же А как же культ Рэмбо там и так далее и всего вот этого? Как бы нет, где где твои деньги, ты лузер и всё такое прочее. А вот если вы съездите в Таиланд, вы увидите, что это одна из самых женственных, наоборот, культур в мире. Россия какая культура, женственная или мужественная? Чего? Россия мужественная. А как же наш сказки Иваночка дурачок, которого жалко там вот это самое крошечка хаврошечка? Нет. Очень легко понять. Если в стране женщина главная, то значит женственная культура. Вот Таиланд, например, да или в семьях. Если в стране мужчина, даже посмотреть, как выглядят мужчины и женщины в стране, уже понятно, кто здесь главный. Посмотрите, как выглядят немки или англичанки. Посмотрите, как выглядят русские девушки. А дальше uncerty avoidance - это принятие неопределённости. И, наконец, long term orientation. Это долгосрочность или краткосрочность. Ну и чтобы, поскольку времени мало, просто пару слайдов покажу на эту тему. Вот у Хавштеда, соответственно, научное доказательство древней русской поговорки, что русскому хорошо, то немцу смерть. Сравниваем русского с немцем. Power Distance у нас один из самых высоких в мире, да, поэтому нам всегда нужен царь, который всё решает, за всё отвечает. Вот в Германии он, естественно, низкий, а поэтому у них Меркель переизбираемая. Вот индивидуализм, коллективизм. Мы, в принципе, более коллективистская страна, чем индивидуалистская, в отличие от немцев. Маскулиниity, опять же, мы более женственные, чем немцы. Артативойденс, мы гораздо легче принимаем, а, неопределённость. Ну, понятно, немцы всё планируют, всё чётко структурируют, а у нас такая история, да, нас так невозможно. Ты что-нибудь спланируешь, а завтра татары-монголы прибегут. Планируй, не планируй, какая разница? Всё равно прибегут. Вот и, наконец, долгосрочность ориентации. Ну, а вот теперь смотрите, русские с китайцами. Вот сюда обратите внимание. Вот китайцы, грубо говоря, имеют план на следующие 100 лет развития. Наша задача в менеджменте - это сегодня максимум получить, а завтра хоть трава не расти, потому что хрен знает, что будет завтра. Вот ключевое отличие между нами и китайцами. Ну, маскулинити они более мужественные, они ещё больше коллективисты, чем мы. Да, Power Distance там тоже очень высокий там председатель. партии. Ну и, наконец, просто communication - это новейшая теория, которую я изучил на этот вопрос. Я сам ещё в ней продолжаю разбираться, но она мне очень интересной показалась, поэтому я о ней пару слов скажу. Значит, её разработали в семидесятые годы. Автор в Америке, психолог, который её разработал, а, подписал контракт с НАСА. И по этому контракту он подбирал психологическую совместимость у астронавтов, чтобы они наиболее эффективно коммуницировали с наибольшим пониманием и с наименьшими конфликтами. То есть он подбирал астронавта, в том числе по психотипу, а не только по, соответственно, их физическим данным и по их знаниям, да, и специализации. Вот и эта работа очень успешно была проведена, и он, соответственно, выпустил эту свою теорию. Сейчас она популярна только в Америке и во Франции. В России практически о ней никто не знает. Вот мы заказывали французского тренера, соответственно, он проводил тренинг для нас, для нашей группы предпринимателей, в которой я состою, организации предпринимателей. Значит, почему process communication? Потому что это процесс коммуникации. То есть на самом деле эта модель строится про то, чтобы понять, на каком уровне человек наиболее эффективен в коммуникациях с другими людьми. Вот базово выделяется шесть этих уровней. А есть уровень, а они все как бы равны между собой теоретически, да, но у каждого человека они неравны. И чем меньше уровень, тем больше энергии он затрачивает, общаясь на этом уровне, стараясь перейти на более понятный и простой ему. Сейчас тут назад у меня слайды не переключаются. Я всё немножко проведу вперёд, а потом вернёмся назад на один слайд. Вот смотрите, есть самый базовый уровень, например, логик, и на нём у нас 100% энергии. То есть разговаривать на языке логики нам легко и просто. Ну это я про себя говорю, да? Например, следующий уровень у меня, например, упорный. То есть говорить на уровне жизненных принципов, идей тоже мне очень просто. Потом идёт у меня мечтатель, потом идёт, а-э, деятель, потом бунтарий, потом душевный. Вот, грубо говоря, на каждом следующем уровне, если мне приходится общаться с другими людьми, например, душевный, у меня там 5-10% от моей номинальной мощности энергии. Я там теряю кучу энергии, а КПД у меня самый низкий. Потому почему? Потому что я ни хрена не душевный. Вот. А душевный назад терсните. Душевный - это как раз тот уровень, когда человек тёплый, чувствительный, чуткий, эмпатичный и так далее. Вот не моё. Ну вот я, например, логик. Я логично мыслю, я ответственный, а я всё пытаюсь объяснить с точки зрения логики. Дальше, соответственно, вот я упорный. Упорный - это что значит? Это человек со своими жизненными принципами, который не пойдёт на их нарушение. у которого внутри есть какие-то правила игры, которые он сам себе придумал или ему родители внушили или ещё кто-то, и он будет жить по ним. Кто такой деятель? Ну, это типичный предприниматель. Это который созидатель, который постоянно что-то делает, который там договаривается, крутится, вертится. Кто такой мечтатель? Мечтатель - это человек, когда он хочет побыть в одиночестве, сидеть, ничего не делать и размышлять о чём-то, мечтать. Делать он ничего не будет, пока его не пнуть. Но мечтатель хорош тем, что он, мечтая, может рождать самые креативные идеи, которые не приходят в голову даже логикам. А у них такая бурная фантазия и воображение, что они работают прекрасно. Например, у меня вот один менеджер есть, который пишет, когда у меня было рекламное агентство, она была мечтательна, то есть пока не пнёшь, не полетит. Она сидела, зависала, короче говоря, музыку слушала, смотрела в одну точку. Совершенно нормально было абсолютно. Но когда, то есть моя работа была это просто её пинать, заставлять писать коммерческие предложения, креативные концепции для клиентов крупных. И она, когда писала эти креативные концепции, у всех челюсть отписала, настолько они были крутые, фантазийные. Но ей нужно было дать одиночество и её не трогать какое-то время, просто периодически пинать, чтобы она не зависала. Вот это вот классический мечтатель. Душевный, я думаю, тоже встречали во многих компаниях. В IT-компаниях душевных людей, кстати, маловато. Вот. Но, в принципе, всегда есть. Обычно эту функцию берёт на себя женщина, но я знаю несколько предпринимателей, которые в фазе душевной, в базе душевной. А, ну и бунтарь, наконец. Бунтар. Самое главное - это обратить на себя внимание, всех поразить, шокировать, удивить, порисоваться в лучах славы, что-нибудь такое сказануть, да, чтобы все на него посмотрели. Соответственно, батарей тоже можно использовать в работе. А, ну, поехали дальше. Теперь проском довольно дорогой тренинг, но он идёт 2 дня. А, но я вам после того, как вы изучите Афанасьего, рекомендую следующим как раз заняться простоскомом, потому что они очень хорошо друг друга дополняют, поскольку смотрят на человека немножко в разных проекциях с разной точки, но не противоречит. Я пытался найти хоть одно противоречие по всем знакомым мне людям, которые там, и там изучили вопросы тестирования, проходили. Не нашёл. Всё очень хорошо сочетается, но с совершенно разных точек зрения и углов. Ну и, наконец, вот последнее, на чём я хочу остановиться поподробнее- это психософия Афанасьева. В своё время, собственно, с неё и началось моё увлечение прикладной психологией. А и если бы она действительно не сработала в моей жизни, а я бы, конечно, так и забил на эту психологию, потому что всё это фуфло для девочек, как бы, на психке, а серьёзному мужику, как мне, заниматься психологией я считал, как бы не престало. Ну вот представляете себе, прочитал, офигел, вообще работает. Я очень многие вещи узнал не только о других людях, но и о самом себе. Например, почему у меня постоянный конфликт с мамой? Например, почему у меня было непонимание с отцом? Например, почему мои родители развелись? Например, почему я развёлся своей первой женой? А, например, почему я так сильно полюбил свою вторую жену? А, и почему она меня полюбила? А, например, почему мой сын ведёт себя вот иногда довольно странно, как бы с моей точки зрения. Ну и, соответственно, про сотрудников в том числе. Но главное самое, я на самом деле наконец-то понял себя. Потому что у меня с детства было ощущение, что я какой-то странный и не такой, как все, и что-то мне с людьми некомфортно. Ну, я ещё вдобавок интроверт. А я всё время думал, что-то какой-то я не такой. Изучил, понял, кто я такой, понял, что я на самом деле такой. Просто я оказался не совсем подходящей среде для своего психотипа. Значит, Александр Юрьевич Афанасьев, он родился в ой 950 году, умер в 2005. Он изначально занимался соционикой, а потом сказал, как Ленин: \"Нет, мы пойдём другим путём\". Ушёл в библиотеке, несколько лет там просидел и изучал биографии известных людей, выделяя их психотип по новой как бы модели, не похожей на сационику. Ну, чем-то похоже, но не похоже. Я сационику тоже изучал. мне не нравится. Вот. А психософия сработала вообще отлично. Потом, соответственно, последователи соционики раскололись на два лагеря. Те, кто пошли за Афанасьевым и те, кто остались приверженцами старой школы. Но вот я считаю, что Афанасьевская теория, которую он назвал психософией, она, ну, реально крута. Реально крута. Значит, про про что эта теория? А она про то, что каждый из нас имеет разные жизненные ценности. Вообще вот, грубо говоря, психотипирование людей - это понимание его ценностей. Вы очень сильно удивитесь, но ваши ценности не совпадают с ценностями большинства людей, которые вас окружают. А уже исходя из ценностей, мы уже приходим к пониманию того, что как будет человек думать, что для него важно и как он будет принимать решения и как он будет поступать. Но изначально это про ценности. Ну вот я вкратце попробую это вам всё рассказать. Значит, э начнём с того, что человеческая личность состоит из четырёх слагаемых. Это вообще не ахти, какое открытие. Вот больше ничего не придумать. Есть эмоция, логика, физика и воля. Физика - это всё, что касается тела. Но кроме тела - это что ещё? Это жизненная энергия, энергичность, это радостность, это секс, это деньги, это вещи, это побрикушки, это крутые тачки, крутые часы, крутые брюлики на девушках и так далее. Это всё физика. Всё ценности, связанные с материальным миром. Что такое эмоции? Это все ценности, связанные с духовным миром. Это не только наши переживания и эмоции, да, там от истерик до эйфории, да, это ещё и всё, что связано с искусством и вот этом правополушарной деятельностью, да, креативом, искусством, чувственностью и так далее. Что такое логика? Это наш рациональный ум. Если вы правша, да, то это левое полушарие вашего мозга. Это способность абстрактно мыслить. И что такое воля? Это вот самоважение, самооценка, место в общественной иерархии, кто вы, лидер посерединке, да, либо в самом низу и всем подчиняетесь. Аа и способность и желание влиять на других людей, заставляя их поступать так, как хотите вы. Вот есть четыре э составляющих. Теперь фишка состоит в том, что у каждого человека есть все четыре слагаемых. И у вас, и у меня, но мы разные. Разница в том, что у нас они все в разной последовательности находятся. Условно говоря, есть человек, у которого первая физика, вторая логика, третья воля, четвёртая эмоция. Есть другой человек, у которого первая эмоции, вторая воля, третья логика, четвёртая физика. Как легко догадаться, а, четыре факториал, да, 24 всего базовых психотипа. Конечно, многие айтишники с первой логикой, которые здесь присутствуют, скажут, что это всё фуфло. Нельзя всё многообразие людей разделить на 24 типа, и это слишком просто. Ну вот, например, тогда вам прос, там 720 вариантов изучайте. На самом деле можно. И на самом деле я не буду утверждать, что два одинаковых, ой, два человека с одинаковым психотипом будут одинаковыми. Нет, не будут. Не будут, потому что у них разные родители, у них разная судьба. Они выросли в разных городах, у них разное тело, они попали в разные условия, они всё равно будут разные, но ценности у них будут одинаковыми. Понимаете? Вот это очень большое возражение, которое было. Условно говоря, а две верхних функции, первая и вторая, считаются условно сильными, а две нижних функции, третья и четвёртая, считаются условно слабыми. Но я подчёркиваю здесь слово условно, потому что иногда четвёртая функция одного человека гораздо сильнее первой функции другого человека, если измерять, например, измерять интеллект. А и условно слабые наши стороны влияют на нашу судьбу гораздо сильнее зачастую, чем условно сильно. Я об этом чуть поподробнее пытаюсь рассказать и объяснить, а то это, наверное, может быть непонятно. А давайте первая функция. Первая функция - это самое наше главное оружие выживания. Если это первая физика, да, то при любом, грубо говоря, опасности человек либо бьёт в морду, либо убегает. Если это первая логика, то, соответственно, он сразу осмысливает ситуацию и находит вариант решения. Если это первая эмоция, он начинает орать так, что враги сами разбегутся. Ну, к тому же оружие это же не только со врагами, например, это оружие такое же там и в любовных наших задачах, когда у нас есть задача продолжить свой род. Это тоже задача выживания, которая нам дана от природы, да? Соответственно, первая логика будет поражать девушку своим умом. Первая физика будет поражать свою девушку прежде всего своей внешностью, да, и красотой, силой, накачанными мышцами. А первая эмоция будет петь серенады и читать стихи. Первая воля просто возьмёт за руку и скажет: \"Пойдём со мной\". Всё. идём туда. А вы будете смеяться? Я я видел, один мой товарищ так оженился с первой воли. Он просто взял девушку на рифе, короче, за руку, сказал: \"Пойдём\". Через год они поженились. А первая функция, она очень сильная, но у неё есть одно одна проблема. Она избыточна. Она грубая и избыточна. То есть первоэмоциональный человек, например, склонен к истерикам по любому поводу. Первогичный человек откровенный зануда, не способен слышать чужую точку зрения, если она не совпадает с его собственной. А первофизичный человек, ну, он жаден, он склонен. Ну, кстати, вот среди воров, например, большинство первофизичное. Он он также склонен к обжорству и ещё многим другим приятным вещам, которые даёт физика. А первольный человек, он давлеет на всех остальных, ломает вообще об колено, заставляет, чтобы всё было по его и не слушает никакой чужой интерес, кроме себя. То есть грубовато. У нас выключился проект почему-то. Включите его, пожалуйста. Вот что ещё сказать про первую функцию. А её Афанасьев сравнил с кувалдой. Знаете, кувалда - это такой не очень тонкий инструмент, наиболее подходящий для того, чтобы ей стены пробивать. Но это не часовая отвёрточка, да, чтобы починить часы. Вот поэтому первая функция сильная, но грубая. Ну, перейдём ко второй функции без слайдов. А вторая функция, самая идеальная функция в нашем психотипе. А она процессная, она, в отличие от первой функции, умеет слушать других, умеет с ними коммуницировать, и она ровно такая, какая а должна быть в идеале. То есть не слишком много и не слишком мало. Ну, например, самый лучший актёр это будет человек не с первой эмоции, а со второй, потому что вот он, когда надо заплачет, когда надо засмеётся, и период между ними может быть там 2 секунды. Грубо говоря, самые лучшие риторы логик - это человек со второй логикой, а не с первой. Потому что первый он обычно рассуждает так вот я тут самый умный, а вы идиоты и не лечитесь. Поэтому либо слушайте, что я вам говорю, либо идите нафиг. А вторая логика говорит: \"Так, а вот интересно ваше мнение послушать\". Ах, как интересно, понимаете? Давайте обсудим. А вторая воля - это человек, которого как бы трудно сломать, согнуть, но при этом он сам не давлеет на других людей, да. И вторая физика - это самые трудолюбивые, энергичные люди и самые а-э жизнеспособные, можно так сказать. А третья функция, как вы понимаете, а нам в чём-то должно не повести. Ну, то есть все вот эти 24 психотипа, да, и вообще мы все люди, мы имеем свои достоинства, но также имеем свои недостатки. И вот у нас, грубо говоря, есть недостатки. Вернее, не так. Есть то, что мы считаем своими недостатками, то, в чём мы с детства считаем, что мы не очень удались. Мы смотрим на других людей, а, и видим, что вот у них-то круто, а у меня не круто. И начинаем им завидовать или в них влюбляться и так далее, либо в них учиться и прочее. Вот, грубо говоря, у каждого из нас третья функция - это постоянный источник неуверенности в себе. Если у человека третья логика, он не уверен, что он достаточно умён и компетентен. Если у человека третья эмоция, да, он не уверен, что он достаточно раскован, открыт, э он зажат и так далее. Если у человека третья воля, он всё время боится, что его недостаточно уважают и ценят, да, ему подчиняются. Если у человека третья, что там осталось? физика. Он не уверен в своей красоте, мужественности, а также, что он недостаточно богат, он всё время там себя за это гнобит. Девушка там постоянно сомневается, а красива ли я, хотят ли меня мужчины. Мужчины, соответственно, то же самое сомневаются насчёт девушек. А-а и это канализуется в очень разные вещи. А штука вот в чём. А третья функция такая же процессная, как и вторая. Что значит процесс? Это значит, надо постоянно доказывать, что у меня с этим всё в порядке. Первые и четвёртые функции, они результативные. Как бы доказал себе, всё нормально, я умный и нормальный. Второй логику надо постоянно. Так вот, почему я говорил, что тре нижние функции, они условно слабые. На самом деле слабая только четвёртая функция. Третья, она очень сильная, потому что это просто драйвер и движитель нашей жизни. Поскольку у нас это самое больное место, мы его всегда стараемся прикрыть как можно больше. Как футболисты во время стенки, да, самое своё чувствительное место прикрывают. Также мы постоянно ходим, прикрыв фиговым листком нашу третью функцию. Что это значит? Это значит, что она является драйвером нашего развития гораздо большим, чем первые две функции. Привожу простой пример. Значит, кто чаще всего ходит в спортивный зал или занимается какими-то экстремальными видами спортов из мужиков, там мучает себя на всяких триатлонах, биатлонах и ой и прочих марафонах и так далее. Кто кому 35 исполнилось? Нет, треть, третье физичные. Треть физичные. Они больше всего заботятся о своём здоровье, потому что для них это важно. Они очень в нём не уверены. Кто самые красивые, утончённые девушки? Третье физичные. Потому что второй физичена чего? Она уверена в своей красоте. Она знает, что с ней всё в порядке, а третья физичена будет всю жизнь это доказывать. Понимаете? Кто больше всего книг читает? Третья логика, да? Ну и так далее. Вы поймёте, да? У меня есть товарищ с третьей физикой, который, ну, грубо говоря, у него это всё заклинило в потребление. То есть обязательно нужно покупать самую последнюю модель, там семёрки BMW, самый большой дом, чем у всех, потому что у него физика проявляется тем же, что не уверен, что его будут уважать, если он будет не богат. Но физика может очень разнообразно проявляться, так же как и логика, так же, как и воля. Да, кстати, кто самые крутые менеджеры? Третьевольные, да, потому что они тоньше чувствуют людей, чем первольные. Они гибкие, а они неуверены в себе, но они это тщательно скрывают, поэтому очень много работают над собой. И ещё они прекрасные манипуляторы, потому что они понимают людей гораздо лучше, чем остальные. Ну и, наконец, четвёртая функция. У каждого из нас есть и четвёртая функция, но она нам не важна. Есть и есть. То есть, например, спросишь человека какого-то: \"Какая твоя любимая музыка?\" Он говорит: \"Да, разная, разная, я разную музыку люблю\". Какая у него эмоция? Четвёртая. Понятно. Он будет слушать, что дадут. Или какой твой любимый художник? Он подумает, скажет: \"Шишкин\". Если он скажет Ванго Гок, уже есть повод, да, о чём-то там задуматься, что эмоция высокая, да, кстати, а кто самый утончён по поводу третьей функции? Кто самые утончённые музыканты? Третья эмоция. Посмотрите на Тома Йорка из радиохеда, да, например, или на Джожа Харрисона. Вот это это вообще весь британский рок - это рок треть эмоционалов, потому что первая первая эмоция - это, понимаете, это этот самый как его солистн Фредди Меркури. Вот это первая эмоция, да? А Том Йорк - это третья эмоция. Так, у кого музыка тоньше? У кого она изящнее? У кого она круче? Ну, можно мне мне можно сравнивать. У меня первая эмоция. Я считаю, что я лучше всех вас тут разбираюсь в искусстве. Наконец, четвёртая функция. А, а четвёртая функция - это пустячок. То есть мы и пользуемся тоже, когда надо, да? И четвёртая логика есть, и она работает, мозги работают нормально. Четвёртая физика есть, да? Человек с четвёртой физикой, у него же есть тело, правильно? Значит, есть физика и и четвёртая эмоция существует. Но это как бы неважно. Мы не паримся по этому поводу, мы не получаем удовольствие по этому поводу. Мы мы не развиваем эту функцию. Ещё самое интересное, в экстремальных условиях она отключается. То есть у человека в экстремальных условиях четвёртой физики просто отнимутся ноги, он не сможет двинуться с места. Человек четвёртой логики перестанет вообще соображать. А, кстати, вот для воинов очень хорошо иметь четвёртую эмоцию. В экстремальных историях у них отключаются эмоции. Поэтому, если мы говорим там про Александра Македонского или Наполеона, они бросались в гущу событий совершенно без страха. У них отключаются эмоции. То есть это и хорошо, и плохо в зависимости от ситуации. Но нам как бы пофиг. Теперь очень важное замечание. Да, первое очень важное замечание. Значит, первая и четвёртая функция результативные, то есть она отработала и всё, и спасибо. А вторая, третья функция процессная, это значит, мы получаем удовольствие от самого процесса, а не от результата её использования. Это значит, надо постоянно ей пользоваться. Поэтому второфизичный человек не может жить без спорта и третьефизичный человек не может жить вообще совершенно. А первый и четвёртый физичный легко может. Поэтому первого логичного человека, каким бы умным не был, ему совершенно не необходимо общаться с другими умными людьми. Он знает, что он умный. Зачем? представили, да, типового айтишника. Мы потом о нём подробнее поговорим. Вот. А вторологичному человеку он подохнет, если не будет ни с кем разговаривать. Он просто кайфует от звука своего собственного голоса. Понимаете? И, наконец, второе очень важное замечание. А значит, ну не это, это просто про, э, значимость и самооценку. Значит, чтобы вы чтобы мы резюмировали вот что все четыре функции не равны. Значит, первая функция, она для нас важна, и у нас с ней всё в порядке. с нашей самооценки. Вторая функция для нас важна, но меньше важна, и у нас с ней тоже всё в порядке. На самом деле у нас с ней гораздо больше в порядке, чем с первой. А третья функция, нам это очень важно, но у нас не в порядке. Мы чувствуем свою ущербность. И четвёртая функция нам не важна. Ну и, наконец, тут очень важное замечание. Все говорят, что так теперь что, если это первологичный человек, а я четверологичный, то он мне и меня. Нет. Нет. Ни в коем случае. А IQ никаким образом не связано с позицией логики. То есть есть великие люди с очень умные с четвёртой логикой. Есть совершеннейшие идиоты с первой логикой. Вопрос в другом. Вопрос в том, как они сами себя оценивают. Совершеннейший идиот с первой логикой считает себя невероятно умным. Если вы откроете Facebook, да, то я думаю каждый день вам такие люди прилетают в комментариях. А я как бы вот, когда разобрался, я даже перестал париться по поводу, как почему можно быть таким идиотом. Идиот с первой логикой прекрасно сочетается. Вот. А просто вопрос в ценностях. Человек с третьей логикой может быть невероятно умён, но он всё время будет сомневаться в своём уме. У моего папы была третья логика. Я это вообще прекрасно как бы наблюдал. Он постоянно получал высшее образование просто чтобы доказать себе окружающим. Но при этом со связанностью речи у него были определённые проблемы, потому что третья логика очень специфически выражается обычно. То есть положение функции назад ещё чуть-чуть положение функции определяет смысл, цель, ценность и самооценку, а также модель поведения и принятия решения, а не определяют качество этой функции. То есть, например, человек с первой физикой, он считает себя красивым по определению, красивым, сексуальным, привлекательным, да? А при этом он может быть не очень красивым. На самом деле человек с третьей физикой может быть невероятно красив, но будет постоянно в этом сомневаться, париться и делать. А человеку с четвёртой физикой пофигу, как он выглядит вообще абсолютно. У него есть другие ценности в жизни, помимо того, как он выглядит. Ну вот, чтобы это всё закрепить, как бы Афанасьев дал очень хорошее определение каждому типу а функции. Вот, например, возьмём романтика. Первая ой, возьмём эмоцию. Первая эмоция - это романтики. Очень легко запомнить. Вторая эмоция - это актёры. Если третья эмоция - это сухарь. Что значит сухарь? У него лицо вот такое каменное у него, а, ну, Томйорк, посмотрите на него, да? А очень много знакомых, которые очень тонко разбираются в музыкой. очень чувственные, чувствительные, но при этом лицо у них каменное, они наружу эти эмоции не показывают. Сухари - это третья эмоция. И, наконец, четвёртая эмоция - это зивака. Вот что дадут послушать, то и будет слушать. А можно и вообще ничего не слушать. Дальше логика. Первая логика - это догматик. Поскольку мы айтишники, об этом я хочу сказать поподробнее. Вы понимаете, что такое догма? У неоспоримая, устоявшаяся картина мира. Да, и если всё не вписывается в эту картину мира, то это вы, идиоты, а не я. А я всё знаю, у меня всё уже в голове построено. Вот, грубо говоря, первая логика- типичный догматик. Вторая логика - ретор. А давайте обсудим, а давайте обменяемся мнениями. Третья логика: скептик. Ну, я не знаю, правильно это или нет, мне надо подумать и так далее. У меня товарищ третьей логичный, грубо говоря. Вот он на любой вопрос, он говорит: \"Мне надо подумать\", потому что он не уве он боится, что если он сразу ответит, я подумаю, что он вдруг он глупо ответит, да, я подумаю, что он глупый. Это очень страшно. И наконец четвёртое - это школяр. Ну, как бы чему научили, то я и знаю. Дальше. Первая физика, собственник. Задача грести всё себе: деньги, материальные блага, там, не знаю, власть, всё, что угодно, землю. Вторая- труженик. Огромное количество энергии, которое не израсходовано. Кстати, вторую функцию Афанасьев сравнил. Помните, мы говорили, первую функцию он сравнил с кувалдой. Вторая функция - это река. Знаете, как Волга бесконечно долго течёт, и ты всегда знаешь, что в ней вода не кончится. Вот также наша вторая функция это как хорошее здоровье. Мы его вообще не замечаем, потому что считаем, что оно неисчерпаемо, пока, собственно, не случится какой-то проблемы. Вот вторая функция - это хорошее здоровье, а у физика вторая - это в прямом смысле хорошее здоровье. Это самые здоровые долгожительные долгожители и так далее. Третья функция недотрога. Но это больше и про девочек, конечно, но и про мальчиков, в общем-то, тоже не дотрога. Очень незбирательные, очень тонкие, очень чувствительные на уровне физики. И четвёртая функция физика - это лентяги. Ну вот, чтобы встать с дивана, надо, чтобы вышестоящие функции очень сильно как бы тебя об этом попросили, иначе нет никакого смысла вставать с диваном, потому что на диване хорошо, понимаете? Ну и, наконец, по воле. Первая функция - это царь. Я царь. Всё, точка. Здесь я решаю, что вы будете делать и как вам думать. Вторая функция дворянин. То есть как бы он принимает и царя над над собой, но и сам умеет повелевать. Третья функция - это мещанин. В чём проблема мещанина? Проблема мещанина в том, что он хочет стать дворянином, как минимум, а ещё лучше царём. И он постоянно парится по этому поводу, как парится любая третья функция. Поэтому он всем доказывает, что он не мещанин, что он на самом деле родом-то повыше будет. Иногда четвёртая воля - это крепостной. Решайте всё за меня, пожалуйста. Я не хочу ничего решать. Я девочка, я хочу платится или я мальчик, я хочу новую машинку там, я не знаю. Вот. Делайте всё за меня. Это четвёртая воля. А как вы думаете, какое подавляющее население России как бы имеет волю всех, кто на самом деле это неравномерно всё распределяется в обществе? Потому что как-то всё вот так, что крепостных гораздо больше, чем царей, да. Но поскольку всё передаётся генетически от родителей к детям, то аа за время советского режима как бы всех людей с высокой волей, в общем-то, планомерно уничтожали на физическом уровне. Поэтому в основном власть у нас третьевольная, а население в основном четверовольное. Но встречаются, конечно, потомки выживших. Ну, давайте потренируемся. Определите психотип этого персонажа. Так, первое логика. Второе, эмоции. Ну, давайте рассуждать. У нас есть две гипотезы. Вторая эмоция говорит нам о том, что он очень хороший актёр. Он хороший актёр, что он очень Вторая эмоция говорит нам о том, что он очень хорошо чувствует других людей, обладает огромной эмпатией, и он этим свойствен. Ну какая вторая эмоция? О чём вы говорите? Но у него как есть какие-то проблемы с самоважением? Скажите так что у него второе? Воля, конечно. Теперь третий вопрос. Какая у него болячка? Физика, конечно. Ты сел на моё место, ты не помыл руки, где мои гигиенические салфетки? Это всё третья физика, понимаете? Да. И, наконец, что у нас остаётся? Совершенно верно, с эмоциями в него всё очень туго, так же как и с художественным вкусом и так далее. Ну давайте, а времени, наверное, не остаётся, поэтому больше тренироваться не будем. Ну давайте вот, давайте, наверное, да, говарда ещё. Физика. Первая физика у Говарда. Ладно, это вам домашнее задание. Определите Говарда и Бернадета и определите, почему Говард в такой позе перед Бернадет. Какая функция первая у Бернадет? Вы начали понимать, да? А теперь подумайте, какая третья функция у говарда? Третьевольный только подчинится первольному. Он его его к нему тянет, понимаете? Потому что он видит. Помните, как Бернадет топает ножкой, да? Это как раз первая воля. Как узнать психотип? Понаблюдайте за реакцией человека. Конечно, не обязательно вводить его в стрессовую ситуацию, но в стрессовой ситуации человек реагирует ровно по последовательности функций. Поскольку взрослые люди умеют сдерживать себя, да, то не обязательно первофизичный мужик на любую стрессовую реакцию начнёт сразу бить лицо. Возможно, нет, но если выпьет, начнёт, конечно, потому что у него откажут тормоза. А вот если посмотреть на ребёнка какого-нибудь пятилетнего, да, отнять у него игрушку, он будет работать. Реакция точно по первой функции, например, он сразу начнёт орать и плакать. Первая эмоция. Потом он топнет ногой и скажет: \"А я сказал: \"Отдай\". Если первая функция не сработала, включается вторая. сказал: \"Отдай воля\". Тогда он начнёт объяснять: \"Ты понимаешь, ты не имеешь права мне отнимать эту игрушку, потому что она принадлежит мне. Логика включилась, да?\" Ну и, наконец, потом полезет драться её отнимать физически. Значит, четвёртая физика. Или не полезет, потому что четвёртая функция может отключиться вообще. А, ладно, определите мой психотип для разнообразия. Я тут уже столько перед вами раскрылся, что уже достаточно. Логика. Первая логика эмоции. Так, первая логика или эмоция? Смотрите. Обращайте внимание на нюансы. Жестикуляция, мимика, голос, тембор голоса, эмоциональность голоса, эмоция, логика вторая. Эмоция первая, логика вторая. Правильно. Дальше. Третья физика. Посмотрите на меня. Четвёртая физика. Физика. Четвёртая. Вы давно видели моё селфи из спортзала? Скажите мне, пожалуйста. Третья воля, четвёртая физика. Да, совершенно верно. Аа, ну, если что, есть тест Афанасьева на сайте, поэтому можно будет посмотреть. Ну и у нас остаётся ещё 10 минут. Остаётся немножко слайдов, мы успеваем, значит. А, да, ещё останется, да, в 11:00 не может быть следующий докладчик, потому что у меня час, а начал я в 10:10. Извините, довольно трудно спориться. второй логикой. Понимаете? А вопрос такой: могу ли я изменить свой психотип? Я определил свой психотип. Кстати, определили свои психотипы уже, да? И мне он не нравится. Я хочу другой психотип, как у Сива Джобса, или хочу психотип, как у Наполеона. А могу ли я его изменить? Нервный срыв и дур нервный срыв и дурк. Совершенно верно. Ответ: Нет, не могу. Мы с ним родились как с телом. Да, мы с ним, собственно, всю жизнь и проживём. Другой вопрос: могу ли я гармонизовать свой психотип? Ответ: Да, могу гармонизировать. Гармонизовать, конечно, было неизячное слово. Гармонизировать. Могу ли я свой психотип? Могу. Что такое гармонизация психотипа? Во-первых, это умерить свою чрезмерную первую функцию. То есть для для меня для первой эмоции это было научиться не орать по любому поводу, как только ко мне кто-то пришёл со своими косяками, да, на работе. Сколько времени? Несколько лет. Вот теперь жену воспитываю, у неё тоже первая эмоция. То есть, понимаете, если бы две первых эмоции не воспитывали друг друга, как бы какой бы ор стоял в доме, а потом, значит, развивать свою третью функцию. Со второй всё нормально, её трогать не надо. Развивать свою третью функцию, кто как это делает, я уже рассказал, да? И, наконец, обратить внимание, что у тебя есть четвёртая функция, особенно если это физика, потому что, если не обращать на неё внимания, то можно, в общем-то, довольно запустить своё здоровье и так далее. А, и люди очень часто так и поступают. Сам Афанасьев был четверофизичный и, в общем-то, скажем так, по этой причине умер довольно рано. А что мне перестал кликер? Вот, соответственно, как база взаимодействовать. Значит, первая эмоция - это, ну, первая функция - это кувалда- это трактор, да? Если у человека плохое настроение с первой эмоцией, как бы не пытайтесь его изменить, пытайтесь под него подстроиться. Она же она же не это самое не процессная, она же результативная. Поэтому человеку пофиг, если у него плохое настроение. Какое хорошее настроение у вас? Первая логика. Не пытайтесь спорить, потому что спорить с первой логикой довольно бесполезно. Он весь догматик. У него в голове уже сложившаяся картина мира догмы. Надо вложить в него какую-то свою мысль и дальше отойти и дать время, когда она созреет. Потом он скажет, что это он сам придумал. Это нормальная работа с первой логикой. Пытаться его в чём-то переубедить с помощью дискуссии бесполезно. Надо просто заложить информацию и отойти и подождать. Потом он скажет: \"А я тут, кстати, я тут вот подумал\". И вот первая физика: дарите подарки, никакой агрессии, да? Делать комплименты, а первая воля: не пытайтесь передавить первую волю. Ну, это абсолютно бесполезно, как бы это против человека с кувалдой. Ну и, наконец-то, наши самые слабые стороны, их важно щадить. Хотя, если вы хотите кого-то ударить побольнее, конечно, надо бить тоже по третьей функции, безусловно. Но вот третье эмоции, да, соответственно, очень боится истерик вообще эмоциональных взрывов, чтобы на них орали, они всё сразу как бы каменеют, разворачиваются и уходят и больше не возвращаются. Третья логика, как бы они очень любят, чтобы все подчёркивали, какие они умные и компетентные. А третья воля очень любят проявление уважения к ним, их значимость, их уважение, что их ценят и так далее. И третья физика, ну, это либо подарки, либо комплименты. То есть ты красиво выглядишь, ты такой спортивный, у тебя такая клёвая тачка, это всё для третьей физики прекрасно. Ну и, соответственно, как не обидеть человека, да? А удары по второй и четвёртой функции абсолютно человеку безразличны. Вот, например, скажите мне, что я глупый, а я всё равно не поверю. Мне даже не обидно, понимаете? А вот приявите ко мне какое-то неуважение, я запомню это на всю жизнь, потому что у меня вторая логика, третья воля. Да, совершенно наоборот. По самый больный удар - это, конечно, по третьей функции, но, в принципе, по первой функции тоже можно ударить, хотя это не так больно, потому что, ну, вот скажите мне, что я не разбираюсь в искусстве. Ха-ха-ха. Вот. Но на самом деле я всё равно подумаю, может, я ещё недостаточно хорошо как бы в нём разбираюсь, но для меня это просто очень важно. Россияне, как мы говорим, низкая воля у россиян в целом, низкая логика, высокая физика и эмоции. Женщины более волевые, поскольку, помните хавштеда, да, у нас женственная нация, а не мужественная. Поэтому у женщин более высокая воль в целом по стране, чем у мужчин. Поэтому кто главный в семье в любой муж российской жена. А, но айтишники не такие, как россияне. У айтишников, у айтишников немножко другая тема. А они, значит, почти все второвольные, за редким исключением и первологичные, а физика и эмоции у них низкие, поэтому это не так важно. И в принципе я за долгие годы типирования всех своих айтишников и окружающих из своей компании как бы выделил, что 80% в зале относится к двум психотипам. Это логика, воли, эмоция, физика, либо воле, логика, воли, физика, эмоция. То есть это Эйнштейн либо Лаудзы. Вот 80% всех этих норей в IT-компаниях будут соответствует этому психотипу. Поэтому у меня вообще вопросы менеджмента - это в основном вопросы работы моего психотипа с этими двумя психотипами. Их друг от друга тоже отличить очень легко. А Эйнштейн одевается как бомж, да? А Лаудзы одевается изысканно, как бы. А в остальном они вообще ведут себя очень похожи. Ну, говорю, Ийнштейн, Эйнштейны просто реже моются, чем чем лаудзы, потому что третья физика, они ещё аккуратисты, у них там бороды стригут как-то барбершопах и так далее. Вот. А по менеджерам, значит, если это прок, конечно, идеально брать высоковольного, даже первольного. Если это аккаунт, лучше всего брать третьевольного, потому что акаунту надо договариваться с клиентами. Клиенты самодуры, а третьевольщики самые лучшие манипуляторы. они под всех подстроятся и своего добьётся. Лучше всего брать людей на работу со второй и третьей физикой, потому что она процессионная. Это означает, что эти люди не ленивы. Первая и четвёртая физика, особенно четвёртый, гораздо более ленивы. А четвёрто четверовольных менеджеров брать на работу не стоит, потому что они легко манипулируемые и очень не любят принимать решения сами. Они крепостные, они ждут, когда кто-то примет за них решение. Но у меня работают четверовольные люди, с ними просто надо, их надо уметь готовить. А периодически, если приучать, ну, естественно, любое важное решение, они тут же звонят и говорят: \"А что мне делать?\" Я говорю: \"А что ты сам не решишь?\" Ну и начинается. Поэтому, если хотите какую-то ответственности и самостоятельности, ни в коем случае не четвёртая воля. Базово всё. Вопросы? Спасибо. писание. Давайте"
}