{
  "video_id": "p3692PKRkZw",
  "channel": "HighLoadChannel",
  "title": "Конец прокрастинации / Петр Людвиг (GrowJOB)",
  "views": 45106,
  "duration": 5608,
  "published": "2017-06-28T07:09:43-07:00",
  "text": "Всем добрый вечер. Раз, раз. Отлично. Большая честь для меня быть здесь, чтобы помочь вам найти решение вашей прокрастинации. Для начала я хочу, чтобы подняли руки вверх те, кто прокрастинирует. Значит, мы здесь собрались с хорошей причиной. Каждый раз, когда я пытаюсь объяснить прокрастинацию, я стараюсь использовать максимально простое объяснение в виде этого изображения. У вас есть ряд определённых задач и есть выделенное время на эти задачи. И прокостернаторы решают всё это скомпоновать вот в таком формате. Все задачи оставляем на самый последний момент. Кто из вас оставляет всё на последний момент? Это прокрастинация. И прокрастинация всегда заставляет нас чувствовать себя хуже, влияет на нашу продуктивность, наш уровень счастья. И есть одно исследование, которое доказывает, что жизнь прокрастинатора короче, чем жизнь человека, который делает всё вовремя, потому что они прокрастинируют даже визиты к врачам. Ещё один пример прокрастинации. Допустим, у вас есть задача, которую нужно выполнить. Есть вещи, которые вам нравятся делать, которые вы хотите делать, и то, что вы делаете на самом деле. И вы знаете, что есть определённые задачи, которые изменят мир в лучшую сторону, помогут вам стать лучше как индивидуум. Но на самом деле вы смотрите очередной эпизод Игры престолов, поливаете растения в офисе или откладываете, например, будильник. А как много из вас просыпаются не с первого будильника? Это один из форматов прокрастинации тоже. Итак, меня зовут Пётр Людвик, и я написал книгу о том, как бороться с прокрастинацией. Я работаю над исследованием прокрастинации всю свою жизнь. Но последние 10 лет я ищу методы борьбы с ней. А моя книга стала бестселлером в четырёх странах и уже написана на семи разных языках и используется большим спросом. И это доказывает о том, что прокрастинация - это очень актуальный топик для всех нас. Потому что мир, в котором мы живём, очень сложен. Есть огромный у нас мы каждый день предстоим перед огромным количеством выбора. У нас есть социальные сети, а, и много отвлекающих моментов, и поэтому уровень прокрастинации сильно растёт. Поэтому навык контроля собственной прокрастинации наиболее важен для того, чтобы достичь успеха в вашей личной жизни. Сегодня я вам расскажу про три простых инструмента, которые вам помогут в этом. И как только вы внедрите эти простые инструменты в свою жизнь, вы сразу заметите разницу. Вы будете более продуктивны, вы будете чувствовать себя счастливее и более больше энергии. И давайте начнём с того, чтобы не откладывать борьбу с прокрастинацией. Альберт Эйнштейн однажды сказал: \"Если вы не можете объяснить это просто, значит вы сами не понимаете этого до конца. И мне очень нравится эта цитата от Эйнштейна, потому что если вы правда хотите что-то понять, ответ на ваш вопрос лежит в простоте. Ответ наиболее прост. Именно поэтому я использую изображение как и в своей книге, так и в своей презентации в большинстве случаев. А как вы думаете, когда в истории человечества началась прокрастинация? Прокрастинация началась больше, намного давнее, чем несколько тысяч лет назад. Один философ Сенека однажды сказал: \"Пока мы отгладываем жизнь, она проходит\". А, и в этом простом предложении объясняется, почему прокрастинация не есть хорошо. Потому что когда мы прокрастинируем, мы тратим своё время. И с моей точки зрения время - это самый ценный ресурс в нашей жизни. Его невозможно занять, его невозможно сохранить, его невозможно увеличить. Каждую минуту, которую мы тратим на прокрастинацию, потрачена навсегда. Как я и раньше сказал, мы живём в очень уникальное время. И у меня есть несколько графиков, которые я хотел бы вам показать. На этом графике вы можете увидеть среднюю продолжительность жизни за последние 10.000 лет. Вы вы можете увидеть, что за последние 10.000 лет. Средняя продолжительность жизни была 25 лет. Но вы можете увидеть, что за последнюю сотню лет средний продолжитель жизни увеличилсь в два раза. И причина этого роста заключается в том, что смертность среди детей уменьшилась. Также найдены вакцины против наиболее смертельных и сильных вирусов. А это очень интересный график, который показывает, каковы шансы того, что вы будете убиты. И вы видите, что наше время самое мирное время. В данный момент на Земле меньше войн, чем когда-либо. И шанс того, что вы будете убиты, минимальный. Если бы вы жили 100, 200, 300 или даже 400 лет назад, шансы того, что вас убьют, были в 10 раз выше. Если, например, взять развитие науки и технологии, то они растут в геометрической прогрессии. А в данный момент мой телефон мощнее, чем самый крутой компьютер 20 лет назад. Давайте взглянем на то, как технология изменялась за последние 100 лет. В 1903 году мы совершили свой первый полёт. И всего лишь 60 лет спустя мы приземлились на Луну. И всего лишь несколько назад, несколько лет назад мы отправили свой первый морсоход на Марс. И Илон Маск говорит о том, что через 5-10 лет он хочет отправить туда живых людей. И исследование показывает, что за последние 100 лет уровень успеха в развитии технологий превышает, чем всё, чего мы добились за всю свою историю. Нам очень повезло. Считаете ли вы, что в наше время люди счастливы, чем 100 лет назад? И кто считает, что наоборот? А кто считает, что одинаковый уровень части? Исследование показывает, что на самом деле люди всё менее и менее счастливы. И а и на это есть свои причины. Одна из них - это сложность нашего мира. И как я говорил, как я говорил, сложность это один из самых главных врагов прокрастинации из-за того, что вы можете наблюдать на этом. Это самое ужасное изображение моей презентации. А название этого изображения паралич выбора. Чем больше у нас выбора, тем сложнее выбрать. И мы переживаем такого рода паралич в нашей повседневной жизни. Как начать свой имеil, как начать работать, на какую работу пойти, с какой девушкой познакомиться и прочее. Поэтому, если найти решение на эту проблему, то можно избавиться от прокрастинации. В чём ключ борьбы с прокрастинацией? А я нашёл одну фразу, которая описывает себе ключ к победе на прокрастинацией. И эта фраза является японской пословицей, которая звучит следующее: замысел без действия грёзы, действие без замысла - кошмарный сон. И эти два простых предложения, эти две простых строчки описывают самые главные проблемы, с которыми мы сталкиваемся в современном мире. Есть люди, которые хотят начать всё: новую жизнь, начать бегать, своё собственное дело. но не начинают. И есть люди, которые делают очень много, но не видят за этим смысла. Я занимаюсь психологией, и в одном из наших исследований мы поняли, что причина депрессии у людей - это отсутствие смысла. Мы называем это корпоративной депрессией. И вы можете увидеть, как выглядит формула счастья. Это два основных ингредиента: иметь своё собственное видение и найти в себе достаточное количество сил, чтобы совершить действие на пути к своему видению. Сегодня очень много исследований хороших про счастье. И большинство этих исследований показывает, что ключ к счастью не лежит через материальные вещи. Ключ счастья заключается в том, чтобы жить каждый день на полную и наполнять свой день смыслом и двигаться на пути к своему видению. are vision. И сейчас мы углубимся в описание обоих ингредиентов видение и действия. Начнём с видения. Как сформулировать своё личное видение? Если вы решите сформулировать своё собственное видение, для начала вам нужно понять ценность вашего времени, потому что у всех нас есть одна общая вещь. Мы рождены в один момент, и мы все умираем. resource. И время между этими и промежуток между двумя этими точками - это наша жизнь, наше время, котором мы вольно распоряжаться. И один из самых важных вопросов в нашей жизни, как распорядиться этим временем. Либо в личной жизни, либо в собственном деле. И если вы сможете сформулировать своё личное видение, тогда вы будете более мотивированы, у вас будут более адекватные отношения, вы будете более здоровыми. И продолжительность вашей жизни увеличится на 5 тире10 лет. И поэтому поиск смысла собственной жизни - это самый сильный мотиватор. Есть одно исследование, которое задаёт один вопрос пожилым людям. их проинтервьюировали и задали им несколько вопросов: \"О чём вы сожалеете в своей жизни? Что было для какие уроки вы извлекли из своей жизни?\" И у них у всех есть одна общая вещь. People do not what they did but what they didn't. А их люди в своей жизни не жалеют, что они сделали, но жалеют о том, чего не сделали. Поэтому очень важно найти свой смысл жизни и двигаться на пути к нему. А, и даже если на пути к личному видению у вас, аэ, у вас будут какие-то провалы, неудачи, вы всё равно будете чувствовать себя лучше. Иногда в жизни приходится пережить очень сильные моменты, которые кардинально меняют наш взгляд на жизнь. Например, если вам отключат питьевую воду, ограничит доступ к питьевой воде хотя бы на неделю, через неделю у вас будет совсем по-другому оцениваться питьевая вода. И иногда мы меняем свой взгляд на жизнь и на ценность собственной жизни, если мы, например, сильно заболеваем или у нас очень много проблем. И у меня была такая ситуация. 12 лет назад у меня были сильные проблемы со здоровьем, и я думал, что я умру. Я играл в баскетбол. И во время матча у меня началась трястись правая рука. И через несколько часов правая часть моего тела была полностью парализована. Ни один из врачей не мог определить диагноз. И статистика показывает, что люди в схожей ситуации какая-то часть умирает, а какая-то выживает. И мне очень повезло, я выжил и без всяких последствий. Но я пережил момент, будучи при смерти. И это очень сильно изменило мою жизнь, изменило мой взгляд на ценности. и помогло мне делать, принимать важные решения. Я начал своё собственное дело. Я сменил свою сферу деятельности, потому что я закончил магистратуру по IT в сфере IT. И потом я решил написать об этом книгу. как начать ценить своё время и как тратить меньше времени на бессмысленные вещи, потому что прокрастинация - это полная противоположность полной жизни. И поэтому самое важное, что я вам хочу сказать, никогда не забывайте про ценность времени. Второе - это найдить найти мотивацию. Есть сотни исследований, изучающих прокрастинацию и мотивацию. И большинство из этих исследований показывает, что метод кнутая пряника, то есть внешняя мотивация, не работает. Почему не работает? Потому что очень кратковременный эффект. И люди не чувствуют себя счастливыми и откнуто. Потому что, если вам нужно что-то сделать, но вы при этом этого не хотите, вы не будете счастливы. И уровень допамина - это гормон счастья в голове падает. Падает. levely creative и падение уровня допамина в в мозгу влияет не только на уровень вашего счастья, но также влияет на вашу креативность, на вашу продуктивность, на коммуникабельность и в целом производительность вашего мозга падает. И внешняя мотивация, в принципе, работала в своё время, например, когда существовало рабство. Внешняя мотивация работает, когда в основном преобладает физический труд. Но я считаю, что большинство из нас требуется наш интеллект для того, чтобы завершать задачи. Поэтому вам нужно найти механизм, позволяющий превратить внешнюю мотивацию во внутреннюю. Я раньше считал, что в жизни два самых ключевых момента. Первый - это наше рождение. И второй, когда мы осознаём полную ответственность за личную жизнь, и большинство из нас не достигают второго этапа. И поэтому смысл нашей жизни - это найти, сформулировать личное видение и двигаться к нему, потому что на пути к личному видению мы будем счастливы. В психологии есть термин для этого, состояние потока, когда мы настолько сфокусированы на на каком-либо деле, что мы не думаем о никаких внешних элементах. То есть для нас время останавливается, мы в потоке, мы сконцентрированы, мы получаем удовольствие от действия. И состояние потока это является полностью полной противоположностью прокрастинации, потому что в состоянии потока вы максимально продуктивны, вы эффективны, вы используете свою креативность и вы счастливы. Есть одно исследование, которая берёт под изучение лучших людей в своей сфере. То есть это лучшие спортсмены, лучшие доктора, лучшие бизнесмены, лучшие писатели, художники. И у них у всех есть один общее, одно общее состояние потока. А как найти и как улучшить личное состояние потока? Как найти счастье, живя в каждом моменте? Вам нужно изменить одну модель в своей голове. Обычно люди думают, что работает это так. Сначала результаты, которые приводят нас к удовлетворению, но исследование показывает, что это совсем наоборот. Если мы счастливы от того, что мы делаем, то только тогда мы достигаем результатов. is not happiness. Есть одна цитата, которая описывает это исследование, и звучит она таким образом: успех не является ключом к удовлетворённости. Удовлетворённость есть ключ к успеху. Если вы любите то, что делаете, то тогда вы будете успешны. И есть три основных компонента для того, чтобы достичь состояния потока: смысл, профессионализм и внутренняя мотивация. И я хочу осветить все эти три ингредиента. Начну со смысла. А на фото изображён ср Николас Винтон, и он во время Второй мировой войны спас 640 еврейских детей от нацистов. Во время войны он организовывал поезда в Англию, на которые сажал этих детей и отправлял в безопасность. И он умер в возрасте 106 лет. И он символизирует то, что мы называем эго 2.0. Что такое эго 2.0? I'm going to explain two egos. First, ego 1.0. А я расскажу вам оба концепта. 1.0 и эго 2.0. Сначала эго 1. Это всё, что мы делаем для себя. Всё, когда мы концентрируемся на себе самих. Но мы никогда не эгоистичны. Иногда мы Иногда мы делаем что-то для других, например, как срвинтон. Окей, мы называем этого 20 в стиле матери Терезы. Есть одно исследование, которое показывает, что часть вот эта часть мозга физически работает и увеличивается, когда мы делаем действия, связанные с эго 20.0 Люди, которые эгоистичны на протяжении своей жизни, живут худшей хуже жизнью, потому что а средняя продолжительность жизни укорачивается, у них проблемы в личной жизни. Но люди, которые живут в концепте 20, то есть отдают в этот мир, они живут дольше, а они более счастливы и их жизнь более успешна. Есть одно японское слово, которое я хотел, про которое я хотел бы вам рассказать. называется. И что естькигай? В Японии есть несколько регионов, в который средняя продолжительность жизни является 100 лет, и это на 50 тире 20 лет больше, чем живём мы. И как вы думаете, в чём секрет их долговечности? И они сделали исследование, которое дало ответ. И ответ заключается в Икигае. Как вы думаете, что это? Игай состоит из четырёх ингредиентов. И первый из них - это то, в чём вы сильны. А второй элемент - это то, что вам нравится, от чего вы получаете удовольствие. Третий элемент - это элемент эго 2.0, когда вы отдаёте в мир, когда вы делаете то, что нужно людям. И последний элемент - это деньги, то, что что позволяет вам зарабатывать столько, чтобы вы об этом не думали. И всё это вместе превращается в икигай. И если вы найдёте своё икига в своей жизни, то вы будете жить на 20-50 лет дольше. Вы будете счастливы, и вы сможете найти внутреннюю мотивацию. И первый инструмент, который я вам хотел рассказать - это написать и сформулировать личное видение. Например, в следующее воскресенье возьмите ручку, возьмите листок бумаги и попробуйте сформулировать своё личное видение. Выпишите свои ценности. Попробуйте ответить на вопрос: в чём вы сильны? И подумайте, в чём вы, чем вы можете быть полезны социуму, как вы можете отдавать этому миру. Если вы сможете это написать и потом регулярно на это смотреть, то вы сможете найти в себе мотивацию, потому что вы будете видеть смысл ваших действий. В книге у меня есть несколько инструментов, которые позволят вам наиболее просто сформулировать своё личное видение. Но очень важный момент, не нужно прокрастинировать написание личного видения. Однажды один клиент ко мне пришёл и сказал: \"Вот тебе деньги, напиши моё личное видение\". И я ему ответил: \"Я не могу этого сделать. Это единственная вещь, которую ты должен сделать лично сам\". Выделите на это некоторое время в один из выходных дней. И не волнуйтесь, это этот документ не должен выглядеть идеальным. Можно начать с бетаверсии, написать несколько предложений, но нужно начать. И это была первая глава важная под названием видение, которое включает в себя самомотивация, икигай, состояние потока и инструмент написания личного видения. Теперь действие, как быть более продуктивным, как распоряжаться личным временем, как расставлять приоритеты. И всё это умещается в одно слово под названием саморегуляция. навык давать себе задания, задачи и навык подчиняться. И мы люди, мы очень плохо это делаем. Каждый день мы заставляем себя что-то делать или приказываем себе что-то сделать, но никогда не подчиняемся этому. Иногда хочется начать бегать, и ты себя заряжаешь. Всё, я сейчас побегу. И мы просто сидим на месте. Или мы пытаемся держать диету, но при этом кушаем кексики. 2 часа мы сидим, заставляем себя, а потом после 6:00 открываем холодильничек и приступаем. И почему так сложно нам само создавать саморегуляцию? Ответ заключается в понимании нашего мозга. Человеческий мозг делится на три основные части. Самая самая древняя часть нашего мозга - это мозг рептилии. А эту часть мозга никак невозможно контролировать силы воли или прочем. Никто из вас не сможет закончить жизнь самоубийством, задержав дыхание. Если хотите, можете попробовать после доклада, пожалуйста. Следующая часть нашего мозга - это лимбическая система, отвечающая за наши эмоции. last part which is very young of thousand of years neexuture она очень молода по сравнению с остальными ей всего лишь несколько сотен тысяч лет и эта часть мозга отвечает за наширациональные действия за принятие решения Это эта часть мозга отделяет нас от животных. И классическая экономия считает, что человек рационален. Но это неправда. И исследование показывает, что количество каналов соединения между рациональным мозгом и эмоциональным в 10 раз меньше, чем количество эмоционального соединений с рациональным мозгом. И в реальности наши эмоции диктуют наши действия. Но, используя рациональный мозг, мы сами себя обманываем и говорим, что мы это сами придумали. Мы нерациональны. В 2002 году Днил Калман получил Нобельскую премию за это исследование. Есть всего лишь несколько людей, которые не прокрастинируют. Вы как вы думаете, кто это? Психопаты. Потому что мозг психопата нарушен. У них нарушена эмоциональная часть, но они всего лишь представляют 1% наше. Всего лишь трое из вас. У остальных же есть эмоциональный мозг. И нам просто нужно найти ответ на вопрос, как, э, соединить работу рационального и эмоционального мозга. И у меня есть одно очень простое объяснение. Заключается оно в виде слона и наездника. Представьте, что у вас есть дикий слон и наездник, который куда-то хочет доехать на этом слоне. Слон символизирует наши эмоции. Он старше, больше, но живёт только здесь и сейчас. Поэтому это слону хочется заказать ещё одну курочку пива. Слону хочется посмотреть следующий сезон Игры престолов. И есть наездник, который символизирует наше рациональное мышление. Слабее, но умный. думает о будущем, строит какие-то планы, выстраивает стратегии. Он хочет быть здоровым, хочет заниматься спортом и прочие полезные вещи. И наезднику нужно понять, как работать со своим слоном, чтобы доехать до желаемой точки. Любой человек может разделиться на два я. Это рациональное я и эмоциональное я. И саморегуляция заключается в том, в навыке управления личным слоном. И самое сильное, самое крупное исследование про прокрастинацию рассказывает о том, что причина прокрастинации - это отсутствие саморегуляции. И основной смысл жизни заключается в том, чтобы понять, что в каждом из нас живёт слон, и научиться им его контролировать. Навык управления слоном заключается в нашей силой воли. И для наглядной для наглядного объяснения представьте, что ваша сила воли помещается в стакан. И если вы хотите сделать что-то полезное для себя, вы уровень вашей силы воли в сосуде уменьшается. И когда мы уставши, у нас есть всяколи силы, уровень нашей силы воли на нуле, и ваш слон начинает кутить. Uble temps, addictions keyчи наши вредные привычки поднимаются наружу, потому что у нас нет в себе сил отказаться от очередного кексика, бокала пива и прочего. И прокрастинация работает на полную катушку, когда мы устаём и у нас отсутствует силы воли. И в связи с этим у меня для вас есть две хорошие новости. Исследование показывает, что в течение дня можно восстанавливать запас силы воли. А пти тире десятиминутные прогулки могут увеличить уровень вашей силы воли. Например, поработайте час, сходите погулять и поработайте ещё час. А также сахар влияет на повышение силы воли. Сахар в фруктах, сахар в овощах. Например, вы можете комбинировать, поработать час, сходить на прогулку, поработать ещё один час, съесть несколько фруктов. И с ростом вашей силы воли вы будете более продуктивны и вы сможете выполнять больше задач. У меня есть одна история, которая это объясняет. Один лесник гулял по лесу, и он увидел дровосека в действии. Он он срубал дерево. Он наблюдал за ним. И он заметил, что его топор не наточен. Соответственно, он подошл к этому дровосеку и спросил: \"Почему ты рубишь дерево ненаточенным топором?\" На что ему дровосяк ответил: \"Ты что, не видишь? У меня времени нет, я дерево пилю\". И эта ситуация происходит в жизни многих из нас. Мы пользуемся незаточенными топорами. Это это люди типа трудоголики, которые работают по 12 часов в день с тупым топором. Поэтому помните, что если остановиться, немножко расслабиться, задуматься и наточить свой топор, то есть совершить прогулку или съесть фрукты, то ваш уровень продуктивности вырастет. Вы сможете срубить дерево намного быстрее. Поэтому ключ к к результату продуктивности - это отдых. И не сожалейте о том, что вы отдыхаете. И вторая хорошая новость: силу воли можно прокачать. Многие исследования доказывают, что силу воли можно накачать как мышцу. Если вы будете отжиматься, например, 20 раз в день, ваши мышцы будут расти. И если регулярно во время ваших отжиманий вам будут делать МРТ, вы увидите, что растут не только ваши мышцы, но и физически фронтальная часть вашего мозга, которая отвечает за силы воли. Даже если вы, даже если вы очень такой крутой прокрастинатор, то, работая над собой, вы сможете увеличить свою силу воли. Прокрастинация не заложена в наших генах и силы воли тоже. Есть одно исследование, которое изучает двух близняшек из одной яйцеклетки, и их растили в двух разных семьях. Один из них может быть очень сильным, с очень мощной силой воли, очень счастлив. А у другого намного хуже всё. И сила воли заложена в наших генах всего лишь 15-20% её силы. Остальное зависит от вас. Итак, как накачать силы воли? Я вам покажу. Если вы сможете сформулировать своё личное видение, очень важно, чтобы и слон, и наездник двигались к нему. Если вы в состоянии потока, а, и ваш слон, и ваш наездник оба одновременно получают удовольствие от пути к личному видению. И основной смысл заключается в том, чтобы быть 80% своего времени в потоке, в состоянии потока. Но на пути к своей идеальной жизни существуют преграды. Есть вещи, которые мы хотим сделать, но наш слон, они ему не нравятся. Например, одно из наших личных видений заключается в хорошем, здоровом образе жизни. Но для этого надо выйти из дома, побегать. Слон не любит бегать. Или, например, одно из наших личных видений - это создание крепкой семьи. Это значит, что нужно подойти к представителю противоположного пола. Слану не нравится противоположный пол. И проблема в том, что ваш наездник, ваш рациональный мозг, он он знает, что хочет. Он примерно понимает, как этого достичь. Но ваш слон, эмоциональная часть, чаще всего этого не хочет. И как как с этим бороться, как решить эту проблему? Вопрос на миллион. Не пугайте слонишку. Всегда есть маленькое действие, которого слон не испугается. Ключ к успеху. Начинайте с малого. Что я имею в виду? Например, вы хотите начать бегать прямо завтра. Если вы будете накручивать себя и представлять, что ой, завтра я побегу, мне надо будет бежать 5-10 км, скорее всего, слонишки стрёмно. И вы просто не побежите, вы прокрастинируете. Но если вы представите, что начав завтра бегать, вам нужно будет пробежать хотя бы до следующего подъезда или просто выйти на улицу в спортивке. Всегда есть минимальный барьер для входа. Всегда начинайте с самого малого. Начинайте это повторять регулярно. Если вы будете повторять минимальный шаг на протяжении 20-30 повторений, но иногда хватает и дети, вы выработаете привычку. И такого рода привычки помогут вам усиливать силу воли. И после этого вы можете повысить свой минимум и постепенно постепенно повышать. Я это всё запечатлил на графике, который выглядит примерно так. Всегда начинайте с малого и не пугайте своего слона в начале. И после того, как у вас получилось сформировать привычку, увеличивайте количество. И такого рода практика, её очень приятно реализовывать. Потому что нам, нам не нужно пугать своего слона о представлении о чём-то нереальном, о каких-то масштабных изменениях прямо завтра. Нам просто нужно пошагово, постепенно двигаться и увеличивать наш минимальный наш минимальный шаг. А в английском есть термин Micro habits, но по-русски я думаю, что это будет мини привычки. Помните, что мало есть много. Есть ещё одно японское слово, которое мне очень нравится. Оно называется кай, возможно, оно вам знакомо. Японские самураи практиковали всегда действия маленькими этапами. Даже если ты хочешь добраться до самого пика горы, всегда нужно идти по ступенькам вверх. Вам нужно понять всего лишь два простых японских слова и кай. И у меня есть практический инструмент для этого. А в английском языке этот инструмент называется список привычек либо а список самоиздёвок таких маленьких, но по-русски список муштраб очень похожий смысл. А это выглядит очень просто в виде таблицы на оди месяц. Вы записываете навыки, которые хотели бы изучить, и вы выписываете свой минимум, который не будет пугать вашу эмоциональную часть. И каждый день вы должны помечать, удалось ли вам или нет. works great because if it will be complicated, procrastinators will procrastinate it. И этот метод очень прост. А и если у вас возникнут какие-то в нём сложности, то вы сразу сможете увидеть, прокрастинируете вы или нет, потому что у вас просто будет пустой список. Давинчи однажды сказал: \"Простота - это тотальное решение\". А и вот этот список, список муштра, а он позволяет нам, а, развивать определённые навыки и увеличивать силу, э, собственную силу воли. Но дело в том, что при увеличении соб силы воли её в дан в рамках данных навыков она будет увеличиваться независимо от того, в чём вы её хотите применять. Есть одно исследование. Взяли несколько продавцов и заставили их бегать. Ну как, добровольно. И результаты показали то, что их продажи стали расти. И это доказывает то, что у нас одна сила воли, её и мы её можем тратить на всё. И я хочу привести в пример таблицу одного из моих клиентов. И первый навык - это навык заполнения таблицы муштры. Ну, если вы прокрастинируете, не факт, что вам поможет эта таблица. Следующая привычка включает в себя, в принципе, все аспекты сна. А сколько часов вы спите или во сколько вы просыпаетесь или во сколько ложитесь спать? Sports runs также любая любой вид спорта, йога, бег, спортивная гимнастика. Также этот список может вам помочь избавиться от вредных привычек, например, курение, употребление алкоголя. И последняя оценка включает в себя оценку вашего дня, где единица не хочу, чтобы этот день повторился и 10 хочу жить так каждый день. Вы отмечаете уровень своего счастья и насколько вам понравился этот день. И дальше мы указываем минимальные шаги к действию. И это занимает всего лишь 2-3 минуты в день. вставать до 7:30, а бегать, пробежать хотя бы 100 м и не выпить хотя, ну, сегодня сдержаться и так не выпить в конце рейтинг дня. Итак, так выглядит первый день одного из моих клиентов. Он заполнил список. Он проснулся в 7 утра, пробежал целых 150 м и не выпил ни капли алкоголя. В следующий день было примерно то же самое, результаты одинаковые, но, как вы видите, на следующий день, ну, мальца сдал пацантрашечку бывает. И на следующий день его личное состояние ухудшилось. Он, ну, он не соблёл какие-то рамки, которые сам себе поставил. И вы можете видеть, как это повлияло на его день. Он проснулся почти в 10 утра. Не пробежал ни капли, ничего. Не пробежал ни капли. Но он он смог более-менее восстановиться. Он вовремя проснулся на следующий день, возобновил бег, выпил совсем чуть-чуть. И так далее. Я думаю, что теперь вы понимаете, как работает эта таблица. Очень простая, но очень сильно увеличивает наши шансы. внедрять новые полезные привычки в нашу жизнь. И очень важно, чтобы привычки, которые вы выписываете в этой таблице, были связаны с вашим личным видением. Например, если я захочу научиться играть на пианино и использую эту таблицу для увеличения своих результатов, но при этом пианино никак не связано с моим личным видением. Это будет весь список, вся таблица будет красный. Но если вы заполните эту таблицу навыками и привычками, которые вам помогут достичь своего личного видения, то тогда вы будете получать удовольствие от выполнения их, удовольствие от прогресса, удовольствие от заполнения самой таблицы. И вы будете себя, ну, просто чувствовать намного энергичнее, счастливее. Вы найдёте вы найдёте ссылку на эту таблицу у меня в книге. Давайте сфокусируемся на последнем практическом инструменте. Как вы помните, первый инструмент - это личное видение. Первая бумажка, которую мы напишем - это формулировка личного видения. Второе - это список привычек, то есть список муштра. И последний инструмент, для него ничего не нужно. Вы можете начать это делать прямо сейчас. Мы называем это героизм. Но почему героизм? Обычно героизм мы при слове героизм мы представляем что-то нереальное, какой-то настолько мощный, бескорыстный поступок, что это не помещается в нашем сознании. Например, кто-то останавливает какую-то, я не знаю, террористическую атаку. Очень мудро называть маленькие вещи, которые мы преодолеваем в течение дня действием героизма, актом героизма, потому что просыпаться от первого будильника - это маленький маленький акт героизма. Я вам расскажу и научу вас, как быть героем каждый день. Я научился этому методу вот от этого человека. Возможно, он вам известен. Это самый известный психолог, который когда-либо жил. профессор Зимбарио из Стэнфордского университета. А и он провёл самый известный, самый интересный психологический анализ, который называется Стэнфордский тюремный Стэнфордское тюремное исследование. He putary people. Он взял наиболее простых людей, протестировал их и выбрал из них наиболее простых и затем разделил их на две группы. Одну группу он назвал заключёнными, а вторую группу охраной. И приехала полиция, арестовала группу, которую мы называем заключённые, и посадила её в тюрьму. где группа, которую мы называем охранники, уже их ожидала. Как вы думаете, что произошло? Очень плохие вещи произошли. Люди, которым была привязана роль охранника, начали придумывать очень жуткие наказание. И через несколько дней исследование пришлось остановить. А, и после того, как эксперимент был остановлен, а, этот психолог потратил 40 лет в Стэнфордском университете, чтобы ответить на один простой вопрос: в чём заключается агрессия? Откуда она происходит? Но при этом немногие знают, что этот психолог также изучал вопрос героизма и ответ на вопрос, почему в экстренной ситуации некоторая группа людей останавливается и делает что-то, чтобы изменить ситуацию. И ответ очень интересен, потому что причина агрессии и причина героизма - это очень две схожие вещи. Сейчас я вам объясню, как это работает. Я встречался с этим психологом три раза в своей жизни. Первый раз был 5 лет наза до того, как я написал свою книгу. И я спросил его: \"В чём ваш секрет? Как вы боретесь с прокрастинацией?\" В одной из своих книг он написал следующую фразу: \"В основе нашей жизни лежат два типа действий: те, которые мы сделаем, и те, которые не сделаем никогда\". Я считаю, что это очень важно. И я спросил его, знаете ли вы способ, как заставить себя сделать что-либо? И вместо того, чтобы ответить мне словами, он сделал что-то необычное. Он взял чёрный маркер и нарисовал большую жирную точку у себя на лбу. И я подумал, может быть, у него уже начинается старческий маразм. И потом он мне начал объяснять, в чём заключается смысл его действия. И для меня это было одной из самой мудрой мыслью, которой я хотел бы с вами поделиться. Он мне рассказал, если выйти на публику с такой жирной точкой у себя на лбу, например, в торговый центр или поехать на общественном транспорте, вы начинаете привыкать к тому, что люди смотрят на вас по-другому, и вы начинаете приобретать навык преодолевать социальный выход за рамки социального комфорта. И Зимбарго объяснил мне, что у нас у людей есть две зоны комфорта. Одна на физическом уровне, представьте, это, например, тёплая ванна с утра. Или когда мы сидим в собственной машине одни, и есть социальная зона комфорта. Это означает, что мы часть социума. А, но за зоной комфорта, вне зоны комфорта находится зона дискомфорта. Когда мы, например, просыпаемся с кровати и начинаем что-то делать, когда мы останавливаемся, например, рядом с аварией, когда мы начинаем, когда мы выкрикиваем в толпе, когда толпа молчит, presentation. И сейчас самая важная часть про героизм - это то, что навык преодоления зоны комфорта есть героизм. Никто не рождается героем. Мы становимся героями, преодолевая себя. Каждый раз, когда мы преодолеваем какую-то личную сложность, шансы того, что мы сможем преодолеть такого же рода сложности в будущем, увеличиваются. решили сделать исследование с детьми. Им тоже нарисовали точку на лбу. И в комнату посадили женщину, которая претворяла, что ей плохо. И та часть детей, которым нарисовали точки на лбу, останавливались намного чаще, чтобы помочь женщине, чем та часть, которой ничего не рисовали. Быть героем значит действовать. Герои действуют. И очень интересное исследование, замечание, что счастье, путь к счастью лежит за рамками нашей зоны комфорта. А многие неверно считают, что наше счастье лежит в нашей зоне комфорта, обставленной материальными ценностями. Это неправда. Чтобы быть счастливым, нам нужно регулярно преодолевать себя. И Ганди сказал однажды: \"Сделать то, чего мы больше всего боимся - это первый шаг к успеху\". Быть героем для себя самого. значит, преодолевать собственные страхи, выходить из собственной зоны комфорта. И есть одна, ещё одна цитата от Эйнштейна. Тот, кто следует за толпой, дойдёт лишь до того места, что и толпа не дальше. Идущий в одиночку может добраться до таких мест, где никто никогда не бывал. Поэтому, если вам не хочется быть обычными, если вам не хочется, чтобы ваша жизнь была наполнена скукотой и прокрастинацией, нужно важно стать для себя героем. Если вы действуете, если вы проявляете героизм, то остальным будет легче за вами потянуться, потому что первый человек, который остановится рядом с какой-то зоной бедствия, остальным будет проще остановиться. И самое главное быть первым в данной ситуации, потому что если первого нет, то никто ничего не сделает. И есть одна история из моего родного городка. Я из Чехословакии, из Праги, но я не родился в Праге. Однажды на главной электростанции сидел один пожилой человек, и он подавился хлебом, и он умирал на протяжении 10 минут, и никто не помог ему. И на камерах было видно, как много людей просто проходят мимо. Две девушки вообще сидели рядом и просто продолжали кушать, и никто ему не помог. Вы думаете, они такие злые, раз не помогли человеку? Скорее всего, нет. Скорее всего, их навык героизма был очень слабо развит. Они не смогли совершить первый шаг. И большинство современных исследований доказывает, что зло заключается в пассивности. И у этого есть большой большой большое влияние на социум. Если вы посмотрите на фотографии, это нацистская Германия где-то в районе тридцатых годов. И вы видите, как все эти люди боготворят Гитлера. Но есть один человек, который противостоял этому. Будьте таким человеком. Очень важно следовать своим личным ценностям. Если вы проезжаете мимо какой-то аварии, у самураев есть один инструмент для принятия решения. Если у них возникло желание быть героем в какой-то ситуации, у них было правило, которое называется правило трёх сердцебиений. Действуй после 3 секунд. Действуй в течение 3 секунд. Если вы проезжаете мимо аварии, примите решение в течение первых 3 секунд. 3 2 1 Сразу действуйте. Это очень важно действовать в эти 3 секунды, потому что после ваш мозг начинает придумывать себе отмазки. Есть одна важная цитата, которая хорошо описывает эту ситуацию. Для победы зла достаточно, чтобы послушные люди ничего не делали. Ну, не совсем послушные, хорошие люди. И я считаю, что эта цитата наиболее важная, потому что я считаю, что важно иметь личные ценности, но ещё не менее важно следовать своим цем. Иногда это всего лишь маленький простой шажок. А, например, было два случая в моей жизни за последний год. Один из них. Я проходил мимо горящей урны, и я нашёл воды и налил её в урну, чтобы остановить пожар. Я потратил на это всего лишь 3 минуты. Но, но там была было большое количество людей, и где большин большинство из них просто смотрели смотрели на это, но огонь был не слабый. Помните, герои действуют 3 действует. Возможно, вам выпадет шанс спасти чью-то жизнь. Возможно, вы сможете изменить социум в хорошую сторону. Возможно, у вас получится начать своё дело, которое изменит мир. С моей точки зрения, героизм - это основа моей работы. И теперь вы можете делиться полученными знаниями с остальным миром. И запомните эту японскую пословицу. Замысел без действия грёзы. Действие без замысла кошмарный сон. Теперь вы знаете, что нужно работать для достижения личного счастья. Нужно работать над этими двумя ингредиентами. Это видение и действия. И также у вас есть три инструмента для работы над этими ингредиентами. Первое - это формулировка личного видения. Как вы видите свою жизнь? Какие у вас ценности. А для действия у вас есть два инструмента. У вас есть ваш список муштра, это таблица привычек и акт героизма. Если всё соединить это в одно, вы сможете победить свою прокрастинацию. Ваша жизнь будет наполнена счастьем, и вы можете вдохновлять остальных, потому что я искренне верю, если мы хотим что-то изменить в социуме, нужно начинать с самих себя, потому что единственный способ повлиять на других - это стать лучше самому. Я хотел бы закончить свою презентацию одной простой мыслью. Не прокрастинируйте, когда дело касается борьбы с прокрастинацией. Если вам что-то кажется интересным, пожалуйста, запишите. If it was idea, write it down. If if it was something you can do, write it down because if you don't write action or two things really after. И теперь я хотел, чтобы вы написали одну или две задачи, одну или две привычки, которые вы готовы внедрить в свою жизнь уже завтра. Запишите на телефоне, на бумажке, на чём угодно, прямо сейчас. Или если вы вы хотите книгу, я буду здесь после презентации, и я вам нарисую слоника. So I wish you to find a meaning in your lives. I wish you that you can overcome your bad habits and I wish you that you will be everyday heroes in life. Thank you very much. Я желаю вам всем преодолеть свои страхи. Я желаю вам всем сформулировать своё личное видение. Я желаю вам всем быть каждый день героем для себя самого. Yes. Kয়ய"
}