{
  "video_id": "qK8eIommKn4",
  "channel": "HighLoadChannel",
  "title": "Борьба с DDoS в хостинге - по обе стороны баррикад / Константин Новаковский (Selectel)",
  "views": 2978,
  "duration": 3078,
  "published": "2017-04-22T14:48:18-07:00",
  "text": "Здравствуйте. Меня зовут Константин Новаковский. Я работаю в Виске. Это проект Селектела. И поведаю вам, так сказать, наверное, каких-то решениях и нашей боли, да, в проблеме Дедоса. Собственно, как доклад и называется, в хостинге, да, дос в хостинге по обе стороны баррикад. Э, собственно, одна из, скажем так, э, одно из больных мест, да, в хостинге, когда прилетает дедос, это то, что помимо основной жертвы, как правило, это один IP-адрес, страдает не только эта жертва, а страдают все. То есть страдает весь хостинг. В нашем случае клиенты очень разношёрстные, да, и нам больно по-разному и со всех сторон, чтобы вы понимали, да, вот почему нам больно. У нас есть много датацентров, большое количество услуг. Это как аренда серверных помещений, так и виртуалочки, да, самые маленькие за 200 руб. Дедосы пролетают на всех, как на больших, крупных. На большие крупные с серверными помещениями они, как правило, сами справляются с этой задачей, да, потому что у них уже стоит стоит своё оборудование. на клиентов, которых обслуживаем мы, в том числе и сетевую инфраструктуру предоставляем. В этом случае нам приходится самим с этим как-то справляться тем или иным способом, да? Какие есть проблемы? Проблемы бывают, это атаки на наших клиентов. Это, как я уже сказал, да, прилетает трафик или какая-то вредоносная активность приходит на одного из клиентов, страдают все. Это может быть атаки на нашу инфраструктуру. Как правило, это не цель положить нашу инфраструктуру. Это опять же как промежуточное звено до самой жертвы. Также используют нашу инфраструктуру для того, чтобы совершить атаки различными способами. То есть это может быть заказанная виртуалочка за 200 руб. APIМ поднятая. И начинается дедос на кого-либо там, либо на кого-то из нашей инфраструктуры, либо куда-то наружу. Это может быть так называемый, в кавычках взломанный сервер, да? Это непропаченный софт на сервере клиента, это не знаю, забытый без авторизации Дженкинс, не знаю, там какая-нибудь монга с эластиком, с дефолтными настройками. собственно, получить к слабо настроенной или не настроенный виртуальным к виртуальному серверу доступ, ну и вообще серверу доступ достаточно просто. То есть, э, в нашей практике был достаточно курьёзный случай, когда во время внутреннего обучения, э, создали виртуалку, э, поставили на неё какой-то слабенький пароль 1 2 3 4 5 куверте, э, чтобы все подключились и посмотрели, как там MySQL что ли настроить, да, там, чтобы он там не тормозил. Вот, буквально через 2 минуты было замечено, что что-то виртуалка очень слабо отвечает. Вообще мало реагирует Avage уже в потолок, да, там какие-то безумные значения. Посмотрели по процессам, да, как бы виртуалка уже сломана уже, как бы уже кого-то бомбят. Вот. То есть, ну, тут, конечно, процесс прибили, посмотрели, поняли, что больше по паролям ходить не будем. Даже в таких случаях, да, лучше как бы ключи раскидать. Вот, собственно, коротко. ДедоOS все знают, что такое что такое DDOS, да? На всякий случай напомню, что DOS - это Daniel of Service, отказ в обслуживании. DDДОOS - это атака распределённая, которая приводит как к отказу в обслуживании. Собственно, характеристик методов классификации, да, параметров достаточно большое количество, чтобы классифицировать дедосы. А я привёл четыре, да, которые по разным способам характеризуются и наносят разные вреты на разные, соответственно, куски инфраструктуры. То есть атака на канал, так называемаяметрик атака, наиболее популярная, да, чем она характеризуется. То есть, ну, сбивается весь канал, а забиваются оплинки просто каким-то флудом, трафиком каким-то непонятным. Как его получить, я расскажу чуть позже. Э, как это происходит? Это может быть атака на протокол. Это, например, да, атака на TCP, TCP SL, Синкуки, атака на оборудование, это в том числе какой-нибудь ACP FLТ. Что там ещё на оборудование? BGP, MLS и атака на приложение. В случае с атакой на приложение там всё достаточно просто. Это может быть даже не додос, а простой дос какого-нибудь одного айпишника, там, к примеру, отправления какого-нибудь постзапроса на выполнение тяжёлой операции, да, в базе данных. Там база данных начинает загибаться и приложение не отвечает, цель достигнута. Собственно, четыре этих классификации, да, характеризуются следующими параметрами. В случае так - это большое количество байт в секунду, бит в секунду прилетающее. на жертву. В случае с протоколом это большое количество пакетов, да, например, тот же самый Синфлут. Размер пакетов небольшой, но их очень много, и их нужно как-то обрабатывать. Ну или не обрабатывать. На оборудовании это также большое количество пакетов прилетает, то есть размер уже неважен. И в случае атаки на приложение это могут быть небольшие объёмы трафика, небольшое количество пакетов. Ну, как я уже сказал, основная цель - это заставить приложение, бэкенды выполнять какую-то тяжёлую операцию. Соответственно, большая очередь на выполнение операций. Э приложение не отвечает, приложение не работает, цель достигнута. Вот поскольку основная проблема для нас этометрик атаки, потому что в этом случае начинают страдать все, в том числе и мы, и в том числе и операторы, и оплинки, да? Очень часто оно достигается следующим способом. Это так называемый метод отражения, да? Атакующий хост рассылает запросы э с поддельным адресом источника, как правило. Ну, по поддельный адрес источника запроса - это IP-адрес жертвы. Соответственно, запрос уходит на какой-нибудь другой сервис, не другой сервер ээ какому-нибудь, не знаю, там, DNS-серверу. Об этом я чуть попозже скажу. Этот промежуточный хост начинает отвечать и отвечает на адрес жертвы. Соответственно, рассылаем много-много много запросов по разным хостам и получаем на жертву много-много трафика или много-много пакетов. Соответственно, отражение не используется в случае, ну, как правило, в случае использования э атаки на приложение. Вот, собственно, от отражения идёт усиление. То есть это когда пакет отправляется маленького размера промежуточному хосту, который вне своей воли, так сказать, участвует в атаке. И в качестве ответа прилетает э на жертву уже большой пакет. Большой пакет. Ну, то есть там пример, например, ДНСА - это да, мы сделали какой-то маленький запрос, там, скажи мне имя, э, с с типом записи, то есть там все типы записей, которые есть тебе для этого имени. И в ответ DNS-сервер отправляет, соответственно, большущий такой пакет. То есть в RFC написано, что пакет может быть не больше 512, но это было, правда, 25 лет назад. То есть сейчас пакет ответ DNS-сервера может быть и больше. Но это редко. Все стараются его, естественно, уменьшить. А в большинстве случаев атаки используют P протокол. P протокол очень простой, да, все помнят, что знают, что он без установления соединений, то есть отправил пакет, там дошёл, не дошёл, пофигу. Соответственно, и проверять источника не надо. То есть протокол этого не предусматривает. Это крайне простой протокол, да, отдельно выписал RC 768. Даже по номеру RFC видно, что это очень древний, да, 30 лет назад. И это всего лишь лист А4, большую часть из которого это заголовок и примечание. Вот. Да, в качестве основных протоколов для усиления используются SNMP, DNS, NTP. В нашей практике это было, мы замечали дедосы, для которых использовались серверы Контерстрайка, выделенные, Квейка и ещё каких-то игрушек. Да, это уже выясняли постфактум. Вот. Собственно, кратенько с теорией разобрались. Вот один из примеров а на нашу cast инфраструктуру ДНС авторитетных серверов. Собственно, это было год назад. Да, в начале декабря была очень большая активность, то есть за графиками на остальные серверы, ну, то есть можно погуглить в интернете, посмотреть статьи на рапе, было очень большое количество атак на авторитетные ДНС-серверы. Корневые серверы страдали, ээ, собственно, страдали все. Ээ кто-то в меньшей степени, кто-то в большей степени. Собственно, в нашем случае основной трафик, то есть шёл 20 минут. За счёта некаста мы всё это выдержали. Причём тут, на самом деле, нет легенды, но основной трафик прилетел почему-то в Нью-Йорк, да, шёл из Нью-Йорка. То есть по по Иникасту трафик прилетал в Нью-Йорк, Москва и все остальные как-то вот тоже так немного до гигабита не доходили. А эта атака, ну, для меня запомнилась тем, что в качестве пакетов, которые прилетали, то есть которые разбирал постфактум и во время атаки, то есть TCP дампом смотрел, что же там прилетает, да, надо как-то отбиваться. Там были ответы ДНС серверов авторитетных, наваленые запросы, и у них стоял флаг, э, дай мне информацию DNSК. Да, ДНС такая штука, которая с одной стороны должна предотвратить подделывание ДНС-ответов, да, и проверять цепочку доверия устанавливать. С другой стороны, есть проблема, что из-за этой технологии мы получаем реально хорошее, сильное усиление для DNS-атак, для DNSфиication. А, собственно, ещё очень много бывает флуда. Ну, то есть просто это летят куча пакета, что с ними делать, в общем-то, ну, как фильтровать. А в большинстве случаев это можно, то есть посмотреть заголовки и в зависимости от приложения, куда это всё летит, можно выявить некую зависимость в генераторе, скажем так, да, там по кадрам, по ID-пакетам и так далее по фрагментации. А в случае с флуда, да, то есть очень часто известен синфлуд, флут. В случае SP флуда, кстати, если атака, ну, ASP флут идёт на роутер, на IP-адреса роутера, то роутеры должны обрабатывать не асиками, да, прямо самой основной железной частью своего, так сказать, высокопроизводительной сетевой, а центральным процессором. Он достаточно слабенький и в основном предназначен для того, чтобы, ну, грубо, конечно, говоря, да, чтобы загружать информацию и правила Васик. А что делать, как мониторить, да, как как мы, так сказать, определяем ДДОС? Изначально мы смотрели на мониторинг, да, ну, первые разы когда-то очень давно, сколько там, больше шести, больше семи лет назад, да, смотрели, просто определили, ой, что-то ничего не работает, да, что делать? Э, смотрели как, находили, собственно, куда идёт примерно. примерно, да, если это виртуальный, э, хост виртуаль с виртуальными серверами, то дальше нужно было что-то делать, как-то, ну, вот находить ещё на виртуальном сервере, куда трафик идёт. Находили, как правило, блокировали. Почему блокировали, да? То есть очень часто клиентов говорит: \"Ой, вы меня заблокировали из-за Дедоса, почему вы не могли отбить?\" Да ну, просто так это не делается, да? Это не такая простая технология, чтобы взять это такой нажал кнопку и всё, нет дедоса. Э, почему блокируем? Да это ээ клиенты, потому что соседние начинают сразу же писать, что у них всё не работает, да? И тут получается, что либо один ээ клиент, который всё равно этого не выдерживает, но мы его не блокируем, либо как бы его заблокировать и он как бы понимает, что у него дедоOS, начинает искать какие-то другие методы защиты. И, собственно, поскольку IP-адрес блокируется, так называемая техника блоклинга, когда мы оператору вышестоящему на роутере добавляем правила через BGP трафик на этот IP-адрес заворачивать в D, да, как бы просто дропаем. Это правило по BGP через комьюнити распространяется на вышестоящие операторы в зависимости от того, поддерживают они это или нет. И они тоже начинают блокировать этот трафик с со стороны со своей стороны. Возможно, если кто не знаком с BGP, BGP - это протокол маршрутизации для обмена маш маршрутной информации между автономными системами и роутерами, да, масш маршрутизирующими устройствами. То есть не обязательно между автономными системами, это может быть внутри автономной системы. Вот, соответственно, замониторили, увидели, да, есть. Ну вот ещё один слайд. А это уже совсем недавно было. В полуавтоматическом режиме отреагировали дежурные инженеры и предприняли меры. Собственно, а как же понять, кто кого, откуда, куда? Да, кого же бомбят и откуда бомбят. И в зависимости от информации можно же как-то, ну, принять какое-то какое-то действие, да, либо совсем заблагохолить, или, возможно, мы можем смех смяхч смяхчить эту атаку и, э, помочь клиенту с этим разобраться. То есть, чтобы, может быть, клиент это выдержит, остатки трафика, которые до него дойдут. Собственно, как определить на помощь нам пришла пришло такое семейство, наверное, скорее семейство протоколов, часто называемое Netflow, да? А в чём суть Netflow? Есть сенсор, есть коллектор и есть анализатор. Что такое сенсор? Сенсор, э, это может быть роутером. роутер выступать в качестве сенсора. Это может быть демон на сервере. И что роутер, сенсор генерирует набор, скажем так, информацию, да, о том, откуда идёт трафик, куда идёт трафик, с с каких портов и там, например, автономная система MACдress на какой в случае машиназаторов и в зависимости от протокола там IPFIXnet Flow, по-моему, этого не умеет с какого на какой порт. и ещё какую-то дополнительную информацию. То есть это зависит от протокола. В случае NFlow версии 9, да, он же, по-моему, IPFIX, а там очень много развеситой информации. И этот протокол собственно вот, насколько я помню, в Open source коллекторах никто полностью не реализовал. Он слишком развесистый. Вот эта информация приходит на коллектор, сервер с демоном, который принимает эту информацию, обрабатывает и в каком-то виде хранит. Есть анализатор, да, это может быть ээ на том же сервере стоит или просто отдельная программа, которая ходит в хранилище и делает нам необходимые нам выборки э по трафику, который прошёл. через, э, роутер, сервер и так далее. А, собственно, немножечко про то, как это работает, да. В большинстве случаев обрабатываются для формирования Netflow роутеры обрабатывают не все пакеты, потому что если обрабатывать каждый первый пакет, то есть для этого нужно очень много ресурсов. Вот в зависимости от оборудования объёмов трафика можно найти различные таблицы. с рекомендованными значениями, значениями так называемого смплинга, да, сколько можно как м сколько пакетов пропускать, прежде чем взять пакет на обработку, да? То есть там, например, обрабатываем каждый двухсотый пакет, обрабатываем каждый, не знаю, трёхсотый пакет, тысячный пакет. Насколько я помню, в последних версиях прошивок Джунипера, да, они что-то там переработали и вроде как можно поставить смлинг один, и в результате мы получим а более наглядную картину. Но при этом нужно понимать, что все весь этот опять же Traffиic Netflow, все вот э вся эта статистика, она будет занимать много-много места. Её тоже нужно будет кому-то обрабатывать, и этот в зависимости от объёмов трафика тоже может быть очень накладно по ресурсам. А, собственно, как можно помониторить вот эти вот наиболее популярные метрики атаки? Да, у нас в качестве коллектора используется семейство набор программ NFDМ, да, в качестве коллектора это NFCD и в качестве анализатора, как программы анализатора, правда, сверху там ещё много своих обёрток написано для удобства и мониторинга. Можно использовать NFDAMP. Собственно, в данном примере мы получаем статистику по источникам, аэ, по IP-адресав источников запросов сортировкой по количеству по объёму трафика, переданного от ээ этих IP-адресов. То есть в данном случае мы скорее мониторим, а, да, мы смотрим, получаем статистику IP-адресов, с которых идёт атака, и можем посчитать, в том числе, да. А, и в качестве фильтра накладываются следующие параметры. Это номер автономной системы, то есть это наша автономная система 49505ella. И смотрим, что исходящие порты источника - это, соответственно, пятьдесят третий ДНС, 1900 SSDP 123 NTP и 161. Это SNMP, по-моему, да? Собственно, вот из практики, то есть когда когда гормыхнуло пару лет назад, да, часто проскакивали сообщения, что обнаруженная уязвимость в дефолтной конфигурации из коробки в исходняках демона NTP, да, NTPD, а я заметил, ну, ну прошли прошлись по своей автономной системе, да, посканировали мм кдреса клиентов на наличие данной уязвимости. И в общем-то было выяснено что в дефолтной конфигурации на тот момент во фриб BSD она была уязвима, а у бунты Дебианы, по-моему, никто не отвечал на плохие запросы, да, вот поддельные вот и их нельзя было использовать в качестве усилителей для атаки. Собственно, после того, как мы заблокировали клиента, да, тон очень часто люди спрашивают: \"А слушайте, ну там дедос был, там предоставьте нам какой-нибудь отчёт, мы там придумаем метод, как с этим бороться\". Ну, в большинстве случаев сложно там что-либо придумать, да, особенно со стороны клиента или там там виртуалочки там, не знаю, с 512 Мбми оперативной памяти. То есть то, что до неё всё равно уже далеко не всё доходит. Собственно, мы отправляем, ну, автоматизированно формируем отчёт о том, с каких автономных систем шёл трафик. Ну, это часто и для себя, да, для статистики, где много уязвимостей. Может быть, там как-нибудь их фильтровать, эти автономные системы, трафик из них. Соответственно, топ по портам источников. Это чтобы можно было определить, ээ, какой тип атаки был. А порт назначения, да, обычно там либо рандом, либо ещё что-то такое. Бывает восьмидесятый порт. Ну, то есть там P пакеты на восьмидесятый порт с DNA-сервера летят. Ну, как бы, ну, явно ненормально. Вот топ IP-адресов, с кого больше всего было трафика. То есть там сразу видно, о, вот этих можно использовать, если там конкурент там что-нибудь, не знаю, там плохое сказал. Ой-ой-ой, убежал вперёд. А, собственно, и количество IP-адресов, которое было задействовано, да, с с портом источника того или иного. Обычно там такие цифры, там 10.000, 20.000 в зависимости от силы атаки, там, там 30, 50, 100. И, соответственно, чем больше атака, тем больше этот отчёт формируется. То есть он как бы реально может на 10 минут залипнуть, пока он там будет всё это дело пересчитывать. Вот, собственно, как реагировать на это? То есть сначала мы просто блклили, но как бы не, ну некрасиво же. Хочется, чтобы клиентам-то лучше было. начали применять такую технику, как раскопали, как flowsк. Что такое FlowC? Flow работает. М, это оченьоченьочень, грубо говоря, это такой фаевол, ограниченный на уровне маршрутизатора, коммутатора и который обрабатывается, эти правила загружаются прямо в асик и во для обработки не затрагивает центральный процессор. Вот из минусов, а поскольку Flow работает поверх BGP, то есть информация о фильтрах передаётся поверх BGP, то есть возможность, да, как одна из его фишек - это мы можем отдать это правило по BGP своему роутеру, и наш роутер передаст аплинком ту же самую информацию. На данный момент, во-первых, далеко не все роутеры это поддерживают. Во-вторых, далеко не все операторы это поддерживают. Те, кто поддерживают, в не в той или иной степени это может быть платной услугой. И количество правил тоже ограничено, там, например, 10 правил, 50 правил. Но тем не менее эта штука очень хорошая. Если, не знаю, там прилетает 15 Гбит и мы понимаем, как это зафильтровать, мы можем это зафильтровать. В этом случае до клиента, может быть, там чуть-чуть его коснётся, а дальше не работает. Вот, собственно, какие фильтры можно, по каким критериям отбирать трафик? э все основные на описанные, э, в RFC, точнее, вот больше в RFC нет, это вот всё, что можно использовать для отбора трафика, для применения дальнейших правил, для его обработки я бы выделил вот основные. Это откуда идёт трафик, куда идёт трафик. То есть в виде префикса, то есть это может быть даже там, не знаю, там двадцать четвёртая подсеть и так далее, да? То есть мы можем там, не знаю, грубо говоря, дропать трафик, не знаю, там со всех, э, айпишников, да, со всех сетей chйнаet, да, потому что очень часто смотришь как бы вот эти отчёты, там вот 30 о, да, сейчас уже более-менее автоматизировано, да, а в своё время я даже помнил номер автономной системы Chinet. Собственно, протокол можно использовать либо просто порт. Если просто порт указать, это будет ли роутер сам будет разбираться. То есть, если этот портал видит в пакете либо в назначении, либо в источнике, то он применяет правила. Также можно явно указать, либо это порт источника назначения. А также особо вот интересный момент, да, то, что мы можем отбирать трафик по TCP флагам. То есть мы можем в явном виде TCP флут завернуть на какою-то отдельную железку, как которая там, не знаю, там там синпрокси какой-нибудь, да, которая будет перерабатывать и останавливать со своей стороны синфт и по размеру пакета. То есть, в принципе, да, мы не можем там мачить какие-то там, а, не знаю, там пятидесятый байт в пакете, там, не знаю, там 180 и так далее, да, разбираться, что это там ДНС-запрос типа. Но тем не менее этих правил достаточно, чтобы можно было уже как-то что-то побороть. Собственно, а как бороть? Что мы можем сделать с тем трафиком, который мы определили фильтрами? А на представле, на слайде представлено ээ то, как это описано в RFC, да, это можно в явном виде, да, тут сразу понятно, что мы можем заполисить трафик, да, ограничить его по полосе. что мы можем его перенаправить в какое-то другое место и можем его отметить, да, трафик маркинг поставить метку кса, да, квалитет в сервис, там, не знаю, там, например, определять, что это телефония и на неё какую-нибудь метку вешать, но это если мы не боремся с засомы в каком-то другом случае. Вот в простом виде это можно представить как пропустить трафик, дропнуть трафик, завернуть его в какое-нибудь другое место и ограничить лимит. То есть в нашем случае у нас даже есть автоматическое правило, что если мы вдруг видим, что кто-то из клиентов, а, начинает активно отправлять прямо резко, неожиданно очень большое количество трафика на двадцать пятый порт, рассылка писем, да, вот как хотя, казалось бы, 2016 год, какой там двадцать пятый порт. Вот. Но тем не менее мы в автоматическом режиме применяем правила и ограничиваем его до, а вот цифру я, наверное, не буду называть, до каких-то маленьких значений в мегабитах по полосе, чтобы сильно не офигевал. Вот, собственно, все предыдущие две технологии изначально мы использовали, да, там какие-то свои обвязки. Э, на текущий момент Павел Одинцов, ох, такой замечательный программист, очень задался целью и темой дедосов и написал утилиту под названием fastastnetm. Что она делает? Она принимает в вот эти вот нефлоow потоки с трафиком и может применить какое-либо действие, да? То есть дёрнуть какой-нибудь скрипт, отправить письмо администратору, сформировать flows правила и отправить их там через exobon. Э, кстати, в случае с при работе с BGP вот очень хорошая штука. Рекомендую. Ставительно посмотрите. Швейцарский нож для BGP. А, и с помощью них применить сформировать правила, загрузить BGJP. Exabg уже отправит эту информацию на роутер. Собственно, примерная схема, очень грубая, прямо взятая с сайта FastNet представлена на схеме. То есть, а с роутера на роутер идёт трафик или там на Switch, без разницы, да? То есть в зависимости от того, куда вы его поставите. А, а также хочу отметить, что FastNetmon может работать в режиме просто обработки трафика. То есть можно самировать порт на сервер Fastnet Monum. он просто этот трафик будет перерабатывать, формировать внутренний флоу и что-нибудь детектировать. А детектировать он может забыл указать, да, вот синфлуды, амплификейшены, CNP флуды, просто превышение, да, по полосе. А, собственно, он задектил и дальше может, вот, как я уже сказал, направить пакет на роутер или ещё куда-нибудь. Собственно, маленький пример отсчёта. Да, в данном случае мы задетектили SFL, по-моему, исходящий. Да, плохо, плохо видно. А, чуть-чуть выделил отдельные параметры, да, можем на нём на слайде увидеть, что ну, то есть он показывает общий трафик, э, трафик TCP и количество пакетов. И можно заметить, что параметры-то как-то что-то немножко разъезжаются, да. значения. Это как раз из-за того, то что обрабатывается для формирования флоу не каждый первый пакет. Собственно, далее немножечко про то, как именно прямо в виске или хостинге виртуалок. Они дешёвые и очень часто используются дедосы. Мы боремся с дедосами, как я уже сказал, для отражения, да, необходимое условие - это чтобы можно было поделать адрес источника. К сожалению, 2016 год, но далеко не все операторы, хостинги почему-то до сих пор озаботились этой проблемой, да, хотя казалось бы, вроде всё просто. Ну, как бы, ну, проверяй макадрес там или ещё что-нибудь, дат? Или просто вот что вот у тебя есть там, не знаю, грубо говоря, в Вилане там такие сеточки или там на порту. Проверь и и работай. А, и дропай плохой трафик спуфленный. Собственно, в Viscale используется для организации сети для виртуальных машин Open with Switch. Это достаточно популярное решение. По-моему, в Онстеке более-ние он там очень часто используется. Такой чуть ли не стандарт де-факто, хотя есть и другие, естественно, решения. Open V Switch - это такой, э, грубо линуксовый бриш на стероидах. Он очень конфигурируемый, и конфигурировать его, в том числе как раз можно с помощью Openflow. Это такой протокол для как раз настройки программно определяемых сетей, да, для коммутаторов, с помощью которого которого мы можем задать те или иные правила. Собственно, пример правил, да, представлен на слайде. Конечно, далеко не все правила, которые мы накладываем на свои виртуалки. Это первое DHCP, да, слева. Это мы запрещаем виртуалкам отправлять, а, принимать, блин, не вижу, простите. принимать трафик на DHCP запросы, да, и организовывать внутри сети поддельные DHTP серверы, да, в вискейле виртуалки получают DHCP IP-адреса и настройки по DHCP. То есть, чтобы один клиент другого как бы не испортил, да, не задал ему какой-то другой IP-адрес, мы применяем данные правила. И правило для антиспуфинга. Здесь вы можете увидеть внизу, что там action accept, да, action normal. Это значит, что только такой мы трафик разрешаем. То есть мы заранее знаем IP-адрес виртуалки, мы заранее знаем её маcдрес, значит, что мы её создаём. Такой трафик мы пропускаем, весь остальной трафик мы дропаем. То есть мы работаем исключительно по списку. Вот это мы знаем. Вот такой трафик - это нормальный трафик. Всё, что ненормальный трафик, мы его дропаем. Ну как бы в большинстве случаев, ну, по-моему, не было никаких жалоб, что у кого-то не работал какой-то не знаю, э сильный экзотический протокол, да, и отлично это зернета, например, да. Кто использует какой-нибудь протокол, отличный от Изернета? Fiber Channel. А, а, ну, если так, ну не виртуалка, да. Собственно, это первая часть. Второе, поскольку виртуалки дешёвые, да, там вёл, не знаю, промокод HLOW 2016 и пошёл кого-нибудь досить, да, создал пачку виртуалок и давай гонять трафик. Собственно, как только мы видим, что трафика становится очень много, да, на порту виртуалки, мы начинаем его анализировать, то есть в грубом виде. То есть мы просто начинаем дампить трафик с интерфейса, смотреть на него, э, проверять, а не флут ли это там не Pф, не CINF, а CMP FL, ещё некий набор, да, дополнительный. Соответственно, если мы видим, что это нормальный трафик и не подпадает под какие-либо наши правила, мы его пропускаем, как бы, ну, значит, нормальный трафик, да? Если мы понимаем, что клиент реально начинает флудить и использовать виртуалку хоть в явном виде, да? То есть злонамеренно либо не в явном виде, что его взломали и трафик пошёл, мы поступаем достаточно грубым способом. Мы выдёргиваем, э, из виртуалки виртуальный порт, да, сетевой. То есть внутри виртуалки это выглядит как, э, вдруг у виртуальной машины исчезла сетевая карта. То есть почему не выключаем? Ээ потому что если это взломанный сервер, естественно, там может быть какой-то, э, хороший, нормальный процесс, а может быть у человека там, не знаю, там, э, в памяти много данных важных ему и так далее. Если трафик, соответственно, виртуальный сетевую карту из виртуалки мы выдернули, мы вот этот дамп трафика, который анализировали, скидываем в отдельное место для последующего разбора. Если это был нормальный клиент, которого взломали, мы, соответственно, предоставляем дам трафик и говорим: \"Вот смотри, у тебя такая штука, надо с этим что-то сделать\". Мы поставили это на поток, то есть это работает в автоматическом режиме, да? После того, как мы поставили в автоматическом режиме, да, то есть оно само автоматически приля применяет правила, мы перестали реагировать на инциденты: \"Ой, что-то у нас сеть тормозит, потому что больше не тормозит, потому что, ну, больше никто не бомбит изнутри виртуалок\". Не так давно. Вот я привожу пример, да, это вот как раз реакция DDS активности, да, буквально там в течение дня ночи в автоматическом режиме, да, API через API создавали виртуалки, начиная додосить, соответственно, сетевую карточку выдёргивали, виртуалочка гасилась, поднималась другая заново, и опять начиналася, так сказать, попытка додосить. А, собственно, клиент нам не пожаловался. Ну, собственно, и по трафику было тоже видно, что, ну, как бы что жаловаться. Хотя бывает отдельная психологическая атака, когда клиент в явном виде до дедосит и потом говорит: \"Ну а что же я тут?\" Ну, как бы, ну, нормально у меня важе можно трафик отправлять. Вот я отправляю, как вот для этого ему предоставляется дамп, аэ, с указанием, соответственно, на правила использования услуги, что не надо делать другим плохо. На этом, пожалуй, всё. Наверняка у вас есть какие-то вопросы. Буду рад на них ответить. А, Шабаев Александр Уфанес, вот вы с а спуфингом от клиентов, да, боретесь с помощью OpenW switch? Да, это как бы вы, ну, слышали такой технологии urpfast ver space forwarding. Ну, в нам случае это прямо в Open sвиче. Ну да, понятно. Я просто имею в виду, что можно же это не городить просто на роутерах ваших включить PF, проверять. Ну, до роутера оно когда дойдёт, то есть роутер-то он не сразу стоит, там ещё свечи есть, там ещё оплинки есть. Не, ну, как правило, клиенты, которые свой адрес спуфят, они же как бы, ну, на них-то много трафика литься не будет. на них вообще не будет, да? То есть вы так или иначе запрос до адресата не дойдёт. Они же у вас не в одной сетке с двумя серверами находятся. Вот совсем нет. Уже давно всё порезано. Вот. Ну то есть в принципе PF также использовать можно. То же самое получится. И ещё один, ну это вопрос, наверное, вы NFCН как-то рассматривали, работали, но это NFН, да, то есть начали на него смотреть, но, скажем так, может быть, это лёгкая предвзятость, да? То есть хотелось немножко допилить, открылись сходники, а там такой страшный перл, что прямо, ну, проще было на питончике как бы свою обёртку сваять, потому что заходить в NFН и там смотреть в НФСновские графики, которые, скажем так, интерфейс тоже, да, ну, он кастомизируется, в принципе, так-то. Ну да, так, так-то всё, да, можно кастомизировать, но поскольку это нам не особо нужно было, да, вот прямо именно всем, то мы его отбросили. То есть сначала там, не знаю, месяц мы его потыкали, поняли, что нет, неудобно, и написали свою обртку. И и ещё вопрос. Всё-таки вот, ну, всем этим вы именно свою инфраструктуру в первую очередь защищаете, правильно? Ну, не клиентов. Когда вы там заблкхолите айпишник клиента, ну, атакующие цели добьются своей, правильно? Клиент, ну, недоступен будет. Да, да, да, да. То есть цель выполнена. А, кстати, очень интересный момент, когда вот начали заниматься этим вопросом в автоматизированном режиме, блин, всё время смотрели, что за фигня, как бы. 10 минут дедоOS такой, причём там слабенький, 2 мбита какой-нибудь и как бы и всё. Я как бы не мог понять день, думаю, ну, ну, типа почему. И вот так вот периодически думаю, э, пошёл по каким-то античатам смотреть, ну, то есть сколько стоит ДедоOS, не коррелирует ли он как бы с обедом школьника. Потому что очень частые дедосы - это там на сервере Майнкрафта, Counter Strike и вот как бы вот они друг друга как бы вот эти хостинги игровые дедосят. вот этих пиратских серверов. Вот оказалось, что просто 10 минут - это как бы бесплатная услуга на тестирование. Да. Всё, спасибо. Добрый день. Александр Азимов, компания Куatр Laps. У меня чувствую сейчас, ну, конечно, мы никак вас не заменяем, да. Это отдельная тема для разговора. У меня всё-таки вопрос следующий. А что вы делаете с TCP-флудом? С TCP флудом на кого? Ну вот идёт атака TCP флут на вашего клиента. Синфлуд, АКФЛТ, не так важно. В первую очередь, как правило, блокируем. То есть А что вы будете делать, когда эта атака пойдёт на весь ваш рейндж? На весь. Мы такое видели. Ну будем что-нибудь с этим делать. Ну на самом деле у нас есть услуга защиты ДДО с помощью нашего партнёра, да? То есть мы будем, наверное, как-то уже им прикрываться. Ну то есть это стоит, естественно, отдельных денег, да? Это уже как бы не просто по портам фильтровать и по флагам. То есть я думаю, что скорее да, конечно, придётся как-то вот с этим бороться. А встречный вопрос, как долго он длился и насколько большой рейндж был? А использовался весь наш реange в тот момент у нас была сеть с21. долбили во все айпишники, в том числе, которых не были не выданы клиентам. А атака длилась не так долго, потому что не приносила результат. Ну вы, наверное, знаете, если атака не приносит результат, она сростная, то она быстро заканчивается. Да, да, всё верно. Спасибо за ответы. Константин, спасибо за доклад. А, Лев Николаев, Макснец система, город Обнинск, Колужская область. Смотрите, у себя наблюдаем неоднократно. Мы ваши коллеги немножко по хостингу, ну, немножко по-другому это делаем, да, и защищаемся тоже по-другому. Смотрите, последнее время мы наблюдаем профиль атак. Может быть, кстати, коллеги из курейтера тоже расскажут по этому поводу. Смотрите, а, во-первых, используются для атаки наши резолверы, то есть о их лучше закрыть. Нет, вы не поняли, изнутри используется. То есть, смотрите, если я ваш клиент, если у вас взял виртуалочку, естественно, я вам скажу: \"Дайте мне resolver\", и вы мне дадите, естественно, правильно, логично. Что я делаю дальше? Я начинаю аккуратненько, спокойно использовать ваш resolвер, чтобы долбить НСы удалённые. В смысле? Спрашивать наш resolвер. Я спрашиваю несуществующий адрес, да, допустим, есть домен там target.ru, и я начинаю спрашивать. Да, конечно, естественно. И я, естественно, делаю это так, чтобы туда улетал, ну, максимальный по объёму трафик, да. Соответственно, вопрос у меня какой? А вы как-то кроме, то есть те то, что вы показали, это очень простые правила, да? То есть проде вопрос, ну, это не все, конечно, правила. Нет, я понимаю, естественно. Нет, а меня как бы, естественно, больше всего волнует то, что, понимаете, простые правила, понятно, мы можем так достаточно просто отбиваться там от разных видов атак. Например, мало кто говорит, что, допустим, если мы находимся в России, да, и сайт российского клиента находится под атакой, а если мы говорим, то есть про наш конкретно бизнес, да, то какому-нибудь доставщику пиццы в городе Калуга там, да, а зачем ему трафик из США? Я ему отрежу трафик из США, на 90% я срежу атаку, скорее всего, а оставшиеся выживет. Нет, вопрос другой. Смотрите, вы есть ли у вас какие-то наработки, планируете, каков каков может быть результат? Понимаете, становится интересен анализ трафика легитимного, но в нём лежит, на самом деле, атака. Почему? Потому что я наблюдаю этот поток трафика на резолверах, и он в сумме, если посмотреть, да, в итоге, когда когда вы в итоге проанализируете, а вы получите так, что у вас же не каст, вернее, у вас резолверов уже много. Я помню, в прошлом году вы рассказывали этот доклад. Да, он тоже не касто. Вот если вы посмотрите, какой в итоге в сумме с ваших резолверов пойдёт трафик в сторону атакуемого, вы удивитесь. То есть на самом деле там получится так, что вы по чуть-чуть, но суммарно выливаете на какой-нибудь там бедный там, ну таки нехил объём. С этим что-то делаете, планируете, смотрите или как-то? Смотрим на, соответственно, графики, да, там кэшхиты, кэшми, ээ мисы, то есть вот это вот всё. То есть рекурсоры мониторятся и, как правило, видно вот какая-то не ненормальная активность, она сразу видна на графиках. То есть в автоматическом режиме как бы я пока никаких триггеров у меня нет. То есть обычно то есть то есть есть триггер, что всё плохо. Да, да, поскольку оно работает, да, в явном виде оно не триггерится, но трафик - это действительно видно. Бывает иногда, что, да, какой-то странный ненормальный трафик. отписывались клиентам. Ну вот, то есть кто-то говорил, что это нормально. Есть клиенты, да, вот которые, то есть, не знаю, там всю ночь все домены интернета пытаются разрезлвить. Ну, как бы для них отдельно как бы песочница есть. Вот, да, мы планируем этим делом заняться, то есть детектировать в автоматическом режиме, а, в том числе DNS-трафиic и, может быть, даже выявлять какие-то заражённые машины, да, с бутнетами. внутри своей сети, но мы это только планируем. То есть вот на самом деле не так давно, вот прямо там на позапрошлой или прошлой неделе разговор об этом был. Вот. И да, сейчас мы собираем статистику, прямо собираем, а для вот, чтобы потом в дальнейшем, там через 2 недели на всё это дело посмотреть и узнать, да, есть у нас такие проблемы, нет у нас такие проблемы. Если они есть, то как они выражаются, да, и что с этим делать? Но в целом, да. Вот, кстати, не знаю, может быть, я так отчёты не прочитал. Атака на 1 DNS, вот, которая положила Twitter Gthub New York Times, уже был доклад? Нет, наверное, метапи, да? То есть, насколько я понял, это была как раз атака с легитимными ДНТзапросами от и от интернет-вещей. Да, кстати, вот следите за обновлениями безопасности своих систем, всего программного обеспечения и прикрывайте его, потому что в любой момент в явном, неявном виде оно может быть использовано и взломано, подобраны пароль. Вот это вот всё как Шодан, по-моему, да, есть поисковик, на котором можно найти кучу открытых с паролем админ админ, э, не знаю, диверов, видеокамер, микроволновок, вот это вот всего. Добрый день. Спасибо за доклад, Алексей Волков. Э, в общем, очень быстрый такой вопрос. Я так понял, услышал сейчас, что вы защищаете инфраструктуру. То есть получается, что В том числе, ну хорошо. Ну, то есть мы защищаем своих клиентов в массе, да, и свою инфраструктуру, да. Вот, э, защищаете ли вы на от атак на уровне приложения, то есть HTP, HTPS и как-то это вы решаете вообще? То есть, потому что когда, например, на одного клиента вываливается очень мало трафика, несколько мегабит, но в сумме по реквестам, ну, по запросам, в данном случае, если клиент нам напишет, может быть, мы найдём какой-то как компромисс, вариант, чтобы это как-то, не знаю, смягчить, но, но, но для того, чтобы, ну, реально с такими с атакой на приложение разобраться, то есть это нужно смотреть, дампить все эти запросы и выявлять какие-то закономерности. Вот, кстати, про рекурсоры, да, то есть когда начал заниматься ДНС, развернули Иникас и обратили внимание, что много запросов, да, вполне легитимных, но у них у всех IT запрос один. Вот и с аномальной с аномальным ТТом там что-то 240, что ли. Ну, то есть в большинственых систем сейчас насколько там в Линуксе 64, да, по дефолту стоит. Я не знаю, кто-нибудь менял дефолтное значение Т или вообще кому это нужно. Ну, то есть, ну, наверное, бывают случаи, но как бы это редкость. То есть можно вот подампить трафик, посмотреть запросы, откуда они идут. И на самом деле даже, да, даже на фаерволе можно попробовать это сделать. То есть я такой вот более-менее таком вот автоматизированном режиме сейчас ничего нет. То есть когда атака на приложение, обычно как бы знают, что за приложение и как его бомбят. Спасибо. То есть это уже может быть про приложение отдельно читать, как его защищают, если это какой-то, ну, публично известный, а не самописный. Спасибо. О'кей. Спасибо Константину. Да, привет. Всё, следующий в 3 часа доклад. Начнём слушать про нейросети."
}