{
  "video_id": "uKlGypo8hFY",
  "channel": "HighLoadChannel",
  "title": "Sphinx 3.0, поиск 15 лет спустя / Андрей Аксенов (Sphinx)",
  "views": 11194,
  "duration": 3215,
  "published": "2017-04-22T14:48:03-07:00",
  "text": "То есть, как бы, на нормальный телефон денег-то жалко, понятное дело. Всё равно и такой сдыхает через год, и такой через год. А в китайских, соответственно, с а иероглифами нормально всё. То есть как бы вроде бы глобальная прошивка, но иной раз нажмёшь кнопку, ба, я знаю китайский. Куда кликать-то? Поприветствуем, давайте. Ну-ка. Всё, шиба. работает. Вот написано, значит, про поиск 15 лет спустя. Там, соответственно, на следующем же слайде рассказано, про что я, собственно, буду рассказывать. Я пытаюсь понять, куда мне удобнее всего смотреть, чтобы хоть что-то видеть. А то вот так вот стоять как бы в принципе модно, но, наверное, не очень хорошо. Там задний ракурс, как бы шерсть, утренняя роса. Не всем интересно. О'кей. А, короче, сфинкс, да, сфинкс - это такой малоизвестный, ну, в узких уграх ограниченных людей серверо поиск. Я недавно осознал, что как бы отс менты смывая наколки весь этот беспредел начался натурально ещё 15 лет назад, уже больше 15 лет назад. У нас есть какая-то официальная дата рождения, есть неофициальная дата рождения. То есть где-то летом 2001 года начались какие-то телодвижения по поводу того, что хочется на домашней страничке построить поиск и как бы всё из чего приходится это поиск этот поиск строить какое-то Вот. Ну как обычно это бывает всегда у программистов. Вот сегодня уже спасибо, Господи, 2016. Ну то есть как бы там дети уже достаточно продвинутой школы закончили в вуз, поступили. И, конечно, проект раза два или три пора было убить, но он не сдох до сих пор. Вот, соответственно, за это время сменилось где-то четыре мажорные версии. При этом в одной из мажорных версий внутри там ещё сменилось несколько номерков, которые внутри символизировали, а, большие на тот момент переделки. Вот, значит, длится очередная переделка и очередная мажорная версия. Всё никак не выпустится, будь оно не ладно. Вот. И хочется об этом рассказать с, э, скажем так, формальной трибуны, а не из подполы, что я проделывал несколько раз раньше на всяческих метапах. На самом деле, ничего особо интересного не расскажу, то есть как бы всё, э, по большому счёту по по сравнению с ранее сливавшимися штуками про на с ранее сливавшимися на метапах штуками про разработку, но тем не менее такой, значит, чекпоинт, миниотчётик и так далее. И, значит, второй дополнительный альтернативный поинт доклада, возможно, не безынтересный, он, значит, заключается в том, что несмотря на то, что как бы фу, подляк, а понятная как бы индустрия, ну, господи, там поиск какой-то, все, это уже решённая задача давно, потому что, конечно же, люсен и что-то ещё. А, нет, эластик - это люсен, как бы там внутри всё равно, то есть как бы сверху ого-го, вот там и распределённая построена, а внутри неонка и там старый добрый люсен. Ну или наоборот недобрый. А я пытаюсь вспомнить это малоизвестное слово, которое тут на конференции как бы форсит массу. Посгрижес, цуко. Точно, постгрес. У постгреса внутри нелюсен. И этим он с точки зрения, соответственно, товарища из Подгре, наверное, а нет, он не этим выгодно отличается. Он вы отличается тем, что а постгрес. Да, конечно. Вот. Ну и, конечно, фуфу там MySQL Fullтек, наверное, тоже своя реализация. как бы в этом что-то есть. Несмотря на то, что казалось бы изучная тематика, там давно всё сделано до нас и вместо нас тоже. Ну вот, тем не менее место подвигу до сих пор есть и интересные места до сих пор находим. Про это тоже, значит, упомяну, что неожиданно. Вот обязательный слайд сегодня выглядит вот так. То есть понятное дело, что другими годами там просто другое название подставляется. Вот почему-то никто из зала не спрашивает, значит, что такое SFС и зачем он нужен, если есть search. Слайд, в принципе, на самом деле должен выглядеть вот так вот. И на каждый из этих вопросов, в принципе, есть определённый актуальный на тот момент технический ответ. А слово PKFI не то чтобы дарю, вот даже не знаю, официально заявляю, что в Гугле ноль хитов совершенно было на момент написания. Ну, теперь оно влоги попало. И, конечно же, я уверен, что буквально через пару дней и в бинге появится страничка про это дело. Вон же мониторят доклада тут же доклада. Я же поискал и всё, как бы ФСБ смотрит за нами. Короче, ноль хитов, поэтому отличное имя, ничего не значит. тоже заканчивается на ертически дарю, потому что как бы торговая марка не зарегистрирована, но если оно у вас взлетит, с вас, конечно, процент, с вас процент, и люди подтвердят, и мы весь этот процент попим и попьём. Вот, соответственно, можно пытаться вдаваться в технические подробности на предмет того, почему, значит, не ластик, не Solar, не Люсина и не ныне покойный Google Search Appliance. Это вот смешной момент. Я пытался вспомнить, когда он появился Google Search Appliance. Пришлось гуглить, когда он появился. Ну, логично, как бы, чтобы понять, когда появился Google Search Appliance, ты идёшь в Google, но не в Google Google, а в Google поиск. Ну, короче, и не сразу находишь. Это интересно. Рекурсия начинает зашкаливать. Потом вне первое, что ты находишь про Google Search Appliance в Гугле - это то, что Google Search Appliance сдох. Нормально. Причём, как бы, ну, проскочил мимо меня. Я не пользовался никогда. Просто слышал, что есть такие прикольные жёст жёлтые коробочки. Вот. Оказывается, они за это время успели появиться, как бы успешно сдохнуть. Э, партийный курс корпорации Alphaвиit Incorporated изменился и как бы все в облако и на броневик. Вот. А мы всё никак, соответственно. А общий вопрос общий ответ, точнее, на вопросы, соответственно, в ревизии шестнадцатого года не меняется тоже. Значит, ну почему не ластик? Почему нет? Мы всё ещё пока отдельные моменты, значит, сделать таки можем. Отдельные моменты, как ни странно, всё ещё можем сделать лучше. Ну и вообще это интересно. Я ещё пока не умер, индустрию не сменил. Как бы это непонятно, какой из вариантов случится первым. Они все довольно такие радостные. Вот поэтому вот так. Соответственно, чёрная смощ в чём чёрная сморщенная изюминка? Значит, нечто чёрное сморщенное. Есть там в любом проекте. Называется изюминка. Не только в проекте говорят. Иногда не изми иногда не изюмизовёшь. Это смотря с какой стороны прилипло. Если сверху, то изюминкам. Ес иначе возможны альтернативы. А определённые какие-то технические причины будут всегда. Я не не уверен, есть ли смысл их излагать. Ну традиционно вот на самом деле не очень хороший момент про перформанс. определённые внутренне архитектурные, значит, несогласие, скажем так, с Люсеном и всем, что поверх построено поверх Люсена, прямо начиная from Day One, там с девяносто девятого года. Ревьюешь это дело? Мама дорогая, а зачем у вас, парня, написано 2 Мб кода на тот момент, на текущий, наверное, 20, там, где мне надо 50 киб. И оно работает, как бы решает задачи и почему-то ещё решает их ещё в добавок не хуже. Вот. Аэ, по, соответственно, техническим причинам, которые в моменте всегда меняются, но постоянно какие-то есть, где сказать: \"Вот, а я хочу попробовать вот такой формат индекса, вот так вот битики уложить, а я хочу попробовать, значит, вот сделать вот тут по-своему, там по-своему и этом, и в этом месте по-своему\". И самое главное, я вообще не хочу ковыряться в гигантской совершенно базе кода, которая почему-то неизбежно растает в любом Java проекте. Ну, то есть, как, казалось бы, Java как бы язык похоже на сишечку, как бы ведь на чём угодно можно написать, как на фортране или на сишечке. Именно на сишечке. На Джаве можно, наверное, написать даже как на C++. Я пробовал, получается, там плюс-минус похоже. Вот. Ну, понятное дело, что я писал на Джаве в стиле фортран программиста, и у меня получалось C++, поэтому так всё вышло. То есть я в принципе пробовал, как бы вот я не после этого такой, это раньше наступил, поэтому ответственно могу заявить, что в принципе писать на этом богомерском произведении возможно. То есть уже ни хера не девяносто девятый год, когда ты пытаешься Gvame 1.0 запустить на Freebsd 2.1 и у тебя вводишь каждое поисковое ключевое слово вольтовисту, потому что Google ещё не изобрели, и она тебе в ответ такая: \"Что free? Да кто вы, люди? Опять вот эти черти с российского телекома вот с такими бородами\". Вот кошмар какой-то. Нет, эпоха сменилась. И, конечно же, денежные вливания Сана и Оракла помогли. И, соответственно, на Джаве А писать можно, б оно уже как бы взлетает чуть менее, чем везде на мобильных телефонах. Спаси, Господи. Это как раз минус мобильному телефону, наверное, слишком сложный стал. И, э, более того, в принципе, ничего не мешает вполне вменяемого вида кода изобразить, но почему-то то ли язык, то ли экосистема, то ли толзы, не знаю что. И не говорю желанием выяснять. Хотя, конечно же, мало ли партия прикажет. Не знаю, что, но суку провоцирует Java программистов писать как писатель, как же его года звали? Недавно читал не Александреску он нет Александреску он витиеватый довольно. То есть он как бы пишет Александреску - это фактически чайном Евел. То есть читаешь его как бы для тех, кто не знаком ни с Александресском, не с Чайном Евелом. Александрес - это чувак, который на C++ придумал писать как на Лиспе, но не как на Лиспе, как, наверное, на перны высшая, значит, логика, типа давайте мы на C++се изобразим метапрограммирование и все эти дела. Поскольку ублюдочный синтаксис, там максимум 17 уровней рекурсе внутри шаблона, то получается ад натурально sendil CF, если злоупотреблять. Вот это для тех, кто не знает, что такое Александрес. Учайном Евил, соответственно, это писатель, который примерно то же самое делает с английским языком. Каждая конкретная буква, в принципе, ясна. Начиная с уровня слов, начинаются сложности. Отдельное предложение парсятся с пятого раза со словарём. У меня хороший словарный английский запас. Побольше многих, в том числе нативов. Всё равно со словарём. В общем, как бы виртуоз выпиливания из лобзиком по говну, что называется. Вот. А Java про другое. Хоть убей, не могу вспомнить писателя. А прочитал недавно книгу, что-то там какая-то свеже свеже свежевыпущенная про, значит, Urban Fantasy. Всё помню, автора не помню. Там помню, что называется что-то типа chзир. Там главный герой Бен Гарстон, там выпущенно с сентября 2016 года. У меня осталось какое-то чувство лёгкой незавершённости. Я пошёл, значит, читать отзывы. Прочитал отзывы и понял, ба, Java. Понял я это в момент, когда прочитал отзыв. Всё, в принципе, ништяк. Но автор пишет под девизом: \"Нахера писать 50 слов там, где можно 800?\" Тут у меня закрылось два гештальта одновременно, причём один из них совершенно неожиданно. Вот именно поэтому как бы не Эластик, потому что Мьевел и Бен Гарстон, и я забыл, как зовут автора. Вот я ответил на вопрос, кто хотел спросить про эластик. Ну-ка не палимся. О'кей. А, да, хватит ныть. Пакеш. Код не покажу. Код, значит, цинично закрыт. Не вижу, блин, слишком далеко отхожу. А пока не покажу, скоро покажу. Тем, кто хочет, чтобы е код показали прямо сегодня вечером, что имеет вполне смысл. Ну, как обычно, значит, сптимизировал всякое, пошёл на обед, случайно встретился с какими-то людьми, которые опчк, а мы используем сфинкстом. Слово за слово хером пост. Нене, мы не будем задавать вопросов. Ну ладно, конечно, мы напишем сейчас вот, наверное, может, напишут, я не знаю. Внезапно выяснилось, что парням натурально одна из фичей, которая Docstore конкретно, она, ну, не то что критичная, но крайне интересна может быть. А по причинам личного характера натуральном я пробовал. И так плохо, и так плохо. Мы в своё время пилили более-менее публичный релиз под названием Один что-то там, который вышел сырой, глючный, и счастья не было никакого. И как бы гуси давились, ставили, он естественным образом падал. Ну, блин, ну что вы хотели? Там рефактор под названием из сугубо однопоточной программы внезапно сделали однопото многопоточную с одной стороны и к программе, которая была рассчитана на то, чтобы в один поток строить цуко а немутабельный полнотекстовый индекс, мы прикрутили многопоточность и возможность в realта индекс обновлять. Что же пошло не так? Почему же появились баги? И почему же сразу после версии 1.10 пришлось делать версию 2.0? Хер его знает. Теперь мы делаем версию 3.0. Как известно из истории состве сферной разработки, любая версия 3.0 - это верный метод угробить проект, потому что именно к версии 3.0 ты обычно созреваешь для того, чтобы вот, ну, надо переписать всякое. Ну, вот мы созрели и как бы гробим проект тоже. А в связи с тем, что опыт публичного переписывания в единичке уже был, и это было плохо, концепция, значит, DeЦ поменялась. И пробуем теперь в секретном режиме до момента определённой готовности, не то что без важности, хотя бы там общей готовности под названием пацаны, через месяц мы не сменим вам что-нибудь ещё. Так, что у вас всё разорвёт. Вот у двоих коллег в левом углу под фонарём. Сейчас должен нервный смех начаться, как бы. Вот. Поэтому в таком режиме надеюсь выложить в ближайшем будущем, как бы в очередной раз нахожусь на распутке под названием плюнуть что ли на всё. Выложить, как есть, как бы. Ну, как бы на надо же как-то эксплуатировать. Хо- хо хо хоть как-то. Пока не решился. Вот нас обманули, значит, расходимся. А релиза опять не случилось. Да что ж такое-то на Но нет, а, как ни странно, меня загнали в зал, который Делии Калькутта, который, соответственно, естественным образом технологии, как и вся Индия. Я правда не знаю, в Дели Калькульте, по-моему, поменьше, чем в Бангалори, как не почётно. Ну ладно. А, но перед тем, как рассказывать про технологии, надо рассказать, откуда эти технологии выросли, потому что как бы это у меня седой песок с яиц сыпется, но возможно среди нас есть более молодые люди, чтобы как бы они послушали и наехали на те же самые грабли, а потом такие через 10 лет. Вот рассказывал мне дядька, а я не послушал. дядька. Мог бы повторить попонятнее. А основные ошибки, которые, э м ну, ну, непонятно там полутехнологические, что называется, полупроектные, которые привели к тому, что надо вот заниматься дебильным переписыванием версии 3.0, длинным, муторным и всё никак-никак не закончившимся. Они вот такие вот. А все уже, наверное, прочитали слайды и зачитывать, вообще говоря, не надо, но я всё равно зачитают. Вот ошибка молодости номер один - это как бы неверное позиционирование под названием 15 лет назад мне нахрен, по большому счёту не была нужна отдельная база данных, которая делает всё и при этом как бы лучше всех. У меня было такое такая, значит, юношеская иллюзия, что как бы MySQL и, конечно же, Подгрест э или нет. Совершенно непонятно, что происходило с Подгасом в девяносто девятом году. Вот, если я правильно помню, это что-то было типа там версия 1.0 и как бы ставишь SQL, там видишь 3.000 QPS на pointридах из таблицы размером в 100 записей. Ставишь постгрес и, короче, нет, сикфолт, это тебе повезло с сикфотом. Я, короче, поставил постгрес полдня искал в документации, а как сделать селект, то есть мне сразу понравилось вот это вот повёрнутость к пользователю. Вот после этого я сумел такие сделать, как поставить все нужные модули в ПХП 323. Ха-ха, это шутка. Не все помнт ПХП 323, конечно. А и увидел, соответственно, где-то то ли втрое меньше перфа на point поинтридах, то ли в пятеро меньше перфа на pointтридах. Вот как теперь-то я понимаю, что как бы это был глупый и неважный тест. И надо было ещё там протестить джойны, не только поинтрида, индексреды и так далее и тому подобное, и увидеть на них всех в пятеро меньше перв. Но на тот момент я был молодой, и мне хватило. Вот. А значит, но при этом как бы другой ошибки я всё-таки совершил под название. Вот думал, что как бы нехер строить нечто совершенно андлоу, что может эксплуатироваться, соответственно, отдельным образом без всего. Строили довольно долгое время, при, э, приставку, скажем так, дополнительную, некий дополнительный м сервис, который стоит рядом с той или иной базой. Это было, как я теперь, ну, давно на самом деле понял. И теперь публично очередной раз заявляю большой ошибкой. Раз понятное дело, битву за облако просрать не явко, это как бы вот почёт, но как бы сидим не на том этаже. Возможно, облака, конечно, но JS всё это далеко от меня C++ махровый православный. А стандартная ошибка молодости у некоторых, наверное, некоторые до 70 лет, наверное, этим страдают. А про оттягивание переделок, ну, я думаю, знакомый всем синдром под названием Смотрим на код и думаем: \"Твою мать\". Как бы не понятно две вещи. Первое, зачем мы год назад решили писать именно так? Второе, почему мы 11 месяцев назад не спохватились и не переделывали на тот момент. Нам бы пришлось переделывать ровно в 12 раз меньше кода. Скажите, значит, давайте попалимся, кто как для кого знакомое явление. А остальные что, идеально пишут? Да ладно, столько идеальных программистов во всей стране нет. Надейсе там сложно. На Донде Джейсе сложно чтото. А сложно в принципе написать хорошо писать. О'кей. Как мы узнали, что Note JS - это язык, который провоцирует спокойствие программиста. Что бы ты не написал, выйдет оно. Поэтому как нормально прямо стало интересно пописать на ноди JS. Это оно я писать умею, поэтому. И ошибка молодости номер четыре. Тут спорный момент под названием, ну, всё ещё не безразличен. Вот это плохо, натурально. Потом объясню, почему, если успею. Не безразлична производительность. Вот ошибки надо исправлять. Ключевые слова, которыми ошибки исправляются, соответственно, выглядят в концепции под названием 3.0 вот так. Понятное дело, что там, если доживём, то в версии 35 они будут называться отставить. В версии 3.5 они будут называться точно так же, но в версии 3.5, соответственно, дополнительные какие-нибудь слова, надеюсь, появятся. Вот на данный момент делаем вот это вот всё. А никаких принципиально новых ключевых слов я на самом деле не говорю. Кто следит, а не просто не только лишь по хайлодам ходит, тот там мог на этапе каком-нибудь с этим всем ознакомиться или там, не дай бог статью на хабре прочитать. Вот. Но по формальным признакам на публичной площадке такие в первый раз. ачивка. Всё, можно ставить галочку больше. Про сфинкс опять ещё лет пять не рассказывают ни на какой конференции. А исправление по всем ошибкам перечисленным, которые идентифицировалась и исправляем вот так. А совершенно непонятно как бы и что. Поэтому следующий слайд выглядит совершенно точно так же. Вот. Но значит, ловко покрашен. Покрашен он, понятное дело, плюс-минус по принципам, под названием, что что уже работает, прямо на сею секунду. То есть это, конечно, невозможно меня holdable. проверить, как как раз надо вот эти вот сложные телодвижения там невозможно взять просто скачать, попробовать, надо письмо писать. Надеюсь, это, конечно, ликвидировать в скором будущем, но пока вот так. А так и Эдек, как можно убедиться, изрядная часть ошибок, точнее, как изрядная часть штук функционала, которые призваны решать те самые ошибки молодости, там делать из сфинкса всё-таки двигать по меньшей мере сфинкс в сторону, когда это уже о мангет stand мегабаза даже репликацию наполовину умеет. А и, конечно же, функционал какой-то новый появился вкусный. Вот. Текущее состояние на данную секунду выглядит вот так. Ну, то есть как бы вроде как более-менее работают, как ни странно, всякие переделки про формат хранения атрибутивки, кое-какие доблестные доделки про джесончик. Даже за прошедший где-то так полгодика, годик последние более-менее завелись индексы по атрибутам. Последние достижения, что называется, вчерашней ночи, на самом деле текущей недели, ну, как бы good enough. Это то, что вроде как в черне доделали, например, в черне доделали функционал под названием \"Давайте индексировать\" не просто атрибутивку, скалярные обычные атрибуты, а ещё и колоночки, которые сохранены где-то там внутри JSON документа. Ну, как бы мелочь приятно. Индексация по не SQL и колонкам, а про а по джисоновским колоночкам. Вот. Ну, это как бы надо побаянить и рассказать по всем подряд пунктам. покрашенным зелёным и даже жёлтеньким. Немного поподробнее или не надо? Что-то неуверенность какая-то. Руки как-то бодрее поднимали. Ну ладно, никто же не кричит, не надо. Поэтому придётся вот так. А ладно, затягивать в любом случае особо не буду. Буду просто считать со слайда. Дакore, что такое? Зачем надо? А концепция поменялась. Строим мегабазу. Раз мегабазы, надо хранить документы. раз надо хранить документы, их более нельзя хранить, как казалось в 200, как это казалось в 2001 году в оперативной памяти. На самом деле вопрос такой довольно двоякий. Как ни странно, концепция за это время поменялась у меня от одного. И на самом деле их, возможно, стоит хранить в оперативной памяти, но при этом держать персистентное зеркало на диске всё равно архитектурно отличается. Соответственно, Docstore штука, которая позволяет вам сохранить оригинальный контент документа на диске и память на это более-менее не тратить. Ну, то есть, если какие-то атрибуты нужны для оперативного доступа, для того, чтобы перелопатить 3 млн документов, которые счи с ключевым словом, то это должен быть канонический атрибут. Из Дакстора такой атрибут не поднимется. В принципе такого функционала, слава тебе, Господи, нет, чтобы в момент поиски в момент поиска из Дакстора что-то поднимать. А, соответственно, в момент, когда поиск закончился и мы хотим отдать небольшую пачку документов клиента, вот в этот момент нужен Дакстор, некое хранилище, куда мы можем сходить и оттуда что-то вычитать. А он вполне как бы ожидаемо устроен, не то чтобы цинично слизан с Солоро в частую, но довольно-таки похож по естественным причинам. Соответственно, на обычное SQL-хранилище не очень похож, а потому что требования другие, как бы у нас нету э цели. как у SQL и у LTP базы данных хранить кучу-кучу маленьких маленьких записей с персистентностью на диск. У нас эти документы потенциально большие по сравнению с записями, там, условно говоря, не 100б Кб, они там скорее измеряются величинами, там 1 Кб, 100 Кб, 10 Кб текстовые документы. Ну и понятное дело, самый угар в том, что отдельно взятые герои в качестве одного документа, доступного для поиска, индексируют, 200 гибгай, извините. Вот я го до сих пор, ну, то есть понимаю откуда, но вот не понимаю, зачем его, почему бы не подробить и вообще на месте не вырасти прекрасному лесу. Но тем не менее вот так. Соответственно, ну, цели разные, поэтому отдельная хранилка. А текст в ней хранится вполне нормально. хранятся ли там блобы и соответственно можно ли сфинкс использовать как хранилище картинок как бы ну можно да а зачем ну во-первых это интересно то есть это это вопрос из разряда вопрос зачем не ставится это примерно как из а как из буханки хлеба и там пуговицы да и мотка алюминиевой проволоки построить троллейбус как бы ну тут это чисто мне представляется что это чисто арт инсталляции. Должен быть отдельный трек на Хайлоде и вообще таких, соответственно, федеральных IT-ивентах под названием IT Ар, типа, а тут мы, короче, из сфинкса нормально, причём версии 1.10 ещё для лузов, это которая там старая глючная, в которой РТК только появились. Херак и выпилили хранилище картинок, налили на него Deл нагрузки, а он почему-то работает. И все такие: \"Вот это да, вот это вот артобъект\". И жюри такое сидит со сморченными лицами такой. Так это инсталляция как бы в продакшены не пошло, не взлетит в принципе, но красиво идея красивая, да. Это это уже хпининг, да? Или перформанс. Я вот между перформансом и хэппингом путаюсь. Я помню, что, короче, отфор. А, да, а раз уж меня варт понесло, то давайте, конечно, потрачу ещё 15 секунд. Краткое руководство по современному искусству для программистов. Если ты насрал кому-то под дверью, это инсталляция. Если тебя поймали, то хэпенинг. А, а если ты селть, позвонил звонок, да, то это форма глубоко. Вот тут у меня уже начинает вот вот тут меня уже покидает, как бы границу не вижу. То есть, а если рука вот так зависит над звонком, то что это? Это уже нужен критик, но это не по нашей специализации. Трека ещё нет, короче. Акore, э, сделали, работает работает ожидаемо, памяти жрёт крайне мало. Оверхд на отдельно взятый документ крайне небольшой. Аа текст хранится нормально, блобы теоретически тоже должны храниться нормально, но никто никогда не пробовал. наверняка, в каком-нибудь месте будет неожиданный ход, что сказать суёшь через там какой-нибудь условный SQL-протокол за искепленный блоб и где-нибудь по трассе, совершенно непонятно, где он неправильно разэскейпливается, например, и поэтому на первом нуле обрезается. Вот как бы я гарантирую это, там 25 центов, что какая-нибудь такая обязана быть, потому что никто никогда не тестировал. А как маленький сайд-эффект, э, ускорились чисто ошпаренные снипеты. Ну, то есть там услов условный раз в условный год возникает вопрос: \"А что у вас снимки-то такие тормозные?\" Вот как мы померили, они на самом деле очень быстрые, потому что если их прикомпьютить, скажем так, то есть считать заранее необходимые для вычисления снипетов данные, как это солр делает, и, соответственно, по каким-то другим данным вам снипет читать не даёт, то всё становится там сильно хорошо. Но хранить эти данные нам было негде, теперь есть где. Ура-ура. А внезапно обещанное место подвига. Значит, о чём это? место для подвига, то есть место, где удалось неожиданно, раз и что называется велосипедным образом с одной стороны, а с другой стороны свежеизобретённый велосипед называется диссертация. А с другой стороны добиться чего-то интересного, это тот самый мини-индекс для снипетов, э, который удалось клёво пожать. О, там удалось понять, что его, оказывается, надо строить только для достаточно длинных документов. удалось придумать для него простенький байтовый код, который этот самый мини-индекс для снипетов сильно схлапывает по сравнению с размером исходного документа, при этом не си не то что не сильно обсирая производительность, а чуть ли её не увеличивая за счёт того, что если ты размотанный индекс для построения снипетов, подчёркиваю, такой мини-индекс по всему документу, если ты вот размотанный большой индекс хранишь, то он как бы и и здоровый, и места много жрёт, и обсчитывается долго. Вот если его ловко пожать, то внезапно выяснилось, что всё клёво. Он и хранится компактно, и на самом деле обрабатывается быстрее, просто ту потому, что тебе меньше данных надо оббежать из стороны в сторону. Для настоящих кабанов, на самом деле, фронтир проходит даже не здесь. Вот. Но поскольку мы там занимаемся условно поиском, а всё-таки, а не в чис алгоритмами сжатия, то это совершенно не наша тематика. Вот это натурально в некотором роде смена индустрии, но а определённые продвижения делаются в данный момент прямо вот по границе под названием алгоритма сжатия. То есть есть вот всенародный любимый, некоторое время назад изобретённый LZ4, который жмёт так себе, но при этом быстрый, очень быстрый. Там с чуть ли не гигабайтами в секунду измеряется декомпрессия и, соответственно, сотнями мегабайт в секунду измеряется компрессия. Так вот, оказывается, значит, это не идеал, не последнее слово, и наука на этом не остановилась. И можно найти интересные трейдофы под названием, ну, например, декомпрессируем на 20% медленнее, но за это зато качество сжатия, а, сильно улучшаем по сравнению с CLZ4. Вот копнув туда, вот вы удаётся выяснить, что вот место для подвига есть. Я считаю, это интересным. Ну, он такой как бы гиговский юмор и так далее. А следующий кусок функционала, который, если я правильно помню, ха-ха, шутка, который уже тоже доблестным пределан. А опять интересный момент. С одной стороны, вроде как хорошо изученная штука. В каждой долбанной базе данных, начиная ещё с шестьдесят второго года, почему-то надо хранить строки. Так неприятно для программиста получается, что в этих строках, в смысле, в строчках базы данных, там, кортежах, туплах, как угодно их обзови, колонки иногда получаются нефиксированный в байтах длины, потому что одного зовут Вася, другого - Петя, а третьего Джевахарлал. И, соответственно, в четыре байта не каждое имя удаётся уложить с учётом УТФа ещё и там 8 байт, но тем не менее, казалось бы, давно известная тематика, давно уже все придумали форматы клёвые хранения строк. Ура-ура, всё хорошо. А, ходи в сорсы постгреса, ходи в сорсы майскуэля, рассматривай разные форматы строк, тырь оттуда, будет тебе счастье. Оказывается, это не совсем так. Оказывается, что, детска сказать, просто в тупую стырить оттуда формат, он не очень хорошо подходит под наши конкретно потребности. С одной стороны, а оказывается, с другой стороны, там довольно большие оверхеды, которые опять-таки нам не нужны. И оказывается с третьей стороны, что есть место опять-таки для подвигов отдельных переписанных устраивать, строить, значит, блокировки честные, как на уровне строчек, как в базе данных положено. А страшно, ну, примерно ясно, как это сделать и зачем это сделать. Натурально вот не охота ввязываться. То есть как бы строить нечто напоминающую базу данных я готов, а строить прямо такую православную транзакционную с МВЦCц, БКДжеком. И как бы это сказать, чтобы никого не обидеть там кем? Эльфийками, да. Ну, ну, короче, с преферансом, шахматесцами там и так далее. А не охота натурально, как бы. Ну, опять-таки фокус всё-таки на полнотекствуй поиска, не на то, чтобы у тебя LTP транзакции летали как ошпарин. И как бы вот там Постгриз даёт там миллион транзакций в секунду и, конечно же, MySQL тоже миллион транзакций в секунду. И, конечно же, чтобы сфинкс давал пять. Ну, это как бы почётная цель, наверное, но пять мы можем уже сейчас, поэтому хотя бы 5.000. А интересный, сколько-то интересный, достаточно простой прикладной эксперимент, тем не менее, умудрился случиться даже здесь. Внезапно выяснилось, что данные можно уложить в разных видах. Внезапно выяснилось, что подавляющая часть строчек в нашем случае она укладывается в махоньки. Э, и понятное дело, что когда тебе надо всякие строки переменной длины хранить, где должны длины храниться. Это можно сделать миллионом разных способов. Вот внезапно выяснилось, что как бы а науки по этому поводу нет, б есть где поэкспериментировать, разойтись, ээ, поиграться в SS инструкции наблюдаются совершенно неожиданные эффекты, типа там от SSE4 толку ноль. Или если у тебя вроде как охеренно быстрый SSE код, который охеренно быстро из маленькой таблички байт вычисляет длинные, то на самом деле как только ты его втыкаешь в продакшн, не бенчмак делаешь, что давайте декодируем миллион строк подряд, а втыкаешь его в поиск, он внезапно начинает тормозить, хотя на микробенчмаке внезапно исполняется там, не знаю, ээ примерно за сравнимое время с кодом, который ничего не декодирует, просто данные хранит. Ну, значит, если время вдруг останется и будет у кого-то интересно, можно это будет чуть подробнее обсосать в деталях. Опять-таки, поинт, что, а, казалось бы, вот с одной стороны продвижение, пункт Б, казалось бы, совершенно как бы навяз совершенно хорошо изученная штука, пункт В, оп, а в этой совершенно хорошо изучной штуке, тем не менее, место для личного подвига вполне себе есть. Как это приятно любому программисту удаётся вдоволь понатрахаться с битиками байтами и с инструкциями. Задача, к несчастью, не настолько решена, чтобы просто тырить откуда-то коды и всё было хорошо. А внезапно небольшое место для подвига в Джейсоне. Ну, тут ожидаемый момент тот, что конечно, что когда у тебя есть, значит, в природе примерно 120 разных парсеров для Джейсона, можно смело ожидать, что 115 из них И тот 121, который ты напишешь, он тоже будет по тем или иным причинам. Половина из них потому что очень медленно. Там половина из них потому что, соответственно, функционально. Ну, там ужасно неудобно это использовать, как бы для того, чтобы сходить к а значению, которое Парфер тебе, так и быть всё-таки готов там на парсити из джисончика отдать. Тебе надо весь буст затянуть и написать вот такую там как это сказать-то вавилонскую башню там в 17 уровней вложенности как раз для того чтобы тупо вынуть значение ключа. Ну некомфортненько как-то. Понятное дело, что эти половины на самом размере по на самом делом на самом деле размером по 90% и пересекаются. Вот. А оказывается, значит, честную структуру поддержать чисто функционально оказалось непросто. Оказывается, компрессия ключей внезапно сильно рулит. Ну то есть сохранять в джесончике не сами строчки с ключами, а держать ещё маленькую лукап-табличку. С одной стороны рулет, с другой стороны тоже там определённые сложности, когда в эти долбаные ключи ты вынужден находить не напрямую. Вот. Ну и оказывается такой внезапный очевидный момент. Дико зарулили фокусы под названием у нас там хранится массив чисто интовсоне, а не смешанный массив и для него спец спецкейс. Тоже такое дело начинает сильно хорошо работать. А чуть подробнее, да, цинично скочу по верхам. Мне там уже машут. Тут не нехорошо, на самом деле. Надо же махать, когда там 15 минут, 30 минут. Что-то я как 5 минут. Вы что, сберели, что ли? Ещё полчаса. А вот а- научаемся, почти научились делать индексы по атрибутам с целью закопать старый древний, освещённый как бы там потяной древности трёк под названием. А если надо быстро-быстро поискать, то поскольку единственный индекс, который у нас есть, это по полнотекстовому, а это полнотекстовый индекс по ключевым словам, то надо бы руками выпилить виртуальное ключевое слово. Вот от этой дряни хочется избавиться, и вроде начинает получаться. То есть бдерево есть, оно строится, когда ты данные заливаешь. Оно даже, как ни странно, более-менее успешно апдейтится в реалтаймовом индексе. И повторюсь вам достижение позавчерашнее, давайте его назовём, буквально в Черне появились индексы по Jon колоночкам даже. А неожиданное место для подвига заключается в том, что может быть мы, конечно, что-то готовить дико не умеем и документацию сильно плохо читали, но начальные эксперименты под названием ну блин дерево структура данных не новая. Обязательно же где-то можно украсть клёвую реализацию наверняка. Хе раз два. Но опять-таки, может быть, мы плохо Гуглом пользуемся или нам специальные результаты поиска пенализируют, но бенчмаки внутренние показали, что внутренний набросок работает опять-таки на нашем ворклоде. Лиаля 3 руб. Он не достаточно женерик. Все стандартные дисклеймеры надо произнести. Тем не менее, на ранней стадии делаем бенчмаки внезапно выясняется, что рукописное б дерево всё равно оказывается измеримо. Я пытаюсь лихорадочно вспомнить, насколько в точности. Порядка 20-30% мы, по-моему, видели. А вы с чем сравни? С гугловской реализацией. А то есть, которая мапы. Я забыл за давностью, поскольку этот бенчмак делался, грубо говоря, там в начале года. Вот я забыл, как она в точности называется. Вот. Но тем не менее, как бы оп и мы видим топа лучше перформанс этого самого а дерево, написанного в рукой на коленке. Да что ж такое-то? Хочешь бывает использовать какую-нибудь библиотеку, а заканчивается тем, что опять ЦМП в сотый раз в жизни переписываешь. Жизни нет никакой. Ну и понятное дело, всё, что там, всё, что написано в Википедии, опять оказывается правдой. То есть вот в момент, когда ты в очередной раз рукой переписываешь РЦМП, будет он проклят. Незапно выясняются все стандартные грабли, что на самом деле этих самых баревьев много. такие варианты, такие варианты. Б просто дерево, B плюс дерево, как хранить слишком большие ключи, как хранить слишком большие значения. Overflow таблицы, конш налоги, когда у тебя сильная нагрузка, которая у нас, слава богу, пока нет, и мы этого дела не отгребаем. Ну и, в общем, место для подвиги опять оказывается бесконечным. Всё замечу начинается с того, что далеко не для всего, как ни странно, сделаны экономические реализации, которые просто надо брать и пробовать. То есть тут фронтир он не где-то там, то естьп всё ещё до сих пор не решённая проблема, не везде. Репликация, понятное дело, и всё, что вылезет из репликации в момент, когда репликация заработает более-менее стабильно, это отдельный гигантский тёмный лес. Но мы в этот тёмный лес тоже идём на данный момент. Ну, давно уже, на самом деле, умеем вести, проигрывать, а, лок действий. Э, Binлок-то появился давно для того, чтобы какая-никакая Data Safти была в сфинксе. А научились, соответственно, пересылать его по сети, куда надо, какие нужно кусочки. Научились пересылать не только лишь кусочки лого, а в тот момент, когда это выгоднее, эффективней или просто новая нода встала в строй, а куски индекса, а не куски бенлога. А и на данную историческую секунду умеем, значит, такую в полуручном режиме репликацию из одного мастера к нескольким, соответственно, слайвнодом. Ну, как бы в этот момент должны вот вот обязаны просто звучать крики зала: \"Фу-фу, почему не Эластик? Там же всё давно сделано\". Ну о'кей, они в 2009 году начали всё это делать. Мы, соответственно, в 2015-1шестна. То есть приходите через 7 лет, как бы, ну, сплит не всегда переживает свою власть. Ну, можно подумать. Мы всегда будем переживать сплит, когда у нас дойдёт до ситуации, когда будут сплиты. Господи, ты что? Я верю, что вы сможете. Нет, я я верю, что мы отгребём и после этого сможем. Но вот в то, что мы отгребём, как бы это это неизбежно. То есть вот а ну так и это как бы вот работа, слава богу, запустилась. То есть мы в кавычках проснулись после определённой задержки. Репликация есть хайв майнда пока полноценного, что детскать где-то там висит и зудит облако отдельных нот. Они как-то между собой общаются доблестно. Их мечта любого сесса админо. Тем более девопса совершенно не надо менеджить. Понятное дело, понятное дело, сверхцель такая. Понятное дело, вот пока боремся с первым шагом. Место для подвига здесь, очевидно, бесконечное. То есть, ну, фронтира в распределённых системах это как бы давно существующая штука. А, и все знают, наверное, кто слышал слово распределённая система, матерное слово Джепсон под названием \"Скандалы, интриги расследования, показать всё, что скрыто, сломать всё, что не сломано\". Вот. То есть тут метод для подвига, понятное дело, бесконечный. А, и, собственно, чуток подробнее про формат индекса. Новый формат индекса позволяет нам индексировать тексты и находить в них ключевые слова. Невероятная ачивка. Вот. А, и, конечно же, да, и ключевые слова, как бы. Ну, и что? Ну, с точки зрения наружной, конечно, отличий не так много. Единственное отличие, которое на данный момент, на данный момент, подчёркиваю, вот прямо сейчас сею секунду, если мне типа моча сильно в голову ударит, потому что в очках опять Хайлот 10 лет Хайло, да, как бы как помню 10 лет назад на Локе стоял в очке такой: \"Ну, пацаны, ну побыстрее. Этот доклад через 5 минут\". Сейчас пошёл посетить Сколково научный кластер. Конференция не в два потока, а в 16. Ну пацаны, ничего не меняется с годами. А, да, такого же рода ачивка. Вот всё то же самое, но теперь несколько быстрее сразу из коробки на данный момент. Ну, то есть там внутри как бы это с точки зрения пользователя-то не сильно заметно гигантские внутренние революции, а с точки зрения пользователя заметно, что оно в момент, когда окончательно заживёт, ну, уже зажило в какой-то мере, начнёт сильно бодрее индексировать. На бенчмарках видно раза три 3 12. Это означает, что до продакшена раза два, наверное, 2 с2, может быть, дойдёт. Самое главное, появилось место для разных расширений. То есть у нас не было совершенно места для того, чтобы внести в индекс какие-нибудь клёвые данные, которые там нужны для того, чтобы быстро считать запрос. С одной стороны, и мы начина упирались во всякие дебильные ограничения под названием: \"А вот 256 полей и физически нет битов\". И сделали с этим что-то очень сложно. То есть вот когда-то 15 лет назад, ну ладно, не 15, там, может, 10 лет назад придумано кодировать позицию там 8 к 24 бит отводить на номер поля, 24 на номер слова. Вот в лимит, что 16 млн слов в документе довольно сложно упереться, тем более, что мы там цинично читим, счётчик переворачиваем и как бы никто не заметит, что у тебя на самом деле слово смачивалось в позиции номер 16.877217, а не в позиции номер один. Это вот вот такой баг. Он очевидно есть, но его довольно сложно стриггерить. А вот расклад под названием мы оперо 256 полей в него, понятное дело, и врезаться можно. И с другой стороны, если делать какие-нибуд фокусы под названием давайте пытаться сделать индексацию полноценную джесончиков, чтобы автоматом заливаешь джисончик и не мучаешься головой о том, чтобы заранее сконфигурировать все поля, атрибуты и так далее, ну, внезапно понятный геморрой под названием тебе залили 257 документ, в котором 257 поле. Оп, он не проиндексировался совсем. нехорошо. Вот хочется это починить, и новый формат позволит это сделать. Вот. А опять же внезапно, хотя казалось бы, тоже так хорошо искоженная поляна, особенно с учётом того, что её топчут, а, пацанчики, значит, из малоизвестных компаний типа Гугла, Майкрософта, а также прочих Яндексов и, соответственно, прико прикормленные ими кафедры информационных технологий в разнообразных вузах, кото надо писать диссертации и постоянно что-то изобретать. Тем не менее, несмотря на всё это, всё ещё опять же удаётся там какие-то лёгкие личные улучшения изобразить. Но в данном случае лёгкие личные улучшения выразились в том, что делал, значит, всенародно любимый кодек, который основан на, а, кодек индекса, который основан на алгоритмике ПФД, про который не буду ничего рассказывать, опять-таки, в так называемых кулуарах могу чуть подробнее для интересующихся. А для того, чтобы кодек всенародно любимый в полнотекстовых поисковичках на данную секунду под названием ПФД блочный, это значит, что для того, чтобы ему вкатить блок данных на зажатие, ты должен этот блок данных сначала как-то скопить. А как его скопить? Копить его в абсолютно каком-то сыром виде не охота. Памяти больно много будет жрать, потому что на самом деле как бы длинный хвост документов, он как бы длинный. 90% а списков по ключевому слову. Они там, наверное, за два документа не вылазят в коллекциях миллионах. Ну о'кей. После этого произошёл смешной угар. Написал просто надрестал без прихода в сознании некоторый простенький, значит, кодек со всем пониманием текущего момента для того, чтобы временно хранить данные и после того перекодировать. Значит, как вот текущий State ofard завещал и не смог его улучшить. мерил, мерил, не получается. Ну то есть не смог, это некоторое лукавство, конечно, но не смог натурально улучшить кодекс до а такого состояния, чтобы была уверенная победа и там коммунизма и полная необходимость пользоваться этим самым ПФД. В один прекрасный момент понял, что как бы, ну, если работает сильно более простой кодек работает достаточно хорошо, ну, то есть жмёт быстрее и там разница по размеру в пределах, я не знаю, там 2%, может быть, конечного размера индекса, 3% конечного размера индекса. Жмёт быстрее, разжимает примерно так же. Разница по размеру смешная. Ну, о'кей, раз так всё хорошо, его и оставляем. На этом успокоился. И внезапно, опять-таки, как, значит, проклятье, наверное, моё такое, как в известном ролике товарища Крыжовникова, а отбитого фарша на этом уровне никуда не удаётся убежать, и вылезают всякие, опять же, вот неожиданные штуки, как то оказывается местами, местами, то есть есть ещё в мире такие места, где снова переписать strcmpли или memримый эффект. 2016 год. Силан ГЦЦ то ли п то ли шесть интринзики в полный рост космические корабли бороздят Алеппа, а некоторые прилетают из ближайшей акватории побороздить Алеппа и улетают на место. Нихера. Всё равно переписываем МЦМП. И, блин, ладно бы на микробенчмарке видел 3%. Натурально вижу изменение скорости индексации, типа вот было 50 Мб в секунду, вот стало 53 Мб в секунд. В этот момент, в принципе, так-то по уму надо говорить себе: \"Нет, нет, больше никогда. А не надо заниматься перформансом, это в настоящую эпоху вредно\". Вот. Но вот, блин, привычки дают себя знать. И тем не менее. Ну, ещё один смешной факт, который опять-таки там написан, это внезапно выяснилось, что самая лучшая хэш-функция, несмотря на то, что пишут в интернетах, это всё-таки CRC32 и конкретно CRC-32 в аппаратной реализации. То есть не мурмур, тормозной. Вот сетап сетап большой, ключи короткие, сетап слишком длинный. А, в общем, вот хорошо мне знакомое место для подвига. Наелся изрядно. А резюме внезапно очередной раз перекалибровываются ожидания. Внезапно, даже на низком уровне про перекладывания битиков, байтиков и, блин, копирование строк, удаётся внезапно получить какие-то неожиданные совершенно результаты. Натурально изобрести, как бы это пафосно не звучало, не патентовал, в отличие от Яндекса. А, но тем не менее изобрести довольно интересный кодек для хранения данных полнотекстового индекса и все эти дела. Возможно, надо запатовать, конечно. А опять же стандартный вопрос, когда реализм, когда смерть? Смерть скоро. 100 лет не протянет никто в этом зале. Возможно, кто кто планирует протянуть 100 лет? Кто? Ни хрена себе, сколько оптимистов среди нас. Дописываем свои проекты и доживём до 100. Что? Ну это, ну, в принципе, я согласен. Если 100 в двоичной системе, то уже дожили все. Если в восьмиричной, то, в принципе, тоже Verdin Great. 10восьмиричный октал, что 64 же будет. Ну, нормально, вполне возраст. Ну да, да, наверное. Вот. А релиз, как обычно, значит, это бывает у программистов, запланированный на условно вчера, чтобы ловко, значит, подгадать к хайлоуду и такой: \"О, а вот мы как раз 2 года цуко пилили и как раз вот зарелизили вчера\". Ни хрена. По ряду причин разнообразных, в которые вдаваться не очень хочется, опять не смог. И опять нахожусь на известном перепутхи под названием: \"Ну, доделать всё-таки\". Ну вот он уже, вот он уже свет в конце тоннеля. Либо сказать: \"А, ну нахер, выкладываем как есть. Это вот вот таккенский тег альфа\". Приклеиваем версию, там пишем 299 или что-нибудь типа того, и нате, мучайтесь. Ну как мучайтесь? С одной стороны, новый функционал интересный, который уже готов, он появился. Его довольно много. С другой стороны, меня немного очкует тот факт, что революции, например, с тем же форматом, они ещё ни хрена никак не доделаны. Там ещё где-то, грубо говоря, там последние 20%, то есть последние 80% работы сделать осталось. Вот. Ну и про смерть как бы тоже там 100 лет, но это независимые совершенно события. Вот, значит, про что рассказывал иностранец. много слов, как бы я понимаю, что запомнится на самом деле ни хрена не сфинстри, а там про чайнум еве, например, и про арт-инсталляцию. Но тем не менее подведём итоги. Значит, про что вообще доклад-то так называемый? Ну вот знаете что? Мы ещё пока живы, мы просто так пахнем и всё ещё пилим доблестную версию 3.0. Она уже она уже, ну, мы нормальный человеческий стартап. 15 лет в режиме гаражного стартапа, 2 года там пилим версию. В общем, всё как у людей. Аккутер действительно надо перенести в Эстонию. Конечно, уже самим не смешно, но ну вот так. Всё ещё пилим версию 3.0. Подходит почти готово на предмет того, релизить её завтра или, ну, в смысле, тут General Public или отдельно взятым людям, которые рисковые выдавать доступ по имейлам. Э, можно смело проголосовать, только прошу это сделать как-то более там, а, измеримо, чем вопросы про эластик встречный. А уже готов и уже местами эксплуатируется. Люди повернулись жопами. Видать слайды готовят. Ряд небезынтересных штук, которые доблестные парни из Авито как бы используют. Парам-пам-пам местами в продакшене, как ни странно. То есть чточто уже в продакшене говорит, что накатили. Ну только что он двусмысленно сейчас сказал только что накатили. Вот. Ну ничего, коне, ну накатить-то всегда на сегодня второй день конференции на на като с одной стороны обусловлено, с другой стороны все небо вчера накатили. А и на самом деле ээ повис сейчас развис. Ну налог встал, да. А интересный, на мой взгляд, неожиданно интересный, на мой взгляд, факт то, что на во вроде бы изученные ниши, во в которой как бы масса продуктов всё уже давно сделано за нас и как бы липце давно написаны, хэш функции давно реализованы и Google библиотечку с B3 делал и так далее. Тем не менее копаешь буквально на полштыка в податливый вкусный и питательный чернозём. Внезапно выясняется, что место подвигу есть. Место подвигу есть в совершенно неожиданных местах и есть всяким интересным чем позаниматься. То есть рано ещё, наверное, на пенсию ещё э в смысле, в этой индустрии ещё не всё сделано, ещё есть чем позаниматься. А вот и, собственно, про 15 лет-то. Причём тут 15 лет, где сказать? Ну, наблюдение небольшое, что значит за 15 лет сильно поменялся ландшафт с одной стороны и масштаб проектов с другой стороны. То есть, если в момент, когда 15 лет назад было в какой-то мере, может быть, оправдано строить не универсальную базу данных, а всё-таки приблуду специально для поиска, сегодня уже нет. Вынуждены строить приблуду для поиска. 15 лет назад никто не с не слышал про всякие, значит, про виженинги быстрее, чем за месяц. И, соответственно, сервера в облачках, которые быстро взлетают, умирают и так далее. Про новые увлекательные концепции. С одной стороны, железо не позволяло разного с другой стороны, э несколько раз, ну, грубо говоря, несколько лидирующих продуктов униши, они доблестно появились и исчезли. Google Search Appliance, спаси, Господи. Google Search Appliance, оказывается, сдох. Уходят легенды. Вот. А, соответственно, ну, первый ключевой момент, э, понятный, какое-то время назревавший, он про то, что внезапно кругом сплошные базы данных, нет уже больше специализированных решений, и всё, что вы будете делать, будет в очередной раз очередной, значит, специализированной базой данных. Если вдумаете такую хрень строить, ориентируйтесь на это. Ну и второй ключевой, внезапный лично для меня факт, хотя тоже для одного меня, для кого-то назревшие, это вот внезапные логиналитика, которые оказались прямо вот супернишей для поисковых внезапно для поисковых серверов. Ну то есть, казалось бы, мы по естественным текстам ищем релевантность, пользовательский контент, вот это вот всё. Нет, логиналитика. Соответственно, занимайте слово поискифаер, убивайте всех в нише. Дарю, как ни странно, всё там. Вот человек изображает, что меня зовут Хуан, и поэтому все вопросы мы задаём в туалете. Пока стоим на локе. Вот. Да, друзья, спасибо Андрею. А, весело и задорно, но, увы, скушало всё время на вопросы, поэтому давайте мы будем ловить его тело где-то вот там, где он сказал. Либо 5 минут ещё на вопросы есть. Не надо, чтобы отратировать нужна аудиторию. Андрюх, прости. Продолжим слушать про Сфинкс в исполнении ребята Завита. Поэтому, если интересно, как работает то, про что говорил Андрей, в реальных условиях, оставайтесь, послушаем. Один в один. Так, надо что-то сделать с микрофо."
}