{
  "video_id": "uwCUpnTSQw4",
  "channel": "HighLoadChannel",
  "title": "Воспитать в себе обезьяну / Максим Дорофеев (mnogosdelal.ru)",
  "views": 4067,
  "duration": 4593,
  "published": "2017-04-22T14:47:45-07:00",
  "text": "Давайте я вообще буду говорить, при чём здесь обезьяна, при чём здесь я, причём здесь всё вот это вот происходящее и что у нас с вами сегодня будет такого. А если кто не знает, то, ну, я с детства программировал, поэтому на самом деле, несмотря на то, что я занимаюсь сейчас, занимаюсь темой далёкой от программирования, меня по-прежнему зовут на айтишной конференции. Первые деньги программированием заработал в 13 лет. Я ещё тогда в школе учился. Ну и с тех пор просто долгое-долгое время работал в этой индустрии, а потом в какой-то момент превратился в начальника. Это, на самом деле, наверное, факт постыдный здесь его стоило бы скрывать. Но тем не менее вот, да, я превратился в начальника, а после начальника я превратился в такого вольного консультанта и начал помогать людям работать со своей прокрастинацией. Не скажу, чтобы побеждать, работать. И путь, а при помощи которого или идя по которому я стал прокорнатологом, он немножко непрямой, потому что изначально я хотел стать вольным таким консультантом, который будет рассказывать красивые идеи. Вот как Асхатуразбаев, знаете, да, вот он сейчас в параллельном потоке работает, он рассказывает, как внедрять во всякие места, а и компания. А я думал, что точно так же буду нести доброе, светлое, вечное в лице теории ограничения или каких-нибудь ещё интересных новомобомонных концепций. Но попадая на клиентов, я везде встречал вот таких вот ребяток. Ну, я думаю, вам знакомы. Вот. А они проверяют почту по 6 часов, а от своего рабочего дня, потом оставшиеся 6 часов они ходят по митингам. Ну, тоже потому что это очень важно ходить по митингам и проверять на них почту, потому что иначе ты не успеешь, тебе больше почты придётся проверять дома. И в такой ситуации, когда приводят консультанта очередного по каким-нибудь теориям ограничений, ну там все счастливы видеть этого парня. Вот и приходилось на самом деле заниматься тем, чтобы сначала из выводить из аутлука, отучать спонтанно трогать себя за смартфон в публичном месте. Знаете, да, вот эта вот беда, нежно поглаживать себя за смартфон в публичном месте на людях, это уже стало просто какой-то такой околонаркотической зависимостью. Вот сейчас кто себя гладит, гладит кто-нибудь? Да, не смотрите за вами могут наблюдать. И таким образом я превратился в человека, который начал помогать именно бороться с дефектами на уровне личной эффективности. Так я туда и пришёл. Причём, на самом деле, сейчас материалов, методик, источников по личной эффективности, а про то, как вот перейти из состояния завала в состояние более-менее организованного человека, их тысячи, их очень много. А есть вот то, что я называю, то, что я пропагандирую, это техники пустого инбокса. Есть дяденька Майкл Линенбергер со своими тоже методологиями. Есть всем известно, я больше чем уверен, много людей слышали такое имя, как Дэвид Алин и его Getting Things Done. Есть Успеватель Василия Кислого. Всем рекомендую просто вот за из-за концентрации сквернословия на единицу текста. Вот настолько прошибает на слезу его произведение. А есть ещё тысячи всяких дядинек, которые работали, прорабатывали эти темы. Есть Грег Макеон, есть 18 минут, 12 недель, семь навыков, прочие, прочее, прочее, прочее. Тысячи их. И просто вот, ну, как блеснуть соплёй на солнце. За последние полтора года, хоть как-то связанной с самоорганизацией книжек, мне пришлось вот перелопатить столько. И это только бумажных и не считая научных статей. Реально дофигище. И всё так или иначе относится к этой теме. И на основе вот этого и примерно ещё трёх таких куч, а я примерно вывел какую-то такую модель или понял, во что надо верить. А во что надо верить, когда мы пытаемся научить людей меньше прокрастинировать и больше успевать, по крайней мере, на первых порах. А и вот это вот искусство, техники пустого инбокса, они основаны на одном очень простом, но очень обидном основном предположении, из которого растут потом все ноги. А вот это вот основное обидное предположение звучит следующим образом. Большая часть времени, большую часть живых людей, то есть нас с вами, а мы с вами иррациональны, мы не можем действовать логически, и наши поступки просто бестолковы, по большому счёту, а мы импульсивны, мы не опираемся на какие-то наши долгосрочные интересы. Мы действуем, опять же, спонтанно, действуем на автомате, не особо понимая, что мы прямо сейчас делаем. Правда же? Вот кто-то думает, что сейчас он чего-то слушает и проверяет почту, это нормально. И хуже того, мы не считаем такое поведение нормой. Мы считаем, что всё-таки большинство людей логичные, там, рациональные, у них есть какие-то долгосрочные стратегии, они им следуют, правда же, да? А и вот возникает вот эта вот дихотомия, двуличность мира. С одной стороны, мы такие нелогичные, импульсивные и автоматизированные ребятки, а с другой стороны, мы считаем, особенно когда вот пишем дорогому коллеге письмо в 16 абзацев в 3:00 ночи и ставим его семнадцатым адресатом в Ц. Что он прочитает? Но он же должен, да, вот прочитать, значит он прочитает. Ну, бывает так. Это вообще отдельная тема, как люди работают с почтой. Знаете, это вот корпоративное правило: на третий replyй to all, включи в Цх, кого знаю, чтобы они не чувствовали себя одинокими. Ну вот потом прими митинг, не приди на него. Это тоже очень принято. И вот это вот положение, оно обидно кому-нибудь, не? Или так и вы ожидали, что ровно это и произойдёт? Кому обидно? Ты не отлично. А самый вообще апагей вот этой вот нелогичности ирациональности - это вот такая маленькая зарисовочка, которую я называю приоритет по умолчанию. Ну, то есть, если у нас нет никаких внешних конкурирующих раздражителей, и тут вот нам дадут две задачи, одна из них срочная, вторая из них важная. Мы по умолчанию какую будем делать? Срочную. Кто бы срочную начал делать? Вот по умолчанию срочную, признавайтесь, ничего страшного. А кто бы важную начал, продолжил бы делать важную. В мире всё на самом деле ещё хуже. Мы начинаем делать понятное. Если средисрочной важной задачи нет понятной, мы что делаем? У нас есть дефолтная понятная деятельность. Вот перед докладом вы её пере, ну, перечислили. Почитать на Хабре, посмотреть на Ютюбе, пописать на Хабре, опять проверить, не прочитали ли нас то, что мы написали на Хабре, и сделать ещё что-нибудь такое интересное. Вы же замечали, да, за собой такие вещи. С одной стороны, у тебя есть какая-то важная долгосрочная задача, тут тебе прилетает со срочным начальник, а ты котиков на Ютбе смотришь. Ну нормально. Ну так вот и эту нашу особенность, её нужно принять как должное. Мы ничего не сможем с собой делать. Мы можем только приспособиться. И почему вот такая штука с нами получается? Я вам расскажу одну прекрасную модель того, как устроено наше мышление. Вообще наша внутрянка, наша башка. И всё станет понятно. Вот эту вот прекрасную модель, которая приводит вот к такому поведению, я прочитал в книжке, в блоге Тима Урбана. Кто знает этого персонажа, да? Он относительно недавно на Теди выступал. Он рассказывал, кто такие прокрастинатор и как устроен мозг прокрастинатора. Вот вот эта вот его моделька, на мой взгляд, так устроен мозг любого человека, нас с вами. А согласно этой модельке, о чём она говорит? А у нас есть черепушка, вот эта вот полусфера - это черепушка. В ней есть пульт управления нами, человеком, вот этими вот конечностями. И там, конечно, есть рациональный тип - это персонаж, который отвечает за рациональное принятие мышлений, решений. Есть маленькая обезьянка семинутного удовольствия. Это тот персонаж, который живёт по законам успешной обезьяны. А законы успешной обезьяны гласят, что а для того, чтобы быть успешной обезьяной, тебе нужно есть, когда ты хочешь есть, спать, когда ты хочешь спать и не делать ничего, если это не весело. И большую часть времени у руля находится именно обезьяна. А рациональный тип, он, конечно, пытается как-то воздействовать на обезьяну своими рациональными доводами, что вот у нас там работа, у нас там KPI, у нас МБО и прочая хрень. Обезьяна говорит: \"Конечно, да, отлично, да, это же завтра, завтра сейчас мы начнём всё делать. Сейчас начнём делать. Только давай рыбок посмотрим\". Или нужно будет срочно узнать население Индии в 1861 году. Почему-то это очень надо мне сейчас для отладки. Я иду в Википедию, а Википедия там один шаг, одна ссылочка влево и всё, и хана, я залип на час. А рациональный человек не очень может убедить обезьяну. Обезьяна его не слушается. Но у Тима Урбана Тима Урбан вводит нового персонажа, а которого обезьяна может бояться. Это панический монстр. Это тот самый персонаж, который появляется за недо вот буквально за мгновение до дедлайна или в тот момент, когда у нас возникает такой чётко осязаемый риск потерять лицо, где-то опропендоситься ещё каким-либо образом. И панический монстр - это единственный персонаж, которого обезьянка боится. Она думает, что ой, мне пора сваливать. Она сваливает быстро и оставляет у руля рационального типа. И только тогда мы можем делать что-то рациональное. Мы пытаемся делать что-то рациональное. В этот момент мы даём себе очень много всяких обещаний, которые потом никогда не будут выполнены. Просто, как я обычно говорю, что вот люди с дипломом о высшем образовании минимум раз 10 были клятвопреступниками, да? И вот сейчас в этот момент кто-то тоже из наших братьев более младших становится этим клятвопреступником. Сейчас сессия как раз вот мы делаем дело в ночь с пятницы на понедельник. Худо бедно успели, всё отлично. Говорим больше никогда до этого не дойдёт. никогда. Ну и как только опасность ушла, обезьянка обратно к нам возвращается. И а сделать мы с этим ничего не можем. Обезьянка у нас живёт в голове. И почему я назвал доклад воспитать свою обезьяну? Мы не сможем от неё избавиться. Мало того, если даже бы мы от неё избавились, рациональному типу не хватит сил больше, чем на час держать наши рычаги управления. Всё, тогда мы вообще останемся даже без обезьяной. И зачем нужно воспитывать обезьяну? А иначе она будет у вас не воспитана всего-навсего. А модель на самом деле прикольная, она ржачная, но, несмотря на это, есть глубокие научные исследования. Это ещё не самая научная книжка, но тем не менее даже она говорит она проводит параллели, она показывает, что не столь уж и безнадёжна и ненаучна моделька обезьянки. Есть дяденька Данил Кониман. Кто-нибудь держал в руках его книжку? Не, ну очень немногие люди это нормально, потому что это слегка другой мир. Это не айтишный мир. Это дяденька, который занимался по большей части психологии. И в 2002 году ему дали Нобелевскую премию по экономике за то, что он там поломал теорию предыдущего Нобелевского лауреата по экономике. Просто за счёт того, что он упирал на нелогичность и рациональность живых людей. Так вот, согласно а модели мышления Канимана, он очень много этим занимался, очень много проводил экспериментов над живыми людьми. А согласно его модели, мышление наше нашего наше мышление живого человека устроено следующим образом. Там есть две системы. По нашему это фронт и бэкэнд, да? Он их называет система один и система два. Быстрое мышление и медленное мышление. А любая информация, которая входит в мозг, она по умолчанию попадает в систему один. Система один быстро, автоматом и практически, энергетически бесплатно вырабатывает кандидат решения, как это по-нашему достаёт из КШ ответ. Да. И выдаёт этот ответ на рецензию системе 2. Система 2 может заменить этот ответ, а может не заменять этот ответ и выпускает наружу к этому мясу на костях, чтобы оно шевелилось и что-то делало. Ну там читала статьи на Хабре и так далее. А система один она такая наивная, глуповатая, но работает быстро и энергетически бесплатно. А система два она такая ленивая, медленная, энергозатратная. И думать ей на самом деле неприятно и больно. Вот большинству людей думать неприятно. Сейчас чуть-чуть я вам это просто явным образом покажу. Поэтому так мало людей это делают, кстати. А, но слава богу, мы не можем думать долго. Это как будто бы, знаете, а у нас есть маленький бочочек с мыслетопливом, некоторый такой ресурс, который пока есть, мы думать можем, он закончился, всё, система 2 не работает, мы работаем только на быстром мышлении, только вот на этих быстрых автоматических реакциях. Всё. Вот, вот примерно так мы устроены. Давайте сейчас я покажу вам маленькую дурацкую задачу. Каниман со своим коллегой, он очень часто использовал подобного рода задачи в опытах над живыми людьми. А просто, как у вас будет рождаться в вашей главе ответ на эту задачу. Многие, наверное, видели подобного рода задачи где-нибудь на собеседованиях, ещё где-то. Просто посмотрите. Задача старая. Я думаю, что много кто даже имеет закашированный ответ на неё. Бейсбольный мячик, сбитый стоит 1 доллар 10 центов. Бейсбольная бита дороже мяча на 1 доллар. Сколько? Стоит мяч. Закшированный ответ. Кто первый подумал про 10 центов? Это нормально. Кто понял, что это неправильный ответ? Кто посчитал правильный ответ? Вы чувствовали перед тем, как начать считать правильный ответ, такой вот неприятный порожек начала мышления? Перечитать и понять. Перечитать, пересчитать и понять. Вот как как это выглядит. Нам входит сюда в мозг вопрос: \"Сколько стоит мячик?\" Система один быстрая автоматом говорит: \"10 центов\". Дальше, если вы ещё не сильно устали, система 2 может сказать: \"Не-не, не, стой\", думать надо. Дальше вы чувствуете: \"А мерзко думать, да хрен с ним, давайте подумаю\". Вы начинаете думать, и, скорее всего, если вы подумали и подумали по правильному пути, вы вычислили ответ 5 минутов. Вот примерно так вот наше мышление устроено. Давайте я покажу ещё менее человечный эксперимент, который покажет вам ещё очень интересный аспект нашего мышления, очень интересную особенность. А я сейчас буду вам показывать шесть цифр на 2 секунды. Я их покажу, уберу и прошу под мою отмажку вслух называйте цифру одну за одной 2че. Ну и так далее. Да, всё, по идее, должно быть просто для взрослых людей. Давайте попробуем. Вот давайте попробуем. Смотрите. Эть. 6 5 7 5 7 Не торопитесь, не торопитесь. Мы везде успеем. Давайте ещё разок попробуем. Не спеша. 5 2 7 3 1 2 Хорошо, дайте ещё разок. Смотрите, сейчас будут новые цифрки. Ещё раз. Раз. 2 4 3 7 8 5 легко даётся. Чуть-чуть усложним задачку. Мы теперь будем вслух говорить циферку плюстри. Взрослым людям это на самом деле тоже труда не должно составить. То есть мы запоминаем шесть цифр и вслух говорим результат цифры плюс три. Ну если было два, говорим пять, было девять, говорим 12. Ничего особенного. Давайте попробуем. Готовы? Теть. Наверное, были не готовы. Давайте ещё разок попробуем. Подождите. Ну вот ещё разок. Ещё разок. Я показываю шесть цифр. На 2 секунды убираю. Вы под мою отмажку говорите результат цифры плюст три. Давайте попробуем. А 7 6 11 Тяжело. Кому было больно? В мозг. Да, да, да, это боль. Я же говорю, думать больно. Поэтому, когда вас просят это сделать, ну, вы поняли, а, смотрите, почему такое происходит. А в нашей голове у нас есть ещё одна такая штучка, называется рабочая память. И вот когда нам проектировали рабочую память, нам её всунули и её почему-то запитали из того же самого бочка, в смыслетопливом. Архитектура такая типа, да. Вот мы типа сейчас отрелизим, а там отрефакторим. Ну вот, как обычно, вот айтишники это так делают. А в итоге к чему это приводит? По большому счёту мы с вами можем либо думать, либо помнить. Первое упражнение нам даётся очень легко, потому что нам надо только запомнить цифры. Нам не надо думать. Во втором упражнении, где мы прибавляли плюст, нам надо и помнить, и думать. Одновременно эти две задачи мы не приспособлены решать. Это я к чему говорю. Например, обычная бытовая ситуация, когда вы сидите, работаете, никого не трогаете, к вам приходит коллега и говорит: \"Слушай, сделай мне вот эту фигню\". Ты говоришь: \"Да-да, да, я запомнил\". Вы поделили свою способность мыслить в этот момент пополам. Когда другой коллега приходит, говорит: \"А мне вот эту штуку\". Ты говоришь: \"Дада, да, я тебя запомню\". Вы поделили остаток ещё разок наполам. Стоит вам запомнить буквально четыре штуки и всё, что вы можете делать своим мышлением, это помнить. Ну так вот мы устроены прекрасно. И поменять мы это не можем. Мы можем только к этому приспособиться. То есть, а чего у нас с вами в голове есть? У нас с вами есть мозг. Причём мозг, смотрите, он не может много думать. Мысли топлива - это ценный, ограниченный ресурс. А у нас есть память, которая работает очень криво. У нас есть рабочая память, которая мешает думать. У нас, конечно, есть ещё и долговременная память, которая тоже не без косяков. Вот, чтобы показать косяки долговременной памяти, просто прочитайте вот эти слова, да? Я не прошу их запомнить, но постарайтесь, если сможете. Я понимаю, что это невозможно, и вы уже понимаете, какой косяк у нас долговременной памяти. Конфета, кислый сахар, горький, хороший вкус, зуб, славный мёд, газировка, шоколад, сердце, торт, съесть, пирог. Хорошие слова, да? Ну, вы поняли, что самый главный косяк с рабочей, с долговременной памятью, вы в неё хрень что запишите. Поэтому я даже не буду пытаться попросить вас воспроизвести этот список. Это невозможно. Скорее всего, крайне маловероятно, что здесь находится такой мутант, который сможет всё-таки это сделать. Ну просто науке известны такие случаи феноменальной памяти. Ну там тоже со своими косяками. Поэтому, скорее всего, никто не запомнил. Но а чтобы показать ещё один маленький косячок нашей памяти, смотрите, а подойдём с другой стороны к задаче. Кто из вас помнит слово вкус? Так, не все, да? Кто помнит слово смысл? Кто помнит слово сладкий? Кто-то помнит. Хорошо. Ну, о'кей. А на самом деле, как вы понимаете, у памяти вот какая засада. А ты туда что-то записываешь, но не факт, что ты это потом оттуда считаешь. Причём, а в отличие от компьютерной памяти, куда я могу просто обратиться к какой-то конкретной ячейке памяти, к своей человеческой памяти, я не могу так, там нет системы адресации, там всё чуть-чуть по-другому и более хитрожопо устроено, не получится. Мало того, а экспериментальной психологии известны очень прекрасные эксперименты о том, как взрослым людям подделают воспоминания. И очень прекрасно подделываются воспоминания о детстве, о каких-то таких эмоциональных событиях из детства. старые воспоминания. Самый громкий эксперимент был о том, как взрослые люди вызывались на интервью, и они рассказывали о том, как в детстве во время поездки в Disсneленд они фотографировались с Баксбани. Многие люди описывали во всех подробностях, какой он был маленький, какой он был мягкий или как они сначала его испугались, или как ещё что-то с ним такое происходило. Но вы понимаете, что Баксбани в Диснейленде не водится. Ну просто это агент конкурирующей компании, мягко говоря. Это вот собственность Warner Brothers, и она никогда не была и никогда, скорее всего, не будет в Диснейленде. Но люди были с пены у рта готовы доказывать, что ровно так и было, как они сейчас описывают все вот эти впечатления от фотографий из Баксбани. Это было прекрасно. Есть ещё масса других интересных экспериментов, которые показывают ущербность нашей памяти. Кто помнит слово вкус? Так. Слово сладкий, кто помнит? Так. А пирог кто помнит? Не было пирага. Был. А, хорошо. Сладкий. Кто помнит ещё раз? Сладкий. А вкус кто помнит? Где слово сладкий? Фак. Я подделал вам память. Чувствуете? Да. А смотрите, как устроен. Давайте отмотаю назад по-честному. Где здесь слово сладкий? Славный, сладкое вокруг. То есть, а как работает наша память? Вот, скажем, а если бы я был бы флешкой, была бы у меня в башке флешка и у меня где-то образовался битый сектор. Когда я по адресу обращаюсь к битому сектору, мне говорят: \"Хозяина, фоторварь, нету данных\". Наш мозг так не умеет. Он не говорит об этом. Если где-то вдруг что-то данные продолбались, мозг думает: \"Угу, хозяин просит воспоминания из этой ячеечки\". Так, а что там у нас рядышком хранится? О, вот это, а, наверное, там вот должно быть храниться что-то вроде этого. И выдаёт это наружу без всяких эксепшенов. И мы это вспоминаем, как будто это наше воспоминание. Всё прекрасно. Ну, вы поняли. Буквально там вот пару раз показать картинку у взрослых людей чуть-чуть поделались воспоминания. Причём, а, в экспериментальной психологии описаны очень хорошо эксперименты, как буквально в домашних условиях можно проделать то же самое со своим руководителем. Ну, это отдельная тема. Вот вот этот эксперимент я вытащил из книжки Леонарда Младинова. Это вот одна из тех книжек, которая была в той самой пачке. Там есть очень много ещё чего интересного про то, насколько вообще глючная наша башка и как много творится того, чего мы просто не осознаём. И вот это вот всё, оно управляет тем, что с нами происходит и как мы живём, и как мы действуем. Это очень прекрасно. А чтобы нажить себе комплексы неполноценности, можете прочитать эту книгу. А, здорово. А ещё чего из особенностей нашего мышления мне бы хотелось вам отметить. А вы, наверное, заметили, когда я показывал вам задачу про бейзбольный мячик, что думать не очень приятно. Как минимум процесс запуска мышления не очень приятный процесс. И вот ещё в чём западло. Он иногда непроизвольный. То есть далеко не мы, не всегда мы решаем, над чем надо думать, на что надо направлять это бесценное и ограниченное мыслитопливо. И чтобы ещё разок там показать ещё одну маленькую особенность, давайте ещё раз попробуем вот это, помните, да, ужасное упражнение плюстри, но там будет всего четыре цифры. Четыре цифры. Шесть цифр реально это на пределе возможности взрослого человека. Четыре цифры, по идее, ну, посмотрим. Четыре цифры должно даться легко. Готовы? Я показываю сейчас на 2 секунды четыре цифры, убираю их, и вы под мою отмажку называете результат цифры плюст. Давайте попробуем. Ага. Ещё раз. Да, я удивился. Вы увидели цифры? Да. Ати. Это особенность айтишной конференции. Там ещё были женщины. Вы знаете, как женщины выглядят? Вообще это почти как цифра, только иногда симпатичней. Ну о'кей. А это я бы почему вам показывал, да? У нас есть такая штучка прожектор внимание. Это вот такой лучик сознания, который направляется на объект от объекта к объекту, чтобы мы могли его воспринимать. И не мы управляем этим лучиком. Ох, не мы управляем. И мы можем, конечно, произвольно на некоторый период этот лучик куда-то оттянуть, но не так, чтобы уж надолго. Вот так вот мы ужасно устроены. И вот эту вот всю штуку, вот эти наши все особенности, мы ничего с ними не можем сделать. Мы можем только к ним приспособиться. Можно, на самом деле, чуть-чуть поиграться с этими пунктами, там, поразвивать свой мозг, мышление и так далее, и так далее. Но не раньше, чем мы научимся использовать себя такими, какие мы есть. И чтобы научиться приспособиться вот к этому всему, а, нужно понять самое первое уравнение доведённых дел до конца. А вот это уравнение доведения дел до конца выглядит следующим образом. А когда задача превращается в решение, когда мы делаем какое-то дело, нам на самом деле нужно много чего. Большинство людей считают, что нам нужно время. Вот. Но помимо времени нам нужно ещё вот это самое мыслитопливо. И нам нужно ещё вот какой-то метафизический ресурс, типа там желание, драйв и так далее, и так далее. Я думаю, многие из вас замечали, что вы часто оказываетесь в ситуации, когда время есть, а думать нечем. И вот у тебя взгляд сквозь монитор такой идёт и слюнки капают на стол. Да, знакомое состояние. Вот. И при этом, при всём при этом, как только мы чего-то начинаем не успевать, мы идём в Google и сказать: \"Таймменеджмент, управление времени\". Времени, на самом деле, как вот говорит Матроскин, у нас достаточно. И в подавляющем числе случаев то, что нас ограничивает, то, чего нам не хватает для того, чтобы всё успевать, ну или, по крайней мере, вс всё равно всё успеть нельзя, а чтобы делать то, что мы хотим делать, нам не хватает мысле топлива в каких-то особо клиничных случаях. Нам не хватает ещё желания и драйва. Ну, это вот в фильме было как это, как хотят мужчины. Иногда я начинаю хотеть чего-то хотеть. Это не кризис, это Ну вот там, помните этот момент. Вот в большинстве случаев, да, если это не пишедец, тогда нам не хватает мысли топлива. Времени в большинстве случаев у нас дофигище. И вот эта вот ошибка в том, что если мы что-то не успеваем и нам надо экономить время, она очень дорого нам обходится, к сожалению. А чтобы экономить время, есть такой вот цикл обезьянского, да. Он вам показывает, тонко намекает, что на самом деле, а избавиться от обезьяны не то, чтобы нельзя, нужно научиться с ней жить. И всё успевать и экономить мысли топливо помогает вот следованием вот этому циклу обезьянского дао. Нам нужно обязательно сначала думать. Думать находится на стороне человека. Мы думаем, понимаем, что нужно сделать. Пополняем списочек задачек. Дальше сознательная наша часть отрубается. Всё, на это сил больше не хватает. Приходит время обезьяны, мы это делаем. Дальше мы проверяем источники входящих, все наши там фейсбучики, нефейсбучики, аутlлук и прочие наркоманство. Опять думаем, пополняем списки задач, делаем. Вот такой вот цикл обезьянского, да, вот цикл здорового человека выглядит плюс-минус так. И я чуть-чуть ещё расскажу о некоторых патологиях этого цикла. А я ещё вам хотел рассказать буквально три таких низковисях фрукта. Это три таких маленьких, а, приёма, которые можно выполнить сразу и ощутить прилив сил, бодрости и жизненной энергии. Самое первое - это отключить уведомления. Вот эти стелки, перделки, напоминалки и прочая срань, которая рвётся к нам в мозг из нашего кармана или из аутлука. А, буквально маленькая зарисовочка. А если мы пустим в свой мозг слишком много уведомлений, а мы можем попасть в ситуацию, когда обезьяна начинает расставлять приоритет. Обезьяный приоритет выглядит как вот вы сидите, пытаетесь работать, и тут вот такой, знаете, в верхнем правом углу у кого включено уведомление на рабочем компьютере о входящей новой почте. Во, это обязательно. Как только вот эта штука появляется на экране, многие себя обманывают, говорят: \"Я их не замечаю\". Замечаете? А ваша обезьянка тут же тянет руки к рулю. Она как только что-то увидела, что-то поменялось, надо тут же пойти рулить. А сознательная наша часть может иногда спросить: \"Обезьяна, а ты уверена, что это самая важная задача, которую нам надо делать?\" Вы понимаете, что это самый умный вопрос, который только можно задавать обезьяне. Обезьяна на подобный вопрос всегда отвечает одинаково. Это самая важная задача из тех, которые я помнл. Она ничего не способна помнить. Поэтому среди той одной задачи, которая вот она сейчас помнит, эта задача самая важная, конечно же. И если у нас этих уведомлений достаточно много, то цикл обезьянского Дао коротится, и наступает вот это вот короткое замыкание через обезьяну. Мы смотрим, что пришло, делаем, смотрим, что пришло, делаем, смотрим, что пришло, делаем. Потом бац, сознательность. А надо же писать списки задач и расставлять приоритет. Мы пишем список задач, потом хдыщ, следующее уведомление прилетает, мы начинаем читать, писать, делать, писать, делать. Точнее, читать, делать, читать, делать, читать, делать. Потом смотрим. Я же вроде написал список задач и ничего из него не сделал. ваш список задач он не работает. Ну и всё. Вот это называется короткое замыкание через обезьяну. И вот этих уведомлений их реально дофигище сейчас. Сейчас современный мир, он устроен таким образом, что уже буквально в открытую торгуют нашим с вами вниманием. Есть биржи. Биржи, которые за ваше внимание, за право показать вам баннер и насрать в мост получают деньги. И поэтому не удивляйтесь, сейчас вот это вот количество всех этих мобильных приложений, которые пытаются обратить на себя ваше внимание, чтобы потом продать его, он велико. Это ужасно. Это кошмар. Жить, на самом деле, с этими уведомлялками невозможно. Поэтому просто, как это, попробуйте сделать следующее. А если не доверяете многие вещи, даже не пытайтесь сказать: \"М, я подумаю над этим. Может быть, это имеет смысл\". Думать мы это не можем. Мы можем подобные вещи узнать, работают они или нет, только на практике. Попробуйте сделать следующее. Берёте блокнотик, берёте свой смартфон и по очереди все программки. Вырубаете уведомления у них, записываете название программки, вырубаете у следующей, записывайте название программки. Записывать название программки нужно на тот случай, если вам вдруг не понравится жить с незагаженным мозгом. Вы тогда по списку включите их обратно через недельку, не на следующий день, потому что на следующий день вас ждёт дофаминовая ломка. Вот эти вот уведомления, они вырабатывают каждый раз, когда что-то такое появляется на горизонте нашего мозга, в нашем мозге вырабатывается гормон дофамин, и мы начинаем зависеть от него как от наркотика. Первое время у вас будет ломка. Это суета, беспокойство и прочие, прочие неприятные вещи. Перетерпите пару-тройку дней, и дальше вы увидите, насколько проще станет жить. Это вот первый самый низковисящий фрукт. Второй низковисящий фрукт - это переформулировать свой список задачек. Это вот один из очень важных моментов, которые почему-то недооценивают. А есть ряд правил достаточно жёстких, как надо А у кого вообще есть свой список задачек? А у кого их много? А у кого их два? Ну вот. два списка задач, вот три и три - это прекрасно. Вот если их больше одного, скорее всего, они уже не работают. Но даже если он у вас только один, скорее всего, он тоже не работает, если там задачки не сформулированы для обезьяны, потому что список задач- инструмент обезьяны. А и каждая задача есть четыре волшебных правила. Каждая формулировка должна ему удовлетворять. Каждая задача должна прямо вот, знаете, с упорством джирафашиста. Она должна звучать как ответ на вопрос, что надо сделать. содержать глагол в начальной форме, он же будет сказуемым, содержать необходимые дополнения, быть выполнимы с минимально возможным использованием мозга. И формулировка этой задачи должна быть должна совпадать с непосредственно следующим шагом и быть понятной даже обезьяне. Вот это реально очень важно. И чтобы ощутить, насколько вот это вот облегчает нам жизнь. А кто уже так пробовал? Кто насмотрел с моих видосов и так пробовал? Кому не понравилось из вас? А, всё. А кому понравилось? А, а вам не понравилось, да? Просто в какой-то момент сформулированной задачи, в общемто занимала достаточное количество времени. Дада. Да, это тараканы. Это вот бывает такое, потому что помните, да, если нас ограничивает время, нам надо экономить время. Если нас ограничивает мысли топлива, нам надо экономить мысли топлива. Даже это если стоит дополнительных затрат во времени. Ну это отдельная тема. Смотрите, вот к чему приводит недоформулированность задач. Я покажу вам буквально две патологии списков задач. А самая такая популярная - это а список задач, который содержит повышенную концентрацию прокрастиногенов. Прокрастиногены, чтобы вы понимали. А вы чувствуете, как уже захотелось завтра, потом не время. Да, есть такое уже. Вот эти вот формулировочки, вот эти вот глаголы, подумать, проанализировать, изучить, определить, они прокрестиногены. Они вызывают такое подсознательное желание, такой: \"Блин, оно всё, конечно, важное, творческое. Я очень люблю эти задачи. Они так меня развивают. Сейчас надо с мелочью быстро разобраться, но чтобы ничто не отвлекало\". Мы быстро разбираемся с мелочью, потому что нас рационально поддерживают. Да, конечно, давай быстро с мелочью разбираемся. Мы разбираемся с мелочью. На мелочи заканчивается мозг завтра. На следующий день опять приходишь, думаешь: \"Да, надо вот там придумать, проанализировать, изучить новую технологию\". Я собрал: \"Да, да, да, да, конечно, надо взять и изучить новую технологию. Я люблю изучать новые технологии. Я уволился с той работы, пришёл на эту, потому что здесь можно всё это изучать и анализировать\". Сейчас я быстро с мелочью разберусь, чтобы ничего не отвлекало. Итак полгода, да, пока человек не психонёт, скажет: \"У вас здесь одна рутина\" и не уволится. Это же самая такая правильная стратегия. Самому себе затрахать мозг, психануть и уволиться, обвинив во всём руководство. Ну, бывает. Это вот первая такая патология. Есть ещё хорошая патология. А кто ведёт в аутлуке список задачек? В аутлуке? Кто любит галочки на письмах ставить? Не, не, не, нет. У кого так? Да, вот есть сейчас мир так устроен, что подавляющее число фич, а, в инструментах по самоорганизации, она контрпродуктивная. Они сделаны так, чтобы вы успевали меньше. И одна из самых вредительских фич - это поставить флажочек в аутлоке или там галочку где-то на письме, типа письмо, надо что-то сделать. А что надо сделать? А потом подумаю, херак галочку. Вот. И в итоге люди, которые злоупотребляют флажочками, у них список задач примерно такой. И при этом, когда ты рядом с ними садишься и говоришь: \"Ну и что надо делать?\" Они говорят: \"Нет, тут же всё понятно, что надо делать\". Рациональные части нашего мозга понятно, но со списком задач обычно работает обезьянка, ей непонятно. И она работает как такой, знаете, очень хреново написанный код, как будто там есть это трайкэчи, в кэтче пусто. Вот, знаете, как прекрасно. Отлаживали такой код или сами пишите? Ну, правильно, на обработку исключения нет времени. На это нет времени. Вот примерно так же работает наш мозг. А обезьяна такая суете, так мобильный телефон. Так, я не помню, что-то это не помню. Так, это надо что-то, наверное, важное. Важное, значит, надо подумать. Если надо подумать, сейчас я быстро с мелочью разберусь. Потом. Ну и так всё. Потом, потом, потом, потом. И она делает в итоге всё самое только понятное. То, что непонятно, оно оставляется на подумать, когда будет время. То есть никогда. И поэтому вот список задач человека, который любит отмечать галочками письма, он выглядит вот так вот. Они все на сегодня, потому что они очень важные и все красные, потому что месяца два как просрочены. Вот. Ну так устроен мир. А у меня есть форум, и там одна очень хорошая девочка, она сформулировала, я бы, наверное, лучше не смог сформулировать то вот это вот правило, как надо формулировать задачи. Она написала, что иногда помогает представить, что я рассказываю последовательность действий не очень умной девочки, служанки, как вот в унесённых ветром. Это девочковый фильм такой, если кто не знает, я не смотрел просто. Вот там была девочканегретянка. Кто смотрел этот фильм? Есть айтишники. А книжку, ну вот там говорят была девочка-негретянка. И вот она это опубликовала ещё до того, как я вывалил в паблик запись вебинара с обезьяной, где я пересказывал Тиму Урбана. Мне показалось этого прямо шикарно. Лучше не объяснить, потому что когда мы делаем задачи, у нас половина сознательного мозга вырубилась. Или будем говорить по-другому, большую часть времени мы находимся в состоянии, когда нам мозга недостаточно. Давайте подготовим себе пищу, подсказки, что мы будем делать в таком состоянии, потому что в этом состоянии мы пребываем большую часть жизни. Есть третий и последний низковесящий фрукт. Если вы вдруг осилите, выключить уведомление и переформулируете список задачек, вы сможете двинуться чуть дальше. А, в поисках ответа на вопрос, как всё успевать. Кто хочет узнать, как всё успевать? Это просто это на самом деле, а всё успевать, а так же, как жрать всё подряд и не толстеть, примерно так же, как спать 3 часа и не хотеть убивать. И выходить всегда в притык ко времени и везде успевать. Вот. То есть никак. Ну, вы понимаете, никак. И попытка всё же всё-таки успеть, она обречена на провал, потому что есть законы, законы природы, они жестокие и справедливы. Их нельзя обмануть так же, как законы физики, как закон гравитации. Есть законы впихивания. Вы знаете эту обезьяну? Вот кто-то, наверное, помнит эту обезьяну. Я рассказывал там, в общем, обезьяно бильярдный шар. Была хорошая притча такая философская. А законы впихивания, есть два закона впихивания. Первый закон впихивания говорит, что при попытке впихнуть невпихуемое выпихивается ранее впихнутое. Это первый закон впихивания. Но есть ещё более жестокий второй закон впихивания. Второй закон впихивания говорит, что ещё при всём при этом снижается предел впихуемости. То есть наш список задач утрачивает свойства впихуимизации. И он не впихуимизирован. А, смотрите, что такое снижается в предел впихуемости. Вот если я могу теоретически сделать 10 задачек и мне дают восемь задачек, я сделаю, ну, восемь, правда же, да? Если я могу сделать 10, мне дают 10, ну, я сделаю 10. А если мне дают 10, я могу сделать 10, а мне дают 12, я сделаю восемь. Ну, мне надо же подумать, над какими задачами надо думать. Об этом тоже надо думать. Если в меня впихают 20, я сделаю 14 тамшесть. Впихают 30, сделают три. Впихают 40, вообще ничего делать не буду. Ну потому что мне надо приоритизировать, планировать и писать обоснование, почему я ничего не сделал. Ну я думаю, все, кто работают в более-менее кровавом энтерпрайзе, об этом уже сталкивались. Вот там как это предел впихуемости снижен до безобразия. И поэтому, когда нам приходится, вот когда мы сталкиваемся с вопросом: \"А как всё успевать? У меня вот мимо в интернетах проходила вот эта картинка. Понимаете, что в какой-то момент, скорее раньше, чем позже, вам придётся вот так говорить. И надо понимать, чему так говорить можно, а чему так говорить нельзя. К сожалению, не знаю, кто автор вот этой фразы. очень бы с радостью на него сослался, но, ну, потому что опять же нельзя было более круто сформулировать вот всю эту проблемную область. А наша жизнь устроена так, что чем дальше, тем больше у нас будет расти количество наших входящих, впихивающихся в нас информации. Куча всего, всего всего вот такого вот ужасного. Сейчас же мы, когда начальника ставим в копию своего письма, мы думаем, что мы ему делаем одолжение, что мы делаем что-то полезное. Ни хрена. Мы наносим ему ущерб. Мы, к сожалению, пока этого не осознаём. У нас уже переизбыток информации в какой-то момент. И для кого-то вот уже, скорее всего, наступил. Люди не способны обработать всё. А вот эти вот идеи, входящие мысли, фантазии - это те штуки, которые через задачи, переродясь в задачи, потом будут вести нас к тем вещам, которые мы хотим. У нас, с другой стороны, будут вещи наши цели, то, что мы хотим от жизни. Ну, типа так вот, как люди. Ну, помимо этого будете знать ещё такие вещи, которые типа вам нужно хотеть. Ну, так общество решило, что люди вашего формата хотят ещё такого. Вы этого не хотите, но вами уже это хотят. Есть другие вещи, которые вами напрямую хотят. Есть куча всякой херни, которая тоже почему-то вот там вам в цели затисалась. А и вот соответствие между одного другим, ну, такое уже получается, ну, явно не очевидное с самого начала. И понимаете, что при условии, что вы не можете обработать вот это вот всё или выполнить все задачи, которые вылезают из этих идей и входящих, вам придётся что-то выкидывать. И чтобы понять, что выкидывать, надо понять, чем вы готовы пожертвовать. Готовы ли вы пожертвовать тем, что вы хотите вы или тем, что хотят от вас или прочей хренью. Ну, как правило, хренью никто жертвовать не хочет. Она же прикольно. А есть очень хороший вопрос, который помогает немножко вот этот ребус распутать. Вопрос простой, чтобы что? Если у вас задачка уже вроде как выродилась, вы её сформулировали как задачку, вы берёте и спрашиваете себя: \"Хм, чтобы что?\" И скорее всего за несколько таких вопросов, чтобы что? Чтобы что? Чтобы что, вы приходите и понимаете, это вообще хрень, не хрень, ваша хотелка, не ваша хотелка, что это такое. И в какой-то момент, когда более-менее сознание у вас утекнет, вы сможете искать вот что же ведёт к тем сердечкам, которые бы вы хотели достичь. И просто вы можете, когда у вас будет актуальный, хорошо сформулированный список задач и выключенные уведомления, потому что пока она включена, вы вообще думать головой не можете, а вы сможете с одной стороны себя положить свой списочек задачек, а с другой стороны положить список хотелок и использовать силу вот этой цепочки, чтобы что, и посмотреть, какие из этих задачек за какое-то разумное число, чтобы что утыкаются ваши хотелки, а какие задачи не утыкаются На самом деле очень большой пласт задачек, а они не будут никаким хотелкам вас вести. Это, конечно же, ни в коем случае не повод их выкинуть, как многие могут наивно подумать: \"А это не ведёт меня ни к каким целям, надо это выкинуть нахрен\". Нет, но это повод подумать, не выкинуть ли их нахрен. Потому что на самом деле, если посмотреть правде в глаза, а не только у меня, но и у многих людей, ну вот за себя я просто с уверенностью скажу, что большую часть времени своей сознательной жизни, большую часть своей сознательной жизни я зарабатывал и наслаждаясь занимался теми вещами, которые выродились из задачи, имевшей в самом начале ответ на вопрос, чтобы что? А хрен его знает, да? Вот вот а хрен его знает. Ну и потом из этого вылезает дело, по крайней мере, там куска сознательной жизни. Это нормально. Это такое случается очень часто. Поэтому вот то, что не ведёт напрямую к тем хотелкам, которые вы хотите прямо сейчас, это не повод их выкидывать, но это повод подумать об этом, не выкинуть ли их. Если что-то там есть прикольное, ну, попробуйте. А с другой стороны, окажутся какой-то пластый кучка хотелок, которым ничего не ведёт. И здесь опять же, да, ну, вы, наверное, знаете, что делать. Если не знаете, что делать, есть закон хомячка. Он примерно так же жесток, как и закон впихуемости. Ну нет, это по жестокости закон, конкурирующий с законом опихуемости. Кто не роет, у того нет норки. Если вы роите, это не гарантирует вам норки, конечно же, но если вы не роите, это гарантирует её отсутствие. Это прекрасно. И поэтому тоже подумать, да, если есть какие-то хотелки, вы к ним ничего не делаете. Ну, а вы можете прямо сейчас что-то делегировать своей обезьяне, написать списочек такого мелкого чего-нибудь, что вот там за 15 минуток можно было сделать, чтобы вот хоть чуточку приблизиться к этой хотелке. Пусть неэффективно, пусть это будет непровное продвижение, но хоть чуть-чуть к ней поближе к этой хотелке, к реализации подвинуться. Можете? Если можете, возьмите, запишите, делегируйте обезьянки. Вот и всё. Это вот такой третий очень такой эффективный, низковисящий фрукт. Значит, помните, первый отключить уведомление. Ваше внимание - это валюта, которую вы, если цените, хорошо. Но если вы не цените, поверьте, существует огромное количество разработчиков мобильных приложений и не только, которые ценят ваше внимание, скорее всего, больше, чем это делаете вы. А переформулируйте содержимое списка задач. Это про вот силу правильных формулировок её нельзя недооценить. Реально, я знаю случаи, и их очень много. А когда от правильных слов, правильно подобранных слов формулировки задач время сокращалось выполнение этой задачи с месяцев до часов. Это как будто этот прямой скан заменили на индексированный поиск. Приколитесь, чуваки, какие слова я знаю. Вот. И используйте вопрос, силу волшебного вопроса, чтобы что? Чтобы впихуимизировать список задач. Если в какой-то момент вам всё-таки вы понимаете, что всё, вот это вы сделать не можете и вам надо что-то выкидывать, ну, наверное, надо выкидывать то, что для вас не очень важно, как бы это очевидным не было. А чтобы понять, что важно, вам всё-таки надо понять, что вы хотите, и научиться задавать вопрос, что бы что. Ну и там есть совсем последняя такая картинка. А это не сектантство, да, но тем не менее вот мне просто нравится некоторое положение буддизма, к сожалению. Сейчас или к счастью а я начал очень серьёзно этими вещами заниматься. Ну потому что это культура, которая достаточно много, там уже больше 2.000 лет, учит людей работать со своим умом. Они много чего достигли. И мне нравится то, что лежит у них в основе учения, что многие вещи мы не способны понять концептуально или бог с ним может быть и способный, но этого понимания нам недостаточно. И нам нужна убеждённость, которая будет происходить из нашего собственного опыта. Чтобы понять, работает какая-то вещь или не работает, есть единственный правильный способ. Если эта штука на практике стоит недорого, ну, её попробовать вообще бесплатно, как отключение уведомлений, и при этом она не вызывает наркотической зависимости, не надо пытаться рационализировать и думать, это на мне поможет, не поможет, это окупится, не окупится, просто попробуйте. поможет, оставите, не поможет, выкинете. Это основа практики. И как на практике я понял, что многие вещи можно понять только на практике, как бы вот концептуально не пытались их чётко объяснить. А если всё равно непонятно, что делать дальше, я подготовил маленькую такую статеечку. Там собраны ссылочки на вебинары, видосики, статейки, шаблончики, всякие про прочую хрень, которая помогает сделать первые шажочки, что-нибудь такое сделать, чтобы продвинуться вот по этой лесенке джеификации, как-то разгрузить свой мозг и научиться делать чуть больше тех вещей, которые вы бы хотели делать. Вот. Я думаю, что это пока всё, что я хотел рассказать. И, наверное, меня можно спросить. Сейчас будут ходить с микрофонами. Да, Максим, спасибо за доклад. Было очень интересно, но вот есть сразу вопрос. Вот человек привык там ходить на YouTube, там ещё что-то делать. Дисциплина же нужна, чтобы начать поменять поменять своё поведение. какие-то, может, советы дашь там, а как сделать первый шаг в переходе вот это к этой системе, как с для себя или для своих подчинённых? А, ну меня интересует прежде всего сейчас для себя, но но дальше, наверное, будет понятно уже, как делать это для других, да? Вот просто менять других людей, это оченьоченьочень тяжело. Себя хрен изменишь, это очень тяжёлый момент. Но самая первая вещь, а здесь надо научиться следить за собой. Помните вот эту картинку замыкание через обезьяну? Когда думаешь: \"О, надо мне для работы что-то погуглить, одно неосторожное движение, мышкой и ты на час залип\". Знакома, да, ситуация? Надо аккуратно следить за собой, потому что нам всегда нужен запас мысле топлива, чтобы себя оттуда вынуть. Если у вас мыслитопливо кончилось, а вы находитесь на Ютюбе, шансов, что вы оттуда выйдете, практически никаких. Вы залипнете, пока по тайм-ауту не отшибёт. Ну, просто спать не захочется или в сортир, ещё что-нибудь. Вот спасительное ощущение, что хочу в туалет. Вот оно меня спасло от залипания. Поэтому как, а, делать вовремя передышечки очень хорошо. Ну и тренировать осознанно слушать себя. Вот я сейчас не залипну или залипну или раз у меня рука тянется туда вот на эту ссылочку, думаю: \"Так, обезьяна, это ты что ли?\" Она говорит: \"Дада, ладно, обезьяна, давай потом\". Да. И ещё один очень важный момент быть поласкивой с обезьяной. На неё нельзя орать. То есть, если вы вдруг себя заметили на Ютбе, что вы уже там второй час ковыряетесь, хотя просто хотели погуглить очень простую вещь, а во второй час смотрите видосики на Ютбе, ну это не надо себе говорить: \"Ах ты там безвольно и всё такое\". Надо сказать: \"Ах ты ж, блин, обезьяна. Ну что ж ты так? Ну ладно, в следующий раз, когда будешь ходить в YouTube, попроси меня таймер поставить\". Просто вы берёте себе таймер на 15 минут, да? Вам хочется в YouTube, как вот есть курильщики, им хочется курить. Это примерно то же самое наркоманство, да, смотреть ролики на Ютубе, думать: \"Хочется посмотреть ролик на Ютбе, поставьте на 15 минут будильничек, он поможет вам вернуться обратно в наш мир неютбный\". Вот эти штуки помогают. Ну, ещё есть масса исследований, которые показывают, что а сила воли, вот это вот, оно уже коррелирует в смысле топливом. И это примерно та же самая штука, которая позволяет вам самого себя вынуть из Ютюба. Она очень хорошо коррелирует с теми вещами, с той же силой воли, которая нужна при выполнении физических упражнений. Вот поэтому можно ходить в качалку, тренироваться, это чуть-чуть будет укреплять силу воли, но непосредственно после тренировки вы это прекрасно можете ощутить. У вас будет вот этот волевой центр угнетён, то есть вам будет намного проще залипнуть в Ютбе. Вот так вот. Макс, такой вопрос. А я здесь. Я посмотрел доклад Максима Дорофеева, и это взрывает мозг. Вот. И я понимаю, что мне хочется скорее скорее записать все свои задачки в список, да, но я не так прост. Я понимаю, что их количество будет на меня давить, и поэтому надо только первый шаг записать. Я себе ставлю задачку м ну что сделать, нарисовать майндмпу из того, что нужно переделать. Ну и тут вот надежда на то, что я успею её в 15 минут, нет. Соответственно, обезьяна эту задачу всегда будет отскладывать. Как её сформулировать? Потому что вот такие задачи, которые требуют, ну, много затрат мозга, будут, да, нарисовать, хорошая идея, да? Ну вот, вот как быть, да, у нас будут вот я показывал эти задачи про крестиногены, они всегда будут, потому что у нас в работе есть творческая составляющая, творческая работа, где-то подумать, поштормить. А я для себя такой трюк нашёл. Просто здесь вот у каждого своя обезьяна, а, и чуть-чуть подходы будут у каждого свои. Надо смело экспериментировать над собой. Я себе пишу: \"Потупить 15 минут на тему\". И когда я делаю какую-то умственную задачу, я ставлю прямо будильник на часах на 15 минуток. И когда обезьянка понимает, что это вот за 15 минут это кончится уже, да, вот она охотнее берётся за задачу. Не получается 5 минут, попробуйте 10 минут. Но опять же вот вот думать и тупить 5-10 минут вы сможете только тогда, а когда вот уведомления выключены, когда башка чуть-чуть поспокойнее устроено, там, в принципе, 15 минут - это очень много. Там я на тренингах смеху ради делаю упражнения, мы думаем 12 минут. И многие говорят: \"Ох, ни хрена ж, сколько это времени\". Потому что современному человеку сидеть не трогать себя за смартфон 12 минут подряд - это невыносимая пытка. Поэтому вот, конечно, самое первое, да, если задача не решается, кажется большой, явным образом покажите, что она маленькая. Напишите 12 минут, 10 минут потупить. Если вы честно тупите и думаете над какой-то темой 10 минут, честно думайте, это вот ручки за спину, чтобы за смартфон себя не трогать. И вот так вот можете глазки закрыть, можете что-нибудь на флипчарте рисовать, можете LEGO пособирать. И удерживая фокус на вот этой на самой проблеме, с хорошей вероятностью за 10 минут вы что-то найдёте. Ну или вот майнмапу рисовать, да, это тоже один из способов тупить, выливать свои мысли, двигать их туда-сюда, налево-направо. Вот. А то есть, а просто я рисую не до не до результата, а в течение 10 минут, как бы и всё. Ага. Да, да, как ни странно, да, ориентация на результат на самом деле нас тоже очень часто гробят. Были очень прекрасные исследования над детишками, а когда их ориентировали на результат и хвалили за результат, просили нарисовать картинку. А, и одних говорили: \"Мм, какая у тебя хорошая картинка получилась\". А других детей хвалили, говорили: \"Как ты хорошо старался\". Да, одним поощряли результат, вторым поощряли процесс. Так вот, через полгода рисовать лучше вообще рисовать остались только в основном те, кого хвалили за процесс, кого хвалили за результат. Среди них очень мало осталось тех детишек, которые рисовали. Ну, там есть масса всяких трактовок этого эксперимента, но факт остаётся фактом, что ориентация только исключительно результат, она тоже очень плоха. Как всё по-своему плохо в нашем мире. Вот, кроме баланса. Максим, а я вот рядом тут. У меня вопрос, на самом деле, пересекается с предыдущим, но я на всякий случай его всё-таки тоже задам. А, ну когда мы что-то с кодом делаем сложное, да, и, ну, вот сложный код, надо что-то, значит, делать, ну, там новый фреймворк, там новый подход, но мы все понимаем, да, что сложность в этом случае она никуда не пропадает, она просто переходит в другое место. А, и вот в этой ситуации я тоже об этом думал и пробовал. И есть ощущение, что иногда вот задача составить список задач, она оказывается сложной и творческой, да, и просто вот задача составить список задач, она не проходит вот этот фильтр обезьяны и вот вот на этом месте всё ломается. Вы я подумаю об этом потом. Вот с этим также бороться, то есть там кусочками по 10 минут его составлять или вот есть какие-то подходы здесь? Может быть, это вот знакомая штука, да, новая технология. Надо составить список задач для того, как мы будем что-то писать на новом фреймворке. Очень часто мы не можем составить этот список задач, и наша подсознанка знает, поэтому оберегает нас от этого. А давайте хотя бы первые два-три шага мы можем увидеть. Просто очень часто мы сможем узнать план после того, когда мы начнём что-то делать. И возникает очень часто, есть ещё такая категория людей, которая боя боится что-то начать делать, пока не будет всё понятно до конца. А до конца всё не будет понятно, пока ты не дойдёшь хотя бы до середины. Особенно в новых технологиях это сплош и рядом. Как ты составишь список задач? Конечно, никак не составишь список задач. Надо же думать, анализировать. Не, надо сначала с мелочью разобраться. Но вот ты так смотришь на эту штучку, думаешь: \"Хм, а Hello World-то я смогу с этой штукой сделать? Давай попробуем\". Вот тебе первая задача. Всё, если ты дальше не видишь, сделай Hello World, а потом увидишь следующие два шага вперёд. То есть здесь у меня есть этот вебинар по этой штуке по джидайской технике, а, версии 2.0, да, это уже второй релиз. Там это называется метод рационального фланёра, который был стыбжен и адаптирован из книги Насима Талиба. Ну, и там много чего было ещё намешано. Вот поэтому, если мы не видим плана, а зачастую мы не видим плана, давайте хотя бы сделаем первые два шага, тогда дальше будет видно. Вот так и живём. А у меня вопрос. Я здесь, Максим. Ага. Спасибо за доклад. А я вот знаю, что планирование, особенно в долгосрочные каких-то целей - это очень хорошая практика, особенно вот если ежедневно там этим заниматься. Вопрос, как себя заставить заниматься планированием? Это раз. А, и во-вторых, вот составление списка дел может превратиться в рутину. То есть туда будут попадаться попадать только рутинные задачи, а не те, которые я бы хотел бы с связать с моими целями, допустим. Вот два вопроса таких вот. Да-да-да, очень хороший вопрос, который, э, обнажает ряд тараканов. Смотрите, кто записывает что-то вам в список задач, вы сам. Поэтому, если вы хотите, чтобы туда, кроме рутины попадали хорошие задачи, надо записать. Нет ничего проще. Это вам в инбокс. Вы не властны над тем, что падает вам во входящий, в эсэмэски, в этот сраный слаг и всё остальное, вот в эти хипстерские технологии. Вот над этим вы не властны. Что попадает в ваш список задач - это ваша вочина. Вы решаете по поводу, как заставить себя что-либо делать. Тёмы Лебедев хорошо писал, если видели, да, как заставить себя там учиться, никак. Оставайтесь в жопе. Вот на самом деле здесь, а, смотрите, какая вещь. Как заставить себя? Нас не надо будет заставлять в тот момент, когда мы поймём, что это помогает нам приближаться к своим хотелкам. Как только вы начнёте записывать в список задач, задачки, которые приближают вас к вашим целям, и начнёте их делать хотя бы по одной, хотя бы по чуть-чуть, хоть 20 минут в день, и вы увидите, что это помогает вам достигать того, чего вы хотите, у вас не будет вопроса, как заставить себя заниматься планированием. У вас будет вопрос, как остановить, блин, себя от этого. Там по-другому уже всё. Когда вы чётко видите, что это приносит вам результат, тот самый, который вы искренне хотите, не рациональной составляющей, а вот обезьяной, обезьянской стороной, как только вы увидите, что это подход помогает вам приближаться к этим хотелкам, всё снимется. Поэтому самое первое надо сделать так, чтобы вы увидели, вы начали для себя что-то делать такого, чего вот искренне давным-давно хотели. Вот. Ну и понятно, по поводу списка задач тоже понятно, как сделать так, чтобы он не загаживался. Не надо его загаживать. Как сделать так, чтобы туда попадали мои задачи? Записывайте. Тут всё очень просто. Вот кто-то ещё хотел что-то? А, спасибо за доклад. Я тут. Ага. А, очень здорово, что вы ссылались на Вей Bтвай. Я ещё раз всем посоветую прочитать статьи, выступления, да, и видео потрясающее. Вот. Э очень много здесь звучало о том, что мешает хорошо работать. И у вас, э, это мелькало, и у Тима Урбана тоже, э, есть, э, такое понятие, но вас промелькнуло как интерес, важность и пристрастие к чему-то. И у Тимы Урбана, и у многих дальше есть понятие потока и такого Theфлоу. Есть даже потрясающая книжка Михай Чиксент Михай. Вот. Да. И я о чём хочу сказать? Ну, во-первых, интересно, угораете ли вы тоже по этому понятию потока, да, когда человек чувствует, э, счастье от какого-то процесса, да, свою значимость, и он на этой волне может сделать очень много и быть крайне продуктивным. Вот. И немножко дело в том, что вот эти советы, которые говорят о том, как убрать пушеуведомления, списки и так далее, они практичные и понятные. А вот как с этим будет не очень понятно и как-то не получается это использовать. Может быть, у вас ну тоже что-то вас отключены уведомления, правильно сформулирован список, да? Ну со списком похуже. Смотрите, просто вот А почему я плюс-минус то же самое рассказываю много где ещё? Это база. Угу. Без этого потока не будет. Если у вас свистит, пердит, напоминает каждые 15 минут что-то в кармане, какой поток. Если у вас свербит в голове, что вы не купили молоко, надо купить блин молока, надо купить блин молока, вот этот мысленный диалог тоже он серьёзно уменьшает. Чексант Михай это называет психическая энтропия. Это серьёзно угрызает весь вообще ваш поток. Поэтому вот это база. Надо с этого начать, а дальше вы просто увидите. Это как вопрос про новые технологии. А как вот спланировать дальше? Зачастую в самом начале мы не очень видим, что дальше. наводим порядок в списочке задачек, а, делаем его как бы впихумизируем его так, чтобы более-менее оно билось с ними, с нашими хотелками. Выделяем или получаем себе возможность думать хотя бы там по 15-20 минут в день, выключив там большую часть уведомлений. И тогда вы уже поймёте вот куда дальше к потоку. Вы будете просто близкие к нему там. Ну, то есть ваш совет такой, что разобравшись с этим, появится то, правильно будет там уже будет видно. Это вы уже будете буквально на расстоянии вытянутой руки от этого потока, когда вы смотрите хороший список задачек, задачки, которые чётко, ёмко, конкретно сформулированы и совпадают с вашими хотелками, то есть у нас нет порога такого мешающего или заставляющего себя перешагнуть, чтобы начать делать эти задачки. И каждое или большинство из этих задачек приближает вас к чему-то такому, чего вы хотите. Оно просто вот само по себе так у вас и засасывает. Как я говорю, у вас выделяется шиложапин. Это такой гормон, который начинает стимулировать вас, делать ещё, ещё и ещё. Ну и вот он этот будет поток. Вот. Вот это примерно про это. Здравствуйте. А спасибо за интересный и вдохновляющий рассказ. А я, честно признаться, не читал ваш блог, хотя слышал о нём. И задача прочитать ваш блог у меня есть в списке. Прокритистинируется, как это нело. Вот я. У меня два вопроса. первый немножко может быть закрытый и возможно даже узкий. Скажите, знакомы ли вы с системой Александра Любищего? Кого? Кого? Александра Любищева. А, дададада. У него тако это странная жизнь. Данил Грани, у него очень банковский жёсткий подход к тайм-менеджменту на уровне вот тайм-менеджмент нацист такой. Вот там его так-то нет. И просто мне интересно, знакомы ли вы, если есть? Я знаком. Я вот перелопатив много всяких интересных работ, знаком с различного рода отклонениями. Давайте смотреть правде в глаза. Любищев отклонение. А в книжке есть ещё а книжка Лурия про феноменальную память. А там описывается история Соломона Шеришевского. Он отклонение. И скорее всего система любищего будет работать только для любищего. У него гиперрационализация мозга. Это тоже одно из отклонений, на самом деле. Ну, отклонение не в смысле это плохо и делает его каким-то там плохим. Это его делают не таким, как все. Кто кто кто-нибудь пробовал вести жёсткий учёт времени с разрезом 15 минут, что он делал в течение дня? Кого тошнило от этого на второй день? А вот, а на третий день, на десятый день, да? Вот. А у любищего вся жизнь была так построена. У него действительно очень много упора на очень сильное рациональное начало. И очень тяжело вообще, ребятки, будьте осторожны, копируя и применяя к себе рецепты исключительных личностей. Они срабатывают с исключительными личностями. Ну, если довести всё до абсурда, да, вот там, чтобы стать успешным человеком, надо что сделать? Надо, чтобы тебя отчислили как Эйнштейн из универа. И что ещё надо? И вот, а, а, вообще, есть создать корпорацию. И что сделать? И создать корпорацию, да, и создать свою корпорацию. Но обязательно надо уволиться из университета, нефига там делать. Ну, потому что у гейца не было высшего образования, у Джобса не было высшего образования. Они вот какие вещи сделали. А здесь у кого есть диплом о высшем образовании? Так, а поднимите руку, у кого есть компания стоимостью миллиард долларов. только у вас про профит. Ну, понятно, да. Вот. Спасибо за ответ. Можно ещё вопрос вот по поводу уведомлений, отвлечения. А мы, например, работаем в Опнспейсе. Э, вот мне кажется, что Open Space в целом, ну, скорее мешает, чем помогает. Хотя, возможно, есть разные мнения на этот счёт. Вот что вы думаете? И или как быть в таком случае, если это действительно мешает там войти в состоянию потока или просто менее это заставляет менее эффективно работать. То есть, ну, на самом деле Open А кто ещё в Openспресе работает, да? Там есть нюансы. В Опнспресе, конечно, доступность ваша намного выше, и подёргать вас может каждый. Это, правда, работать тяжелее. Ну, я знаю массу успешных кейсов, когда ребятки просто вот они понимают, что дёргая тебя, они делают то же самое, что происходит с нами, когда меня дёргают. То есть я причиняю тебе небольшую боль. Ну и как-то вот потихонечку это может выродиться в корпоративную культуру, где не очень принято дёргать людей по пустякам. А, то есть это можно устроить такую среду, но это сложно и скорее всего долго путь должен быть поддерживаться большими начальниками. Он будет там с кучей всяких припонов, костылей и всего остального, слёз, соплей и сахара. В общем, это путь непростой. Но на самом деле, смотрите, мы очень часто в том, что не входим в поток, обвиняем своих дорогих коллег, которые ходят о чём-то, нас спрашивают, но нередкие случаи, когда мы сами себя отвлекаем. Вот эти вот вылезающие мысли: \"А не забыл ли ты это? А ты помнишь вот это? Два НДФЛ. Кому надо справочку?\" Не. А к стоматологу кто хотел записаться? А у кого плинтус не прибит дома? А у кого кран капает, надо починить третий месяц. И вот эти вот мысли, они могут вылезать, вылетать, и они тоже нас сбивают с этого настроя. Что-то вот такой, это я их называю души потенциально продолбанных дел. Вот они ещё пока не продолбаны, но они близки к этому, и они могут вылезать в нашем сознании, отвлекая нас. И очень часто вот эти вот души потенциально продолных дел отвлекают нас ничуть не реже, чем дорогие коллеги. Но вообще, конечно, если вот нас очень часто отвлекают дорогие коллеги, это уже вопрос такой командной эффективности. Это надо решать всем совместно, потихонечку, нежностью, лаской, убеждением. И это очень непростая задачка. Но как-то начать надо с себя, самое главное. Спасибо. Здравствуйте. А спасибо за доклад. Ага. Было очень интересно. Вопрос такой, когда во время работы мартышка добирается до таймера, вот, и через какое-то время вы обнаруживаете, что дошли до какого-то, может быть, тупика, потрачено кучу времени. Вот как такое обрабатывать? До таймера добираете? Да. Да. То есть 10 минут прошло, а на самом деле прошло уже там 4 часа работать над наддачей. Здесь самое простое не доводить до этого. Это, знаете, просто большинство всех процессов в нашем теле, они инерционные. Если я сейчас хочу кушать, значит, я полчаса назад не поел. То есть сейчас уже делать на самом деле поздно, что поэтому лучше просто всеми силами стараться не доводить не доводить до такого предела, когда обезьяна хватает руль. Её можно отвлечь на там список задачек. Её, если отпускать в фейсбучик, то по таймеру, чтобы она вернулась обратно. Если она уже теперь захватывает таймер и ставит его на 4 часа, всё, завтра утром проснётесь на свежий мозг. Подумайте, что можно будет сделать в следующий раз, чтобы этого не повторилось. Когда у руля обезьяна рациональный, всё, он без воли. Вы ничего не можете сделать, уже поздно. Как с марафоном. Как с кем? С марафоном. Марафон заснул. А это снарафоны. А снарофона, да. Да. Человек переключает. Угу. И переключает. Дада. Да. В этом вот состоянии, когда ты не допроснулся, всякие там долгосрочные цели, ты же опоздаешь на митинг, ещё что-то, не работают. Всё, уже поздно. Надо было просто вчера лечь спать пораньше, чтобы сегодня ты вот к моменту звонка будильника уже сам проснулся. То есть, к сожалению, вот сложность заключается в том, что когда это настало, уже поздно что-то делать. Вот такая вот западла. Макс, слева от тебя. А снова я хочу дать обратную связь, что просто влюблён в эту технологию, потому что когда год назад я начал и отключил уведомляшки и стал формулировать список задач, я действительно за этот год сделал гораздо больше, чем можно было ожидать. И там, в частности, выступил здесь на конференции. У меня есть ещё одна обратная связь. Эстал успевать на пиццу. Чего перестал на пиццу? У нас в почте ребята пишут: \"У меня день рождения, и я принёс пиццу\". Ага. И и всё. Мне мне больше не достаётся, потому что все айтишники через минуту там сметают её. И когда я в конце дня читаю поч, у тебя пуза зато нет. Ну я похудел, да. Ну прекрасно же. Так, спасибо вам за доклад. У меня полувопрос, полукомментарий. Вот, ээ, вот эти вот как бы все сове советы по тайм-менеджменту, вот книги, они, э, ну, довольно большой уровень абстракции в них, и многие люди, ну, трактуют, трактовать их, конечно, будет по-разному. Вот. И можно заблудиться, просто как бы думая в том, что ты прав. Ну, неправильно трактуй вот эти вопросы. Вот. И я хотел бы сказать, что вот, допустим, а-э, ну вы заметил, что вы как бы про гормоны говорите, ну, то есть про какие-то биологические вещи. И вот и в этом в этом направлении есть, допустим, интересная вещь, называется той, кто ведёт Жуково. Вот. И хотелось, ну вот там как раз о том, как биологические процессы и химические наш организм что-то нам говорят, ну, руководят нашими действиями. Вот что вы думаете именно вот про такой подход к этому вопросу? Ну как, что нами управляет физиология большей частью, да, есть масса, на самом деле, школ и учений, и тяжело там они постоянно срутся за кто главнее, кто прав, кто не прав. Есть направление, что да, действительно, многие вещи, вот то, что происходит с человеком, - это всего лишь там замес определённого рода компот гормонов в крови. Есть немножко другие вещи. Я всё-таки склонен считать, что помимо гормонов и всего остального есть ещё что-то, что мы пока не умеем очень хорошо описывать. Скажем, вот реально такие вещи, как иррациональность, вообще поведение иррациональных людей, такие вещи, как внимание, такие вещи, как ум, вообще, его ещё пока никто никуда не транслировал на уровне физиологии. То есть никто не сказал, что вот от сих до сих в мозге думает там о бабах по вечерам. Да, там есть небольшие какие-то картограмы мозга, которые показывают, какие участки мозга задействованы, при каких задачах вроде бы. Но многие вещи ещё пока не до конца изучены. многие вещи, на самом деле, а их можно понять просто на практике. И опять же, это вот то, чему я научился из книжек Талиба. А многие вещи ты не понимаешь, как работают, но это не мешает тебе использовать их себе во благо. То есть, конечно же, да, там современная наука очень хорошо прошла вперёд, да, но она пока не всё объясняет. Вообще в книжек очень много интересных, которые описывают, как мы устроены, и они ещё больше убеждают нас в том, что мы биороботы, управляемые там различным компотом из гормонов. Да, это правда, это забавно. Максим, спасибо, очень интересно. А как насчёт А есть проблема доделать всё до конца? То есть мы часто в 8:20, мы очень быстро загораемся в поток, э, быстро-быстро пилим код, я не знаю, делаем ремонт. Храхираки продакшн. Да, именно так. А потом оказывается через полгода то, что плинтус ты так и не прибил, что там, не знаю, там автодиплой так и не настроил, потому что тебе кажется, что ты такой большой путь проделал и вот ты молодец большой, а вот это делать уже скучно, не охота и вообще, ну вот обламывает. Ну вот это вот как раз вопрос с прокрастинации. Прокрастинация она многогранна, она может возникать по разным причинам. Там основная бывает причина, что а я не понимаю первого шага. Есть очень много примеров, когда, грубо говоря, неприбитый плинтус, он был полгода неприбит по одной простой причине. У человеку гвоздей не было, и у него вылезал такой: \"Ты прибить плинтус: \"Ах да, мне нужны гвозди, молоток, заехать в магазин\". Да-дада. Потом стоило ему записать список задач, заехать в магазин, купить гвозди, как Плинтус оказался прибит. Бывает другое направление. Это когда подсознанка подсказывает тебе: \"Не надо этого делать и так хорошо\". Бывает такая вещь. Бывает просто какая-то там иррациональный тупняк, бывает выгорание, всяко бывает. А иногда бывает, что вот невпихуемое, и оно уже выпихнулось, и из-за тебя уже зашёл, не знаю, там теперь ты ремонтируешь машину или там ты теперь взялся за новые проекты и ты а то бросил там 99,9 доделано, но что-то там, значит, что-то не так, а ты уже зажёгся, и у тебя ещё 10 проектов там в разработке, ты уже там, я не знаю, там восписываешь, там купил себе щенка и его там как с этим-то быть вообще как вот здесь старый дела общего рецепта не будет здесь надо разбираться. В каждом отдельном случае по-разному. Везде по-разному. Где-то и так сойдёт, где-то это надо смотреть, депрокрастинировать, заниматься депрокрастинацией, а где-то вот оно сделано на 99%, потому что больше не надо делать. Вот. Ну, всякое. О'кей. Да, понял. Спасибо. Ну, общего рецепта нет. Всё, сваливаем. А, не, не сваливаем. Спасибо за лекцию. Вот у вас, а, была такая задачка с подвохом. Вот. И хотелось просто сказать, что а а была работа в области психотерапии Зарецкого, Карловой научная. И а в ней, в частности, говорилось, что нестандартные задачи используются для а оценки а эффективности психотерапии. Потому что, когда человек находится в ступре, вот переходит к этому моменту, когда он совершает инсайт, то есть начинает думать, он начинает очень много самооценочных высказываний произносить. И в целом, а, возникают автоматические мысли, которые анализируются, и по ним можно понять, как с человеком дальше работать. Вот в том числе вот, грубо говоря, даже так делают. Дают одну задачу до психотерапии, другую задачу после. И по разнице, грубо говоря, вот его высказывания определяют, насколько это эффективно. Вот поэтому вот то, что вы говорите, оно действительно имеет место быть. Да, вот эти тесты, знаете, тесты Роршарха, когда взрослым людям дают чернильные лампы эти пятна, они говорят: \"Ички, ну или что они там видят, то они и видят, да? И вот это то, что по словам познаётся внутренний мир - это то, что лежит в основе NLP и вообще вот этой всей практики, да, по словам, по тем словам, по тем оборотам, которые люди используют. в речи можно понять их внутренний мир и какие-то там косяки. И через слова можно влиять на этот внутренний мир, тоже его чуть-чуть менять. Ну там этим терапевты занимаются, да. И вот вы ещё говорили про тайм-менеджмент, а вот на самом деле оно работает. Вот можно привести аналогию, а можно записывать с каждого чека траты в книжечку и с ужасом обнаружить, что вы потратите вот в этот месяц раза в два меньше денег, чем обычно. Также со временем оно работает, но недолго, к сожалению. Со временем, да. Ну вот я говорил, нас ограничивает не время, и нам экономить надо не время, нам экономить надо мозг. Вот. Ну что, давайте сваливать и потом куда-нибудь в коридор переползти. Всё, всем спасибо, кто выжил. Спасибо большое. Это был последний доклад."
}