{
  "video_id": "PkdMDbK7Q_s",
  "channel": "HighLoadChannel",
  "title": "",
  "views": 0,
  "duration": 0,
  "published": "",
  "text": "Ага. А тех, кто может сейчас это себе организовать, пожалуйста, возьмите листочки и бумажки или ручки, карандаши или ручки, чтобы записывать блокноты, а, бумажки, что-то, на чём вы можете себе писать, если вы себе, опять же сможете это дело организовать, если вам это удобно. >> Это фантастически сложная задача писать рукой в >> бумажке. Ну мало ли, >> мало ли кто сейчас в дороге за рулём нас слушает. Иногда это >> нет, даже не в этом дело. Даже те, кто сидят у себя за столом, за компьютером, писать, >> да, >> на бумажке >> это ээ Да, короче, берите бумажки, да, готовьтесь, >> да, готовьтесь. Берите листочки, карандаши, ручки, все пишущие средства. И мы будем писать ещё в чате, поэтому сейчас мы чат ещё прочекаем, посмотрим, всё ли там получается аа в него писать. Так что имейте в виду, если что, найдите глазками чат, а чтобы понять, где он располагается. Так, у нас четыре человека в зале ожидания. Мы их ещё, наверное, ожидаем, пока они у нас дойдут. Ага. М. Ага. Аа так. Ну посмотрим. Хорошо. Насчёт чата посмотрим, как там у нас будет происходить. Если что, мы его будем использовать. Если вдруг нет, то не будем. Если Угу. Угу. Хорошо. Ещё. Да. Ещё Лизы ещё добавляем, да, людей из зала ожидания. Наверное, я могу принять. Да, потихоньку добавляются. Всех добавляем. Думаю, через минутку. >> Угу. Хорошо, хорошо. Достаточно много людей. Здорово, здорово. Слушайте, вообще я пока мы все потихонечку добавляемся, а, расскажу собственное маленькое исследование в канале Провела голосование. кто считает, что у него есть синдром самозвабца. И 100% людей проголосовало за то, что они, а, у себя находят признаки этого синдрома. Поэтому тема, конечно, очень-очень актуальная. Так что мы с вами попали в точку. >> А, >> а можно, можно я, э, >> короче, буду всякую ерунду говорить. То есть вот смотрите, Полина тут будет всякие засерьёзные слова, а я буду, значит, вносить хаос и не разбериху. Значит, я, поскольку подписан в целую кучу канальчиков разных программных комитетов, в которых я участвую, в частности, в АИКОНФ. И там значит один из участников программного комитета говорит: \"Да нет никакого синдрома самозванца\". Я вот по нашим как бы заявкам вижу синдром наглеца только. Вот >> очень интересно. Мы не будем. Мы мы мы ему быстро объяснили, что на самом деле те, у кого есть синдром самозванца, они просто как бы дурацких докладов не подают и хороших не подают, которые могли бы >> вообще никаких не подаёт. Вот в этом в этом проблема. >> Поэтому он их и не видит. Вот >> это факт. А, конечно, история действительно неоднозначная, и стоит с ней работать. А есть второе название, которое пытались продвинуть. Это, э, воображаемый, сейчас скажу, мм, невоображаемый самозванец, а, ну, собственно, да, чуть-чуть по-другому, чуть-чуть по-другому. Воображаемый некомпетентец, так скажем, да. Вот что-то наподобие этого было. Люди, которые компетентны, думают, что они некомпетентны. Вот такая была история. Угу. Угу. Ой, 80 участников. Надо же. Как здорово. Как нас много. Класс. Отлично, друзья. По-моему, это прям очень хороший вариант, а, поговорить на наши действительно непростые темы. Мы постараемся сегодня уложиться в полтора часа, но так как у нас такая вот большая сегодня аудитория, вдруг, может быть, и не получится. Но надеюсь, что мы уложимся и будет это всё достаточно быстро и ёмко, а главное, полезно. Мне кажется, это наша главная цель. Ну что, Лиза, даёшь нам добро начинать или пока ещё немножечко ждём? >> Начинать >> можем начинать. Прекрасно. Ну что, тогда я шарю свою презентацию и Угу. Так, а скажите мне, пожалуйста, всё ли видно по презентации? или не очень хорошо. Вот давайте вот так сделаем. Угу. >> Что? Ctrl L. Да. Вот. Вот теперь вообще кайф. >> Да. Отлично. Прекрасно. Ну что, моя часть, э, будет называться \"Выходи, самозванец\". Я кто? Меня зовут Полина Лето. Я тренер по технике речи, публичным выступлениям, а также вокалу. И я, э, исследую темой синдрома самозванца для тех, кто хочет выступать на сцене, выходить на сцену, представлять себя как спикера. И сегодня про это я буду немножко рассказывать. И мы с вами будем делать даже небольшую практику. Поэтому, ещё раз повторюсь, приготовьте, пожалуйста, листочки, карандаши, ручки, чтобы вы могли записать что-то. и дальнейшая ваша работа с собой была бы продуктивная. То есть вы не просто послушали, а что-то даже и сделали сегодня. Итак, немножечко истории. Немножечко истории. Название существует с 1978 года. Появилось оно изначально после исследования женщин. А дело в том, что после Вьетнамской войны мужчины возвращались в США домой, пока они воевали, их места на заводах, то есть их компетенции заняли женщины. И правительству США надо было трудоустроить а этих мужчин, вернувшихся с войны на места, заняты женщинами. Как быть? Их стали настраивать на то, что забота женщины - это дом и домохозяйка - это лучшая роль. Собственно, получилось очень хорошо, очень убедительно, но не все хотят таковыми быть домохозяйками. И женщины, которые начали строить карьеры, чувствовали себя не на своём месте, потому что социально одобряемый образ был выстроен. И, собственно, женщины стали думать, что они не дотягивают до уровня компетенций мужчин. Поэтому изначально эту сферу, а, исследовали именно в женской части аудитории. Они женщины как раз описывали свои ощущения так, что они боятся, что их разоблачат, что они не настолько компетентны, насколько они себя позиционируют. И я предполагаю, что именно это есть и у нас с вами, у тех, кто испытывает синдром самозванца. Давайте попробуем сейчас посмотреть, как же ощущается внутренний синдром самозванца. Я его обозначила как внутренний СС. А звучит жёстко это с долей юмора, поэтому отнеситесь к этому именно так. Как именно ощущается синдром самозванца? Чувство некомпетентности. Как именно самокритика? А давайте разберёмся подробней, что это такое. Это когда вы себя чувствуете недостаточно компетентным, особенно по сравнению со своими коллегами, с людьми, с которыми вы вместе работаете, либо, а, по сравнению с теми, кто с вами находится в одном ряду, либо там чуть выше, или даже иногда по сравнению с людьми, которые работают на более низших, так скажем, должностях в вертикали компании. Иногда даже относительно них люди с чувством, с ощущением синдрома самозванца чувствуют себя менее компетентными. Такое тоже случается. Вы боитесь, что вас разоблачат. То самое, что я описала, что вот будет стыдно, когда все поймут, что я на самом деле не так хорош, каким себя показываю или каким меня считают. Вот такие мысли у вас могут крутиться в голове, если вы, например, склонны к перфекционизму. То есть вы всегда хотите сделать на 100% предельно идеально, так что у вас не остаётся а никаких сил на другие задачи, и вы хотите сделать всё по высшему разряду сразу с первого раза, с первого подхода, так скажем, особенно в новой какой-то области для себя. То есть, если вы, например, готовитесь сейчас или думаете о том, чтобы выступить, и хотите сразу, чтобы ваше первое выступление было идеальным, чтобы вас оценили на 100% как очень а опытного спикера, и вы от себя этого ждёте, от своей подготовки к этому выступлению. Если это в вас есть, то это точно синдром самозванца. Пожалуйста, сейчас, пока я говорю, думайте и прислушивайтесь к себе, откликается ли вам что-то из того, что я озвучиваю. И давайте попробуем, а, попробуем поработать сейчас с чатом. Лиза, есть ли возможность у нас в чате, а, что-то написать? А, да, да, могу писать. Есть в чате сообщение. Оказывается, вас знаю. Точнее, я люблю вашу песню дёгать. Простите, это не моя песня. Я не знаю, о чём вы. Так, чат работает. Отлично. Чат. Ага. Скажите, пожалуйста, из того, что я перечислила, аа откликается ли вам что-то? Поставьте плюсик, если да. Отлично. Что делать, если не настоящий синдром самозванца? Вот мы сейчас как раз выясняем, настоящий он или нет. Действительно, мы аа себя оцениваем объективно, так скажем. Ага. Склонность к перфекционизму. Отлично. Или мы себя оцениваем наоборот завышенно, так скажем, относительно того, что мы действительно умеем. А мы сейчас это и будем выяснять. Так, а я теперь ещё Лизу попрошу мне сказать, не перечёркивает ли мой чат, который я вижу, мою презентацию, всё ли с ней в порядке? >> Всё хорошо, >> всё хорошо. Отлично. >> Так вот, я склонность к перфекционизму, нанимановились. Если вы сравниваете себя с другими, если вы думаете: \"Ну вот Пётр-то Иванович, вот он-то точно молодец, а я что? Я ничего\". И если так происходит практически с каждым вашим коллегой, а, знакомым, близким человеком или очень далёким, и всегда это сравнение в нелучшую сторону, то тогда это тоже признак синдрома самозванца. Страх принять похвалу или сложность принять похвалу. Когда вас хвалят, говорят: \"Классно, ты сегодня приготовил ужин, а ты, ну что, это не я, это просто хорошие продукты были с там хорошего рынка. Я просто попались мне прекрасные помидорки сегодня, поэтому ужин был вкусным. А так моей заслуги здесь нет\". Да, очень бытовой пример. Это может, кстати, как и в быту проявляться. а не только в профессиональной сфере. Если вам говорят: \"Здорово ты сегодня выступил на собрании\", а про себя или вслух вы думаете, что, ну, мне просто, наверное, от душевности, от душевной доброты так говорит человек, или просто меня хочет подбодрить, чтобы в следующий раз мне было легче. Если эти мысли у вас крутятся, то это тоже оно. Иван Брагин спрашивает: \"Давайте чуть попозже вопросы. Пока, если вы у себя такие мысли наблюдайте, ставьте плюсик в чат-конференции прямо вот смелее\". А и какие ещё ощущения внутреннего ССС бывают? когда вы переоцениваете собственные усилия, когда вы, а очень сильно от себя ждёте, сильно готовитесь, вкладываете чересчур много усилий в подготовку, и потом это у вас откликается таким, чувствуется откатом, да, падает энергия после окончания. Ну и, собственно, последний пункт, когда себя вы себя сами ограничиваете. Если вдруг вы говорите, что я недостаточно хорош для того, чтобы пойти дальше по карьерной лестнице, и я туда точно не пойду, даже если вы не пытаетесь этого сделать, либо не даёте себе возможности, например, выступить, тем самым подтвердить свою компетентность. То есть вы сами себя ограничиваете. Это тоже ощущение внутреннего самозванца. Так, теперь самое интересное начинается. Я надеюсь, что вы готовы к тому, чтобы писать на листочке. Пожалуйста, сейчас представьте, что вы готовитесь выступить на мероприятии, на котором вам очень хочется себя проявить, на тему, на которую вы уверены в себе. Это может быть и профессиональная тема, и житейская любой сферы. вы спокойно на неё что-то можете рассказать. Представьте, пожалуйста, это себе. Подумаете сейчас, какая бы это могла быть тема, и запишите её себе на листочек. Как только запишите, пожалуйста, поставьте единичку в наш чат. Итак, тема. Придумываем тему. Угу. Отлично. Угу. Так. Вижу, вижу. Отлично, единички посыпались. Дописывайте темы, на которые вы Да. Угу. Хорошо. Надеюсь, да, вы записали по большей части. Прекрасно. Идём дальше. Теперь будем работать с вашим воображением а сообщения чата по центру презентации. Так, вот так сделаем. Хорошо. Спасибо. Итак, пожалуйста, вообразите себя, что вы начали готовить презентацию. к этому выступлению, к выступлению на эту тему. Закройте глаза и представьте, что вы начали готовить презентацию. Какие страхи, какие тревоги, ощущения вы слышите в себе? Пожалуйста, сформулируйте их и запишите себе на листочек под этой темой ниже. Как только вы это сделаете, можете написать в чат либо поставить цифру два. Ничего нет. Ага. Угу. Отлично. Ага. Страшно, что Угу. Отлично. Спасибо, Юрий. Андрей. Угу. Вопрос был второй про то, а, сформулируйте страхи, тревоги, свои ощущения при подготовке презентации, которая на тему, на которую вы хотите выступить. Вот это был второй вопрос. Сформулируйте страхи при подготовке. Воображаемые, конечно, сейчас мы именно с этим работаем. Воображаемые страхи при подготовке, презентации. Угу. Угу. Отлично. Спасибо. А, спасибо, что написали и поделились своими мыслями, своими страхами. Это здорово. Идём дальше. Мы сейчас с этим будем продолжать работать. А, отступите немножечко вниз строчку. Отступите вниз и продолжайте писать. У вас А это был первый пункт под темой. Теперь второй пункт под темой. Теперь вы уже подготовили презентацию. Пожалуйста, представьте себе. Приготовили презентацию и стоите перед сценой. Перед выходом на сцену закройте глаза и почувствуйте, какие страхи, тревоги, ощущения вы слышите в себе. Запишите их на листочек и попробуйте написать нам в чат три. Как только запишите, напишите в чат цифру три или ваши фразы, которые вы записали себе на листочек. Угу. Классно, Дима. Радость и волнения. Здорово. Угу. Угу. Угу. Барбара написала очень подробно. Здорово. Ага. Где запасной выход? Угу. Третий вопрос был о том, а что вы чувствуете перед выходом на сцену? Представьте себе, что вам уже с готовой презентацией выходить на сцену. Запишите свои ощущения. Угу. Хорошо. Ну и идём дальше. А-а, идём дальше. Попробуйте, пожалуйста, теперь представить, что вы выступили. Вы получили свои аплодисменты, вышли со сцены и выдохнули. Начали думать о том, что с вами сейчас произошло. Всё. закончилась, и вы думаете о том, что это было такое с вами. И снова запишите, пожалуйста, отступите от предыдущего, от предыдущей записи. А отступите немножко и запишите свои ощущения, тревоги, страхи или другие чувства после выступления. Если закончили, напишите четвёрочку нам в чат, закончилось хорошо или нет. От этого вот что представите себе, а то и записывайте. Вот что ещё колбасит, это понятно. Волнение после окончания, да? Попробуйте конкретизировать ваши мысли. Какие мысли в голове у вас крутятся? Ага. Так. Ага. Угу. Угу. Класс. Угуm. Угу. Угу. Здорово, Барбара. Здорово. Отлично, отлично. А, спасибо большое за ваши ответы. Теперь, что мы с ними делаем? Вы сейчас очень здорово записали. Спасибо, что в чате поделились. А вот теперь давайте попробуем с вами переформулировать эти негативные мысли в позитивные. Например, я не смогу, если вдруг вы себе записали что-то подобное и что я не смогу подготовиться как следует, и мне будет очень стыдно во время выступления. Например, такие мысли у вас были в голове. Давайте подумаем, как это можно переформулировать. Например, моей компетенции и подготовки достаточно для уверенного выступления. Попробуйте переформулировать свои страхи и ощущения в позитивное, в позитивное ощущение, в позитивный ключ. Прямо перепишите их. Мы не зря оставляли, а под фразами место можете под каждый переписать. Как только это сделаете, поставьте пятёрочку в чат. Можете написать, как вы переформулировали. Итоговую фразу не обязательно первую писать. Напишите итоговую фразу, что у вас получилось в результате. Отлично, Елена. Ага. Как перепишите? Отлично. Уже есть. Да, здесь я выделю побольше времени, потому что, а, фраз у нас целых три, как минимум. Отлично. Я могу ответить на вопросы и изложить информацию доступно для слушателей. класс. Смотрите, тогда, когда вы пишете: \"Могла бы лучше или когда, а, заниженная самооценная оценка выступления, да, вы думаете, что вы могли бы выступить лучше, попробуйте переписать, что я выступаю достаточно хорошо для своего уровня\". или для своего опыта. Я выступаю уверенно или слушателям нравится то, как выступаю именно я. Полный зал таких же самозванцев. Ребят, мне нравится очень ваш уровень юмора. А, действительно, э, переходим в синдром Бога. тоже те качели, которые как раз характерны для синдрома самозванца. Либо Бог, либо да? Вот это наши качели, на которых мы качаемся. А это повод для того, чтобы пойти работать с психотерапевтом. Это именно то, тот признак, который вас туда должен привести. Отлично. Переписывайте, пожалуйста. Переписывайте, пожалуйста, и ставьте пятёрочки, как закончите. Очень хороший комментарий от Дима Синявского. Для тех, кто знает лучше меня, я сразу расскажу в начале, для кого это. Это очень важный вопрос, и сегодня мы о нём тоже будем говорить. А, прекрасно, пятёрочки появились. Про волнение, пока вы дописываете, про волнение. Волноваться вы будете всегда. Можно по этому поводу, по крайней мере, не париться. Даже если вы 30 лет выходите на сцену, как один из самых крутых спикеров в России, Радислав Гандапас, например, а вы всё равно будете волноваться, даже с учётом тридцатилетнего опыта. Если вы не волнуетесь, значит, вы мёртвый спикер, и вам не стоит выходить на сцену. Волнение - это хороший признак. живости ваших эмоций и того, что вы сейчас поделитесь чем-то важным для себя с теми людьми, которые вас будут слушать. Так вот, друзья, вижу, что пятёрочки. Угу. Отлично, Василий, спасибо. Мёртвый спикер. Вера, вы совсем не волнуетесь. Давайте разберёмся с этим. А если так какой вопрос? Мы сейчас уже с вопросами заканчиваем. Угу. Я уверен, что я не справлюсь. А, ребят, да, это хорошие, интересные моменты. Кроме того, что вы переписали свои страхи, свои ощущения, вы, конечно, можете их разбить на рациональные страхи и иррациональные. Рациональные страхи - это я забуду, запутаюсь, не смогу найти ответы, а там или будут сложные вопросы. С этим есть смысл, а, поработать заранее, подготовиться заранее и подготовить ответы на вопросы, которые могут всплыть, а подготовиться к тому, чтобы структурировать информацию в своей голове и так далее. То есть разобрать эти страхи, которые вы выписали, на рациональные, иррациональные. Иррациональные - это те, которые после выхода я себя буду ругать за мелкие недочёты. Это иррациональное соображение. У всех бывают мелкие э недочёты, ошибки и крупные тоже, даже у опытных спикеров. Собственно, в этом нету ничего критичного. Но если вы себя гнобите за это дело, то есть смысл хотя бы переписать и повторять себе несколько раз, когда у вас возникают эти мысли, что это может с вами произойти. Ну а более серьёзный шаг - это работа с психотерапевтом. Так, класс. Думаю, что большинство из вас записали себе, переписали эти фразы, и мы с вами идём дальше. Мы с вами идём дальше. Вообще есть так называемая бинга самозванцем, когда все так умеют. Вы внутри себя проговариваете фразочки: \"Все так умеют, а я такой неоригинальный\". Все такие же, как я, например. Мой опыт неоригинален. Я не дотягиваю. А так Юлия услышала. Я не дотягиваю до какого-то уровня. Вот там бы ещё немножечко поучиться, ещё этот курс, пройти этот курс, и тогда я, значит, достоин буду того, чтобы занимать какую-то должность или выступать на сцене. А если делать уж сразу лучше всех, это про перфекциониста, а все будут смеяться. Есть такой страх. И кажется, сегодня мы даже его видели. Это у меня случайно один раз получилось, и этот опыт я повторить не смогу. В следующий раз обязательно облажаюсь. Мне просто повезло, например, да, это я не своим опытом достиг, это мне просто повезло. Ну так вот сложилось, так вот случайно звёзды встали. А очень хороший признак самозванца, не очевидный. Это не я, это мы вместе придумали с кем-то. Это вот мы с партнёром. Если бы я один, я бы никогда этого не сделал, не добился бы этого успеха. Такое часто встречается и не очевидно. Мне до этого ещё далеко до какой-то должности или там какого-то проявления себя. Мне ещё очень-очень далеко. А как до Луны, да? Вот Пётр Иванович, он-то как раз светило наше, но его место от меня как до луны. А это из жалости меня похвалили или по доброте душевной хотели меня просто поддержать? Вот всевсе эти фразы, можете их ещё прочитать. Если они в вашей голове крутятся, это признак того самого синдрома самозванца. То, что недостаточно идеально, видели уже в чате. Отлично. Аа, а смотрите, Елена, может, все вместе придумали? Человек просто хочет подчеркнуть заслуги другого человека. Можно их подчеркнуть, но при этом не умолять себя. Если вы в это время про себя думаете, что да, мы вместе сделали, но сам бы я никогда этого не сделал, вы умоляете, например, себя, тогда это признак вот этого самого синдрома. Если же вы хотите это мы вместе придумали, вот такой классный у меня партнёр, и я как бы вместе с ним классный, а то тогда всё в порядке. Здоровая самооценка. И есть у нас ещё с вами интересная, а история, называется цикл самозванца. А страшная закольцованная история, в которой перед выполнением задачи или, например, перед тем, как выступать, вы испытываете сильнейшую тревогу. Перед тем, как даже готовить презентацию, вы чувствуете сильнейшую тревогу, вас колбасит, и из-за этого вы начинаете либо сильно готовиться, чрезмерно уделять огромное количество времени, сил, энергии своей, а, и тем самым немножечко себя выжигая. Либо обратная история, вы прокрастинируете очень много времени перед подготовкой презентации, например, к выступлению, но зато потом начинаете лихорадочно готовиться. То есть вы какое-то время чувствуете прокрастинацию, прямо не можете взяться, потому что вам кажется, что эта история очень тяжёлая и она съест у вас много времени и сил, поэтому вы не начинаете к ней даже готовиться. Вот. Прокрастинация. Отлично. Это в ту сторону. А после того, как вы вышли, выступили, сделали задачу, вы чувствуете временное облегчение после выполнения. Фух. Вот то самое, да, как вы писали в чате, то самое. Выдыхаю, всё хорошо. Но после этого вы либо обесцениваете успех, говорите: \"Ну, это случайно получилось так\". Либо вы говорите, что, э, конечно, да, но вот там-то и там-то я мог бы и получше, вообще-то. Это, смотрите, разница с тем, что в следующий раз, если вы себе говорите после выступления, в следующий раз я бы хотел учесть 1 2 3. Я молодец, ещё и сделал анализ своего выступления или выполненной задачи. Это здоровая история. Если вы после, а, выполнения задачи думаете, что, чёрт возьми, а вот здесь-то я не догадался, и вот это, ну, что я за дурак такой, дурачин вообще, просто филя. А, хотя задачу вы сделали успешно, выполнили, всё сделали, выступили, получили там какие-то, может быть, оценки. А если вы, если это всё прошло в порядке, нормально, но после этого вы чувствуете, что вот здесь недодела, вот там не доделал, да что ж такое? Вот это уже, собственно, то, что нужно менять. как раз вы можете те инструменты, которые сегодня получили по переписыванию вот этих установок, если вы в себе это отследили, это самое важное, записали, перепишите себе, пожалуйста, в позитивном ключе, как вы сегодня это сделали. Я надеюсь, что вам сейчас это полезно. Поставьте, пожалуйста, ещё плюсики в чат, а я пока рассказываю дальше. Полезно ли это вам? Скажите мне, пожалуйста. Супер, спасибо. А есть ещё такая штука, что здорово понять, что ты не один в этой в этом синдроме. А, спасибо, ребят. Исследование восьмидесятых годов показало, что порядка 70% хотя бы единожды сталкивались с синдромом самозванца и испытывали симптомы его. А уже в двадцатых годах годах нашего тысячелетия предприниматели, руководители, работники интеллектуального труда, люди, занимающие высокие должности, а признаются, что они испытывают синдром самозванца. А известные люди, такие как, например, Том Хэнкс, Эмма Уотсон, очень многие люди, Альберт Эйнштейн признавался в конце своей жизни, что он чувствует, что он не достоин того внимания и уважения и почёта от людей, которые он на себе испытывает. Да, он не переносил того внимания, которое ему оказывали, и считал, что это не заслужено. Хотя это человек, который вообще поменял представление о состоянии мира, физики в сегодняшнем, да, мире, во всём мире знают Альберта Эйнштейна. А поэтому, поверьте, вы не один в этих ощущениях. Итак, что мы ещё можем сделать для того, чтобы преодолеть эти признаки, эти симптомы синдромы смазанце? Первое, осознание проблемы. Конкретизирует конкретизировать те фразы внутреннего голоса, которые вы слышите. Мы сегодня это с вами сделали. Если у вас есть внутренний критик, тот самый, который говорит, что, ну, не очень-то у тебя всё хорошо получилось, пусть будет и внутренний хвалитель. Так, я так понимаю, что здесь, наверное, вот так надо пододвинуть. Пусть будет и внутренний хвалитель. То есть, если вы говорите: \"Ну, недостаточно хорошо\". Вот говорит ваш синдром самозванца. Ну недостаточно хорошо ты эту задачу сделал, пожалуйста. А это пусть будет на левом плече тот человек, который это говорит внутри вас, а на правом должен быть баланс. Пусть будет а у вас голос, который вам будет говорить, что ты сделал самую лучшую вещь на свете. Ты сейчас сделал и себя лучше, и других лучше, и поделился, и преодолел свой страх. Ты сделал всё из возможного на тот уровень, который для тебя реален. И это здорово. Попробуйте уравновесить внутренним хвалителям своего критика и самозванца внутреннего. Второе. Фиксируйте достижения - это дневник наблюдений. то, как вы, э, думаете, то, какие вы ощущения испытываете, какие фразы у вас в голове пролетают во время подготовки, а, перед выходом на сцену или после, а, проведения мероприятия, или после выполнения задачи. Таким образом, вы будете двигаться от, а, да, точки к точке, от одного, например, выступления к другому и смотреть, как меняются ваши ощущения, как вы работаете над собой, над своим внутренним состоянием, в том числе. И таким образом вот эти поинты, вот эти точечки будут вас двигать к тому, чтобы чувствовать себя уверенней. Принятие несовершенств, это то, что писали в чате, когда, ну, вот процент негатива есть, и вот этот процент негатива, ошибок, каких-то недочётов, он всегда будет. И согласиться с тем, что он всегда будет, это стоит сделать. Вот стоит прямо принять то, что не всё будет идеально. Есть такие певцы, певицы, которые, например, мало выступают из-за того, что на каждом мероприятии перед выступлением всё время, ну, какие-то истории происходят. То звукорежиссёр не так настроит пульт, то не достанет какого-нибудь шнуропровода для подключения аппаратуры, то ещё что-нибудь. И это вызывает в них такую бурю негативных эмоций. Да. сады разочарования в этом процессе, что они просто мало выступают и не продвигают свои там произведения, песни, а свою личность, в конце концов, как артиста. И это очень грустно, хотя это может быть очень классная музыка, замечательное произведение искусства. Также и вы. А чем больше вы внимания уделяете несовершенствам и фокусируетесь на них, тем меньше вы будете выступать и меньше успеха и признания получать, в конце концов. Ну и последнее, что я скажу здесь - это снизить планку ожиданий. Вот сейчас, пожалуйста, послушайте полминутки внимательно. На каждое выступление у нас есть цели. А каждое выступление имеет какую-либо цель, а чтобы вы могли зафиксировать её после выступления. То есть, например, ваша цель на выступление почувствовать себя удовлетворённым после выступления. Вот такая простая, очень, мне кажется, реалистичная цель может быть для вас лично. Вы можете поставить цель именно для слушателей, чтобы они что-либо запомнили, например, какую-то главную мысль уловили вашу и, например, запомнили её. Вы доносите эту мысль с разных сторон. Но и также для себя вы ставите цель. на это выступление, например, вот почувствовать, например, удовлетворение после выступления или услышать аплодисменты. Вот ваша цель на выступление. Услышать аплодисменты после окончания. Реалистичная цель. Реалистичная. Поставьте себе её. И когда вы её добьётесь, вы немножечко спуститесь на землю и перестанете ставить себе высокую планку, потому что это, естественно, будет ошибкой ставить очень высокую планку. Есть такие ребята, которые сразу говорят: \"Я хочу подготовиться так, чтобы у меня на 100% всё получилось\". Что это будет значить? Что значит 100% всё получится? Непонятно. Нереалистично, слишком высоко, точно не сбудется. Ставьте реалистичные личные планы на выступление или задачу. Ещё жду ваших плюсиков и плюсиков, если вдруг вы понимаете, что то, что я вам сейчас рассказала, вам полезно. Если вдруг не полезно и если это вода, можете ставить минусы. Это тоже нормально. А я сейчас передаю. Аа, да, отлично, спасибо большое. передаю слово Роману, который, а, будет рассказывать о том, как побороть синдром самозванца, точнее, как выбрать тему, так чтобы этот синдром самозванца вас не побеспокоил, и вам было бы очень-очень комфортно, и вы были бы уверены в той теме, которую вы выберете, что она интересна, классная, сочная, яркая и уникальная. Спасибо большое, Полина. А, и я так, Полина, а у тебя же в конце есть ещё один блок. >> Да, у меня есть в конце ещё один блок. Если вдруг мы поймём, что нам чересчур много, >> черечур тесно, >> чересчур тесно, да, то мы, соответственно, его не будем брать. У меня ещё есть блок. Я сейчас слово, пару слов скажу. Блог по про физиологию уверенности на сцене. Если вдруг мы поймём, что мы успеваем, всё в порядке у нас, то я о нём ещё вкратце расскажу. Прямо буквально минут 10-15. Если нет, значит нет. >> Ну я я просто для того, чтобы как раз примерно прикидывать, в какой меня тайминг целится. Конечно, интересно. Я сам с удовольствием послушать. Оставим удочку на будущее. О'кей. А, привет всем ещё раз. Меня зовут Роман. Я не последние 10 лет занимаюсь тем, что помогаю спикерам технических технологических конференций э готовить выступления на профессиональные темы. Ну и я этих выступлений за последние 10 лет видел, ну, типа несколько тысяч. А, и поэтому мне кажется, что я могу сделать какие-то обобщения, да, и вот в этих вот обобщениях, э, может быть, вы найдёте способ, э, быстро находить темы в своей работе, да? А чи прежде всего понятно, что сейчас мы, э, ну, приурочили, да, приурочили, наверное, этот вебинар к м времени приёма заявок на эйлот на московский, да, как раз вот мы до конца июля принимаем заявки и в общем, было бы естественно получить заявки именно на эту конференцию, но тем не менее хочу вот всё Дальнейшее предворить цитаты из такой гроссмейстер есть индийский, бывший чемпион мира, пока с Магнусом не встретился, Вишната Анант, ну, известный шахматист, разумный человек. И он как-то высказался в таком духе, что подготовка к соревнованиям всегда окупается, но не всегда это происходит именно в том соревновании, к которому вы готовились. А вот также и тут, э, мы попробуем вообще подумать о том, как искать темы в своей работе, но может оказаться, что эта тема на какую-то другую конференцию, да? То есть мы сначала находим, о чём хотим сказать, а потом уже ищем, где удобнее всего об этом говорить. А более того, скажу сейчас страшное. Значит, у меня в примерах есть даже, ну, в некоторых местах ссылки на конференции прямых конкурентов, да, потому что есть такие конференции, вот такие темы, для которых у нас отдельных конференций нет, а у каких-то других организаторов есть. Ну и, собственно, почему бы и нет? Главное, что мир лучше станет. Вот. Итак, значит, кому я сейчас значит говорю? Вот, ээ, вот главная такая портрет целевого зрителя. Сейчас вы его увидите. Её, его. Так, для этого надо сделать тык. Для этого надо сделать ещё один тык. Вот такой. Вот такой вот. Короче, главный целевой, значит, зритель - это человек, который вот так вот сидит, обхватив голову руками, говорит: \"Ну, моя работа парси Джейсона, куда я с уконным рылом в калашный ряд\", - думает этот человек. И вот сейчас мы ээ поймём, как правильно смотреть на свою работу, чтобы увидеть в ней что-то кроме джейсонов. А значит, я предлагаю смотреть э на неё под тремя углами. Да, это задачи. Э, ну и их решения, это инструменты, которыми вы пользуетесь, и процессы. Давайте считать, что вот эта вот задачи, инструменты и процессы - это, ну, назовём это громким словом фреймворк, э, который я вам сейчас предложу и дам примеры. Мм, важно понимать, что это, ну, не три каких-то отдельных вещи, да, потому что на работе мы решаем какие-то задачи с помощью каких-то инструментов, следуя каким-то процессам, да, это просто три призмы, три угла зрения, значит, под которыми нам может быть удобнее смотреть на один и тот же объект, на нашу работу. Да, тем не менее значит, начнём мы при этом с задач. А почему? Потому что людям, ну, какие вот люди приходят за какими-то знаниями взрослые, да, взрослые люди учатся, когда у них есть какая-то задача или проблема. То есть это естественнее всего ловить человека на ту проблему, которая у него есть. А и поэтому, собственно, проще всего попадать в аудиторию, проще всего как-то мачить себя с потенциальными зрителями через те задачи, которые вы решаете. Но это не единственный путь. Тем не менее, аа хорошая задача - это когда вот вам пришлось что-то делать. прилетела задача, и оказалось, что вот прямо с ходу решения задачи не знаете не только вы, но и вот эти вот все замечательные э хранилища знаний и э не знаю сущности тоже, ну, не знают прямо с ходу, как решать, да, ни Google не знает, ник Overflow, ничт ГПТ. Вот, ну, спросил у Ясеня, как бы, как делать, пришлось думать. А поэтому, значит, что хочу сейчас значит, что вот важно, да, как бы сказать, если у вас в работе за последние там полгода, год была какая-то ситуация, когда вы были в тупике, когда было непонятно какие-то задачи, было непонятно, как её решать, непонятно, что делать, а потом вы через эту штуку всё-таки пробились, то с очень большими шансами Из этого может получиться хороший рассказ, да, в тех местах, когда вам что-то прилетело, вы сразу знали, как сделать, сделали и оно заработало. Ну, наверное, там не так легко найти тему, да, вот в тех местах, где либо не сразу вышло, либо там пришлось несколько подходов к снаряду делать, либо пришлось что-то думать, искать, ресёрчить, да? Вот вспомните вот ощущение, когда вам было трудно, и попробуйте вокруг этого ощущения поискать тему для рассказов. Это может хорошо работать. А что ещё может быть на самом деле интересно? Хотя люди почему-то часто м ну наоборот воспринимают это как что-то плохое. Смотрите, вот бывают такие задачи, которые все сейчас вделывают, да? Ну, например, некоторое время назад, сейчас уже меньше, да, но там год там двадцать второй, да, двадцать третий, все что-то импортозамещали, и была целая куча людей, которые импортозамещали Джи, например, да, или, ээ, ну, в общем, много чего импорты замещали. И на самом деле это было в тот момент актуально и важно, потому что готовых стандартных ответов на вопросы не было, а вопросы перед многими людьми стояли одни и те же. А поэтому, если вот вы сейчас делаете что-то, и вы знаете, что все делают во всех компаниях там вот это вот делают, но при этом стандартного готового решения нет, то это тоже может быть интересная тема. Например, из того, что вот точно все сейчас делают, э, в любой службе поддержки везде, да, делают рагстемы, да, если знаете, что это такое. Это когда вы скрещиваете поиск по вашей базе знаний с ну с чат ГПТ условно с лмкой какой-то, которая ну, кроме того, что сама что-то знает, она ещё и ищет ээ значит вот в той базе знаний, которую вы е подсовываете. И это позволяет вам гораздо быстрее для работника службы поддержки сгенерировать, ну, потенциальный ответ клиенту или рекомендацию или что-то такое, да. Вот такая автоматизация службы поддержки чисто везде проис все делают. Я, ну, не знаю, и с людьми из Яндекса общался, и с людьми из X5 я общался, которые это делают и и в общем кто-то и в ВК и тоже в разных местах это делают. А значит, и вот, пожалуйста, на буквально только что закончившемся питерском хайлоуде Алексей Болтава из ТБАНКА тоже рассказываю, как они это делают. Почему это интересно? Потому что общую идею того, как делать рак, все знают, но конкретные детали ещё в индустрии не отработаны. Не совсем понятно, как начанки разбивать там вот эти документы там ещё многие вещи, как там надо ли, ну, надо ли хоть что-то дообучать, значит, и сколько это стоит, значит, какие там, в общем, а трудности, какие-то развилки, решения, которые надо принимать, у всех примерно одни и те же, а, но готовых ответов у людей нет, да? Поэтому, как именно вы прошли этот путь? Такой же, как у всех остальных, да? Вот именно сейчас интересно. А, ну не знаю, там несколько лет назад очень было интересно все себе, например, заводили, да? Сейчас уже, ну, вот типа как мы завели себе Люкс. Ну, уже, наверное, не так интересно. Уже кажется, что в среднем люди более-менее разобрались, и там есть какой-то набор стандартных стеков. Ну, типа берёшь, берёшь и делаешь. Хотя не пош доклады до сих пор бывают на эту тему, но тем не менее вот что все сейчас делают и вы делаете, да, это очень хорошая тема. А расследование, да, любые, значит, необычные странные события, которые у вас происходят на работе, ну, в в коде обычно в каких-то программных системах или железных системах, это тоже интересно. Э-э, ну я сначала с козырей зайду, да, значит, что понять, что не каждый человек автор кликхауса и основной разработчик Кликхауса, не все из нас Миловидовы и даже, наверное, вообще как бы второго Миловидова среди нас, скорее всего, нет. Аа, но тем не менее вот совершенно чудесный был доклад про ээ всякие навороченные какие-то хитрые баги на стыке железа, кода, каких-то ещё дополнительных систем. и что с ними делать, и как их отлаживать, и как надо писать базу данных так, чтобы, несмотря на все эти баги, данные всё-таки по возможности не терялись и кликхаус не тормозил, естественно, да? Аа реально пять или шесть кейсов, когда происходит какая-то неведомая хрень. А, и Алексей рассказывает, ээ, как он её расследовал, куда смотрел, что пробовал, вбрасывает какие-то вопросы в зал, да, потому что истории получаются достаточно детективными. А, и чтобы мм проиллюстрировать, что не обязательно быть Миловидовым. Вот, пожалуйста. Есть такой докладчик Андрей Солунцев, который многократно выступал на Гейзенбаге с темой, ну, несколько там и в круглых столах, и в в доклады у него были с темой флаки тестов. Что такое флаки тест? На всякий случай это такой тест, который то потухнет, то погаснет, да, он то проходит, то не проходит. и перезапускаешь. О, прошёл, а потом, значит, через неделю вжух, и опять там несколько тестов упали. Перезапускаешь, они опять прошли. И вот и очень трудно поймать, причём, да. Э вот он рассказывал чудесные истории из своей жизни, когда у него были какие-то очень долгоживущие флаките тесты, которые падали редко и никак. И когда сидишь, смотришь на него, такой вот как бы смотришь так на него, он проходит, а когда он где-нибудь в Найдле запускается, он там время от времени нет, нет, да и упадёт. А, ну и почему это плохо понятно? И он рассказывал, ээ, как он эти все штуки расследовал. Это очень интересно и просто очень интересно. Поэтому, если вы какую-то сложную техническую непонятную штуку расследовали, то это может быть хорошая тема, да? Любой баг, который, ну, не сразу удалось поймать, вполне годится. Тем более, да, что важно, значит, смотрите, здесь есть ещё вторая выгода. Кроме, собственно, этого бага или в процессе расследования бага вы можете вплести в рассказ информацию про инструменты, про подходы к отладке, да? То есть вы можете на фоне вот этой детективной истории на самом деле скормить людям ещё много ээ полезной информации, полезного своего опыта. А это довольно трудно. Ну, в смысле, это надо поработать, чтобы это получилось, да? Там надо аккуратно, ну, как детективную историю написать. В общем, вроде понятно, а, ну, не у всех получается, но тем не менее вполне можно пытаться. Э, ещё, да, про задачи подробнее всего. Дальше как бы остальные пуски фреймворка быстрее пойдут. На всякий случай предупрежу тех, кто ээ боится, что всё происходит медленно. А, значит, ещё ээ одна интересная тема, связанная с задачами. Это задачи, которую вам не удалось решить, но вы были близко, да, и было несколько подходов к снаряду. И вот каждый раз что-то не хватало, да. И вот тут вполне можно поймать людей, которые тоже решают эту задачу, что-то с ними обсудить. Э, нормальная тема. Ну вот пример у меня опять про кликхаус. Простите. Значит, а Алексей рассказывал, как он пытался такую вот задачу решить. Аэ, есть у меня, допустим, клиент. Клиент приходит, говорит: \"Твоя база что-то тормозит у меня\". Он говорит: \"Присылай данные, да, я посмотрю\". Он говорит: \"Данные не могу прислать, они все под NDA, но тормозит\". А, ну вот и чтобы как-то эту историю обойти, была идея: \"Давайте сделаем какой-нибудь обфускатор данных, который можно на базу напустить. Он её офусцирует, но какие-то характеристики у неё сохранятся и потом уже можно отправить разработчику СУБД, чтобы он отлаживал\". Вот оказалось, что нет, невозможно такую штуку сделать. Но почему именно невозможно? И там шесть или семь разных подходов, которые они влекалась, пробовали, вполне интересно. Может быть, и у вас тоже есть такая проклятая задача, мало ли, это может быть интересно. Кроме того, а можно искать, э, ну, какие-то интересные технические штуки не прямо в работе, а где-то в своих увлечениях. Это тоже может быть интересно. Вот чаще всего почему-то я такие темы встречал на Гулан Конфе. Я не знаю, с чем это связано. Вот. Но и в частности вот такая вот была история от Эмили Шерифулина, который, кроме того, что разработчик наго ещё и нагитаре играет. И, соответственно, он написал ногой эмуляторы разнообразных гитарных примочек. гитарных педалек всяких, значит, там delи, distortion, ну, всё, что хочешь. И, соответственно, с одной стороны, он немножко рассказал про акустику, математику и вот что происходит вообще с звуковыми волнами. А, ну и потом показал, как вот этот код можно написать ногой и как его интегрировать, ну, реально к своей системе воспроизведения, которой ты подключаешь гитару. А, ну из недавнего, значит, тоже другой был докладчик, который наго написал эмулятор. Не знаю, есть тут среди нас те, кто стар, очень стар, суперстар и в детстве играл в приставку Денди. Есть такие, кто Денди знает. Вот. И представьте себе, значит, человек нагу написал эмулятор ден. А там, у неё же там процессор свой, как бы, там хитрый, кривой, старый, там ещё что-то, и там память у неё там всё вот надо как всё написал и рассказывает, как это работает. А, ну это, в принципе, ну, не то чтобы полезно, но тем не менее для, ну, не знаю, для общего развития сколько-то таких докладов на конференции нам тоже нужно, да, поэтому, если у вас есть вот что-то такое для души ностальгическое, то не бойтесь подавать, это тоже интересно. О'кей, погнали дальше. М, значит, мы поговорили про задачи. Давайте теперь поговорим проу про инструменты. Инструменты. Что можно сказать про инструменты? А, значит, самый частый кейс, самая, значит, простая история. Миллион, значит, их. Если вы вдруг леа адоптер какой-то новой штуки, которая набирает популярность. Э, прямо сейчас не знаю, что это за новая штука. Вы, наверное, знаете, но а там, не знаю, шестнадцатый, семнадцатый год, а, огромное количество докладов про докер было. Вот мы попробовали докер. Ух, офигенная штука. Ну, действительно, в итоге офигенная, видимо, получается, да? Потом был период, извините, кто если помнит, когда-то, значит, у всех был только Забекс и других не было мониторингов, а потом народ что-то начал, да, начал думать, что что-то Забекс, ну, что-то как-то он такой забронзовел такой, значит, у него вот там и алерты настраивать неудобно, и то, и сё, и там появилась целая плеяда, на самом деле, всяких других штук. И вот если там посвестить шестнадцатый, семнадцатый год, восемнадцатый, много докладов про разные другие штуки, которые люди попробовали. Ну, понят потом Промете и всех примерно победил. Вот. Но там были как бы какие-то люди попробовали там мониторинг Босун, не знаю, кто помнит вообще ещё такой ещё что-то. И вот если, короче, ещё не все попробовали, если выли адоптер и у вас есть какой-то опыт с этим инструментом, аэ, то это интересно, потому что это это важно, это помогает людям принять решение вообще идти пробовать, не пробовать, и это ценно для индустрии, да. Поэтому, если вы вот сейчас попробовали какой-то новый инструмент, который раньше не был известен, то расскажите об этом, независимо от того, понравился он вам или нет, да, это хорошо и ценно. Вот. Но не только это хорошо и ценно. Хорошего и ценного в мире много. И есть на самом деле ещё м ну как бы связанный с инструментами такой гарантированный способ прямо попасть на конференцию, в главный зал, ну и получить там ту оценку, на которую вы сделали доклад по-частному. Значит, есть вот, например, два таких слова. Если они есть в вашем докладе, в названии, то вы гарантированно попадаете в главный зал конференции. Значит, слова эти такие, это паттерны, первое слово, второе слово кавка. Всё, больше ничего не надо, как бы всё всё прилетает. Ну или, не знаю, там пять вещей продис, которых вы ещё не знали, да? Короче, если вдруг вы давно эксплуатируете какую-то классическую систему, да, какой-то, ну, как бы классический инфраструктурный компонент и много про него знаете, вам, кажется, может это очевидно, да, всё, но вы собрали, ну, там какой-то миллион шишечек и огромных шиши шишечка маленькая, шища, да, как бы правильно, я не знаю, как шишущ собрали много, значит, больших с этим инструментом и можете про это рассказать. то вот такие доклады всегда очень любят, да, паттерны использования какого-нибудь. Вот в качестве доказательства буквально из, собственно, питерского хайлода, доклад главного зала. Пожалуйста, значит, ээ прикиньте, даже кролик ещё не устарел. Как правильно готовить рыбитом Q8 практически кисель, да? Вот такая штука заходит всегда. Вот. А, ну, может быть, может быть, да. Так что вы говорите: \"Ну не знаю, у меня с инфраструктурой всё обычно. В инфраструктуре у меня ээ кластер, в кластере кубер, в кубере докер, в докере микросервис\", в микросервисе смерть Кощеева, да? И, ну, как бы всё стандартно, всё обычно. Всё равно может оказаться так, что где-то вот в этой стандартной связке вот в совершенно стандартном стейке, вот где вообще нечего, вдруг там есть на самом деле какое-то неудобство. Знаете, бывает такая, ну, привычная боль и у людей, да, когда что-то у человека болит много лет, и он как-то уже с этим живёт, а есть какие-то неудобные вещи, и вдруг вы их замечаете и что-то с ними делаете или думали об этом. А из этого тоже, как ни странно, можно сделать, даже в очень стандартном стыке можно сделать интересный доклад. А на Devops Confi, например, м, буквально вот недавно был доклад Михаила Кажинского. Вот про что. Значит, представьте себе, что есть вольт, в котором хранятся секреты пароли, там все всякие секреты, да. Вот, э, и, ну, и это совершенно стандартная компонента. Все, все использ, ну, 90%, значит, людей, у которых есть значит какая-то такая, значит, ээ инфраструктура, у них там есть вольт, значит, ээ в который микросервисы, например, ходят или там как-то получают секреты. А, и вот представим себе, что мы не хотим, чтобы приложение само уходило в вольт. Ну, потому что мы не хотим, ээ, завязываться, да? Мы хотим, чтобы приложение у себя в контейнере из там файла, который доступен только в контейнере или из переменных окружения, обрало секреты. А вот из вольта мы хотим туда вот как-то эти секреты доставлять, либо в файл, либо в переменное окружение в контейнере, в докере. И внизу оказывается, что это неудобно. Ну вот нет такого инструмента, который вот во всех случаях эту задачу легко решает. И Михаил привлёк к этому наше общее внимание и рассказал про пять разных инструментов, которые они у себя пробовали и рассказал, что что каждый из них до сих пор не умеет делать, и что на самом деле в некоторых случаях приходится даже комбинацию из двух инструментов собирать. Хотя, казалось бы, ну вот совершенно совершенно стандартный стек, то есть ничего ничего нет. А вот есть вот. Аа кроме этого, если, ну, в принципе, у вас есть какой-то стек, вы пользуетесь какими-то инструментами, а, и, аэ, ну, и вот вам кажется, что, ну, ничего там нет, ну, как бы какие-то есть там, ну, тут какие-то есть тонкости конфигурировать, ещё и что-то, но и доклад из этого не сделать, то из этого часто, серьёзно я вам говорю, можно сделать воркшоп неза Да. И и вот вот эта вот история буквально недавняя тоже с питерского хайлоуда. Иван сначала пришёл с докладом. То есть интересно то, что он пришёл сначала, говорит: \"Давайте, я вот хочу сделать доклад про то, как если ты просто бэкэнд-разработчик, ничего не знаешь про машинное обучение\". Ну вот есть как бы набор уже готовых компонентов. Ничего не надо даже знать, что такое эмбединги очень подробно. Не надо уметь их самому там считать. Но тем не менее вы можете взять свою базу знаний какую-то, свой как бы набор документов, вот ээ всё автоматом для него сделать и прикрутить векторный поиск по, значит, вот этому набору документов. И я вам расскажу, из каких компонентов это собирается. Вот. Да, мы такие посидели, подумали: \"Ну, типа, нет, для доклада это не очень интересно, потому что, ну, в общем, про все эти компоненты люди и так могут почитать\". Ну, workкшоу получился очень хороший. Ээ а оценка оценка, значит, четыре, ну, между 4,7 и 4,8. Ну, то есть это это хорошая оценка. Вот. Да, значит, вроде как ничего прорывного нет, но люди смогли прямо в зале, да, за 2 часа по какой-то либо своей, либо предложенной тестовой базе знаний за 2 часа на коленке из openсоourсных компонент собрать векторный поиск, да, используя вот, ну, настраивая, используя все те инструменты, о которых и рассказывал вам. Да, готовить воркшоп трудно, это больше работы, это действительно ну просто больше работы, да, это это сложнее. Возможно, что чтобы проводить воркшоп, вам там нужен ещё помощник, да, который тоже будет помогать технические проблемы участников воркшопа решать. Но тем не менее даже в, ну, относительно стандартном стыке, ну, может не очень известном, но как бы там, где вроде нет ничего прорывного, дать людям, которые впервые с этими инструментами сталкиваются, там пощупать их руками, там понастраивать, покрутить, поотвечать на вопросы. И это всё равно полезно, да? То есть это не то, что вот я хочу выступить и хоть с чем-то бы мне пролезть, вот я полезу делать воркшоп. Нет, на самом деле это такие воркшопы, они приносят пользу, и поэтому их имеет смысл делать. Ну а заодно и засветит конференции, конечно, тоже. Вот, короче, глубокая мысль, что часто в стандартном наборе инструментов удобно сделать воркшоп, а не доклад. Пощем. Классно. Значит, давайте теперь, ээ, поговорим про процессы, да? Почему про процессы? естественный путь. Если в задачах у меня всё как бы хорошо и просто, в инструментах у меня всё стандартно, всё работает, то, наверное, ну, может быть, это частично связано с тем, что у меня как-то очень круто процессы отлаживают. Правда, если вот у меня всё всегда работает и всё всегда получается, то, наверное, же это неспроста, наверное, это потому, что я что-то умею делать, да? Вот. И давайте поищем вот это вот, что же я умею делать такого в организационном плане, чего, может быть, не знают другие люди. Вот. И тут можно, во-первых, выбрать какие-нибудь лучшие практики и широко про них поговорить. Ну вот мне вспоминается из относительно недавнего вот такой доклад. А ну понятно, что не каждый из нас как бы тоже разработчик ээ ну корераз разработчик движка WordPress, как Ольга, да? Ну, с другой стороны, ну, что WordPress на тем не менее технической конференции, то есть это не менеерская, это техническая конференция, это под множество хайлода было ПХП Раша в рамках йлода проводилась. А Ольга рассказала про ээ ну как бы организационные подходы к тому, как развивается ядро WordPress. А и дальше эти организационные подходы, ну, смогла протащить до кода, да. смогла показать, как, ээ, значит, те или иные общие принципы и выражаются в том, какой код там пишется и почему именно так. А а мне показалось, что это была достаточно интересная история. А, но не обязательно так, да, бывают и более менеджерские какие-то штуки. Э-э, бывает так, что вы вдруг применяете в своей работе какой-то процесс или какой-то организационный элемент, который, ну, не так известен, а он помогает. И можно вот про этот узенький элемент э достать и рассказать. А вот, пожалуйста, пример Сахар Брезгалова, а, которая помогает внедрять ээ организационные всякие принципы и штуки, построенные на теории ограничений. Занимается этим как консультант во многих местах. А, рассказывала налет Конфе про такую штуку, как, э, нежелательное явление. Да. То есть когда что-то у нас не нравится нам гово что-то плохо, и мы хотели бы это изменить, да, на работе, да, нам что-то не нравится, что-то криво, какая-то фигня, да? А оказывается, что для того, чтобы конструктивно это изменять, ну, там типа какие-то люди плохо работают, да, или какие-то, значит, события всё время происходят плохие, да, есть целый фреймворк и целый, ну, целая система, которая помогает описывать нежелательные явления. И почему, в общем, какими словами это можно делать, какими нельзя? как бы как понять вообще как бы нормально я описал или нет? Там есть прямо достаточно хорошие признаки и и если вы эти признаки находите в своём описании, значит в работу это брать ещё нельзя, да? Вот в таком описании это не сработает. И очень убедительно рассказывает, да? Вот э вот эта вот штука, это формальное название нежелательное явление, оказывается есть. Я не знал, да, понимаете? Ну, я как бы что-то как бы тоже, ну, в айтишных каких-то компаниях работал, руководил там кем-то что-то у меня, значит, есть какой-то такой опыт. Вот я про эту штуку вообще на этим леткой конференции я в программном комитете там, не знаю, с самого утра, да, значит, с с Зарит. И вот я первый раз услышал, а, ну, прикольно же. Хотя, казалось бы, наверное, ну, кто-то может подумать, что все знают. В общем, может быть, вы можете какой-то, э, пусть маленький, да, кусочек процесса, но малоизвестный такой, про который не все знают. Ээ, можете вытащить из своей работы и про него рассказать. Это, на самом деле, может быть интересно и кому-то принести пользу. А, и последний пример, который у меня есть в этом месте, это вот такая вот история. Значит, это история про, э, ну, некоторые культурные, как это сказать-то, культурные трансформации, да, которые, значит, происходили в компании. На самом деле про культурную трансформацию вот из наших конференций не только Тимлит хорошо заходит, но э как бы и вообс тоже в принципе любят из из нашей конференций всякие культурные истории. Ну потому что девопс - это же и сейчас уже вот это никуда не денешься. И дедивопс - это человек. А вообще-то от природы дедивопс - это культура. И поэтому про культуру там всё ещё любят говорить. Но здесь на тем не было. Значит, история про то, как м компания поняла, что у неё плохо получается работать с open source проектами, да, когда тебе нужно в обстрим какие-то изменения залить, а у тебя их не берут. Ты что-то сделал и такой: \"Вот, смотрите, я там баг поправил или я фичу, вот тут накодил, смотрите, какая классная\". А тебе говорят: \"Не, это вообще не соответствует идеологии нашего проекта, говорит тебе йтейнеer в openсорсе. Иди нафиг\", - говорит он. Вот. Это очень неудобно, потому что Форк поддерживать, конечно, не хочется. А, и вот для того, чтобы понять, как работает Open source, компании сделали свой собственный open source проект, прикиньте, вложились, да, там обеспечили инфраструктуру, ещё что-то, как бы, ну, там, значит, некий написали. Вот. ээ и посадили людей своих сначала майнтейнить, вкладывались в сообщество, потом привлекали майнтейнеров уже со стороны контрибьюторов. В результате что получилось? Получилось то, что человек, побывший в шкуре Майнтейнера, он по-другому к этому ко всему относится. И он начинает понимать, как правильно общаться с майнтейнером и другого проекта. А потому что когда вот к тебе какую-то фигню прислали и ты говоришь: \"Вот это не соответствует идеологии нашего проекта\". И ты уже не понимаешь, как правильно присылать свои патчи в другие места. Ну, во всяком случае, и вот завели openсоурсный проект специально, чтобы потренировать людей. Но это очень интересно, на мой взгляд. Вот. Аа может быть, что-то такое у вас где-то было. Давайте, значит, я вот из всех этих примеров попробую, ну, какой-то небольшой итог подвести. Так вот, на все эти штуки смотреть, какие бывают вот прикольные темы, которые люди часто пропускают и думают, что это неинтересно. А значит, во-первых, в задачах, если что-то не сразу вышло, то, а потом вышло, то вот это точно почти 100 подов интересно. А значит, не надо думать, что то, что у меня не сразу вышло, это было потому, что я дурак. Да нет, обычно у другого разумного человека эта задача тоже, скорее всего, вызвала бы затруднение. То, что вообще не вышло, но были близкие. Те, та задача, которую вы делаете, и вы знаете, что вообще все её сейчас делают, у всех она стоит, а готового решения нет. И вот об этом прямо сейчас интересно говорить. Через год будет поздно, через день будет поздно и через мир будет уже не встать, да? Мм, могут быть задачи на стыки с хобби. А и это может быть интересно из инструментов, да? Либо вы попробовали новый инструмент, либо вы можете поделиться паттернами работы с каким-то классическим инструментом, а потому что у вас с ним большой опыт. Вам, может быть, кажется, что всё это тривиально, потому что вы с ним 10 лет работаете и его знаете досконально, но вообще-то может быть и нет. Я вот буквально, простите, недавно общался с человеком, который думал, значит, сделать доклад про хорошие практики написания шилскриптов. Может быть, и выйдет, я не знаю. А значит, ээ неудобство типового стека или, в принципе, в инструментах, если вот совсем всё типовое, то может быть полезен воркшоп. в процессах, да, как бы самых лучших практик, малоизвестные процессы или какие-то большие философские проекты, да, вот эти все штуки часто бывают интересны. И вот я предлагаю вот через все вот эти вот увеличительное стёкла посмотреть на свою работу и поискать, нет ли там чего-то такого. Тыц. А, и на этом, э, мой кусочек про поиск темы, э, заканчивается. И, ээ, давайте попробуем всё-таки По лине вернуть речь, а потом, э, может быть стойкие из нас ещё, а, наверняка вопросы и ответы какие-нибудь позадают друг другу. >> Отличное спасибо, Роман. Да, вопросы, ответы на вопросы у нас будут чуть позже. Сейчас я ещё немножечко расскажу, но у меня такой получится прямо перескок, да. Сейчас говорили про тему, про, а, специальные такие направления. А, глубоко профессиональные, так скажем. А я снова вернусь, наверное, в общечеловеческие такие понятия. А я сторонник того, чтобы связывать психику и физиологию. Да, я больше мм для тех сейчас буду говорить, кто уже готовится выходить на сцену, готовится выступать, а и понимает, что он будет волноваться, понимает, что он будет мандражировать и как с этим справиться. Не обязательно выступать сразу на сцене. Может быть, у вас какое-то совещание, аа какие-то есть варианты проявить себя, и вы понимаете, что вам это всегда тяжело, волнительно. И как в эти моменты быть с собой, со своим состоянием, как с ним работать, можно ли вообще с этим работать? А хорошая новость в том, что с этим работать можно и нужно. И у нас есть небольшие кнопочки в теле, которые могут помочь с этим справиться. Не только прямо кнопочки, но и процессы тоже. Для начала давайте сразу расскажу потихоньку, как работать с волнением перед выходом на сцену. Если вы уже сейчас понимаете, что вы будете, а, Хайлот, на Хайлот выступать на конференции, например. Если вы понимаете, что вас будет колбасить, то в день выхода а на сцену вам лучше всего скинуть лишний гормон стресса. Каким образом это мы можем сделать? Мы это можем сделать, например, пробежкой с утра, активными физическими упражнениями. Если у вас есть такая возможность, то вы ледяной душ, а может быть, но лучше что-то более продолжительное. То есть вы должны прокачать достаточно много крови через своё сердце, чтобы этот гормон выработался и, а, перестал в таком количестве быть в запасе. у вас в теле. А порать на близких? Не уверена, что это снизит, конечно, да. Давайте что-нибудь безопасное для окружающих выбирать и полезное для себя. Ледяной душ может быть лучше контрастный, потому что должно быть продолжительное время. Вы не а не с за один а раз это сделаете, его израсходуете. Вам нужно продолжительное время дать небольшую хотя бы нагрузку на сердце. Это первое. Если вы понимаете, что вдруг у вас в день выступления нету такой возможности, да, с утра пробежаться, сходить в душ, отдохнуть, там, переодеться и так далее, то непосредственно примерно начинайте готовиться за час до выступления, за 40 минут до выступления. опять вы же, а-а, мм, вы же начинаете активную физическую, а, деятельность. То есть вы прыгаете, боксируете, а делаете всё, чтобы ваше тело перестало сжиматься, а стало расправляться и активно двигаться. Почему? Потому что наш страх и желание сжаться и показаться меньше, чем мы есть перед толпой людей, чтобы они в вас не попали своими помидорами или камнями. А, да, вот это состояние нам нужно преодолеть, расправить плечи, стать больше, как раз, а, показать себя как лидера, то есть занять больше пространство просто-напросто, да, и тем самым этими активными движениями, действиями вы сможете как раз себя разжать из скукоженного состояния, перевести в раскрытое и расслабленное. А делать физически активные упражнения следует на протяжении минут 15 хотя бы. Естественно, после этого вам нужно будет, а, выдохнуть, успокоиться, да, подышать, привести дыхание в порядок. И, соответственно, это ещё там минут 10-15 перед выходом. То есть минут 30-40 вам нужно на то, чтобы настроиться. Какие ещё фишки помогают? А кубик льда на запястье помогает оттянуть кортизол. Вот такие вот всякие лайфхаки. Вы можете их использовать классно, если они вам помогают. Это замечательно. Непосредственно на сцене, что может помочь? Если вы понимаете, что вас тоже колбасит уже на сцене, а то можно через перенапряжение снять это внутреннее состояние зажима. То есть вы, а, сжимаете либо кулаки, либо один кулак на несколько секунд. Можно сжать, например, стопу или икру. Только смотрите, чтобы вас ничего не свело. А на несколько секунд вы перенапрягаете, считаете, например, либо не считаете, просто на ощущение ориентируясь, ориентируетесь и отпускаете. Это дело немножечко снимает ваше напряжение прямо во время выступления. Такое случается. Дальше для собеседований можно использовать. Совершенно верно. А что с вами ещё может происходить? Как ещё добавить себе уверенности? Есть вот такие точечки. Мы по ним сейчас пройдёмся. А так вот одна из моих любимейших историй - это упражнение арангутан. Почему я его люблю? Сначала покажу, как оно делается. И вы сейчас попробуете, будете его делать, а я на фоне того, как вы это делаете, буду говорить. Вы мычите и стучите себя по груди. Не изо всех сил, а легонько постукивая себя по груди. Начинайте А я буду говорить, и вы будете продолжать делать и отслеживать свои ощущения. Почему это упражнение возвращает нам уверенность? Потому что у нас в грудине есть, а тимус, так называемый. Это вилочковая железа, которая выделяет гормон. Гормон помогает нам чувствовать себя умиротворённо. У детей этот гормон работает гораздо больше, чем у взрослых. Поэтому они засыпают моментально, да, в какие-то моменты вы можете найти ребёнка, не знаю, забравшимся под шкаф. он там вдруг играл, играл и уснул. А у взрослых этот гормон вырабатывается меньше. И вот такими простыми упражнениями, массированием, мы с вами увеличиваем выработку этого гормона и немножечко успокаиваемся. Те, кто сейчас продолжают делать это упражнение, мычать и стучать, пожалуйста, проследите, как вы себя чувствуете, поменялось ли ваше ощущение, есть ли ощущение такого выдоха небольшого. Чем ещё хорошо это упражнение? Тем, что оно настраивает ваш тембр на спокойную работу. А гормон вырабатывает вилочковая железа. Я не скажу вам, как сейчас конкретно он а называется. Его вырабатывает именно она. А дальше, кроме аэ, собственно работы с гормональной системой, мы ещё работаем немножечко с сердцем. И у нас к грудине, например, а тянутся мышцы, которые соединяют рёбра с грудиной. И если эти мышцы мягкие, растянутые, расслабленные, то нам легче дышится. И у нас с вами дыхание происходит в полной мере, так скажем, а не поверхностная, испуганная, зажатая. Мы дышим более полноценно, если мышцы грудины и вообще, в принципе, груди у нас хорошо растянуты, свободные, а не скованные. Это ещё один вариант привести себя в порядок. Если вы понимаете, что вам перед сценой в принципе достаточно просто немножечко успокоиться, то вот эта история очень хороша. А она же помогает ещё и разогреть голос. И последний вариант мм физиологии уверенности - это дикционная работа. Я, так как тренер по речи, а знаю, что те, кто хорошо, классно выговаривают слова, договаривают их до конца, хорошо их проговаривают, выглядят очень уверенно. Даже если вы не очень уверены в той теме, которую вещаете, а, собственно, ваша дикция может помочь вам выглядеть более уверенно, даже если внутри вы немножечко сомневаетесь. Поэтому любая работа с дикцией, скороговорки, которые вы проговариваете медленно, букволомки, которые вы тоже проговариваете медленно и очень уверенно и увесисто, помогают вам настроить ваш аппарат и сделать вас как бы снаружи более уверенным внутри. То есть вы внешней работой делаете себя внутри более устойчивым. Вот. А, собственно, это краткие, очень такие небольшие рекомендации по тому, как работать со своей уверенностью, как подготовить себя к выходу на сцену. А я обещала уложиться в 10 минут. По-моему, уложилась, да? Тимус - это тот самый, та самая вилочковая железа. А, и теперь, наверное, мы переходим к вопросам. Как мы будем с вопросами работать, чтобы нам не перепутать? К кому вопрос? Думаю, что мы не перепутаем. Ребята, задавайте вопрос в чат, пока вы их пишите, а я буду отвечать на те вопросы, которые уже были. А как не потерять уверенность в себе после провала? А так поднимать руки, мы дадим микрофон. Классная идея от Лизы. Давайте так и поступим. Поднимайте руки. У вас, э, есть дополнительно Нет. Где у нас рука поднимается? Где у нас рука поднимается? Я пока не вижу, откровенно говоря. А, то есть можно поднять руку и озвучить свой вопрос вживую. Можно в чате написать, мы прочитаем и ответим. Итак, >> да, мы дали воп дали микрофон. А дали микрофон? Ага. В реакциях поднять руку. Всё понятно. Хорошо. Ага. Ага. Супер. Спасибо, Лиза. Аа, итак, как не потерять уверенность после провала? Если вы понимаете, что вы провалились, для начала разберите, как вы это поняли. В чём вы провалились? Как вы это поняли? Вас закидали помидорами. вас освистали, что случилось, как вы поняли, что это именно провал? А, скорее всего, вы придёте к выводу, что это ваше внутреннее ощущение, а не реальное подтверждение от а аудитории. Если это ваше внутреннее ощущение, то тогда с ним и нужно работать. Это более тонкая работа. А, как я уже говорила, да, можно переписать как вариант, как один из вариантов, записать ваши мысли и переписать их прямо на бумажке, прямо рукой, не в телефоне. Желательно всё-таки вот прямо это прописывать своими ручками. А дальше, если вы понимаете, что действительно были недочёты, надо принять эти недочёты, да, у меня получилось так-то и так-то. Это у всех случается, даже у очень опытных спикеров. В следующий раз для того, чтобы это не было, а чтобы этого избежать, я предприниму 1 2 3. Всё, в принципе, это окончательный вывод, который вы могли бы для себя сделать в этом случае. Как избавиться? Сейчас, секунду. Был вопрос. А после окончания какой-то работы работа уже не кажется сложной. После выполнения вот во время того, как Роман говорил, был такой вопрос. >> Да, Ната, давайте я вот тут вот влезу в это место, да? А как сказать? Ээ, это сложно действительно, потому что все задачи, как известно, делятся на, ну, по-разному можно делить на две группы, но, ээ, есть такое отделение, это задачи, которые я ещё не решил. Это одна группа, а другая группа - это абсолютно тривиальные задачи. Вот. И да, действительно, есть такое ощущение, в этом месте что можно сделать? можно. Ну вот хороший вариант - это у меня он кодовое название, значит, называется коллега с предыдущей работы, да, потому что брать коллегу со своей вот текущей работой из группы, ну, не так интересно, потому что обычно вы точно знаете и, ну, в курсе дел друг друга, он или она нерепрезентативная, да? Но вот взять коллегу с предыдущей работы, ну, наверняка же с кем-то из своих прошлых сотрудников вы поддерживаете отношения и время от времени общаетесь. И можно вот взять этого человека и просто поговорить с ним или с них, вот такая ситуация, как тебе вот и то есть этот человек, он профессионально вам близок, но при этом он вне немедленного контекста того, что вы делаете. И вот использование такого человека может вам поднять, скорее всего, он скажет: \"О, да, не знаю, о, интересно, да?\" И всё. Вот. Вот, короче, попробовать вот эту уверенность ээ нарастить через вот условного коллегу с прошлой работы. >> Класс. Ага. А на мой взгляд, ещё здесь есть такая штука, что действительно мы обесцениваем свой опыт. И в этом часто очень кроется, а секрет того, что, ну, вроде как все так делают, уже это не сложно, так скажем, да? Вроде бы вот уже сделал работу, ничего там сложного не оказалось. Это так же, как мы, ну, я предполагаю, что это примерно так же, как мы учимся машину водить. Сначала, когда мы не умеем этого делать, мы смотрим на тех, кто по телефону разговаривает, руль крутит, педали переключает, вообще не глядя. А мы смотрим на них, думаем: \"Господи, это же вообще просто бог какой-то, как он это делает. Ну просто фантастика\". Когда мы сами приходим к этому же состоянию, мы понимаем, что, ну, конечно, тут всё просто предельно, что я об этом буду говорить. И вот здесь, кстати, как мне кажется, очень хороший вопрос выбора целевой аудитории или обрисовки идеального слушателя, а который, э, будет вас слушать. Если вы будете говорить на аудиторию людей про тоже вождение, которые никогда не водили или в начале пути а водителя, то им будет интересно, им будут интересны ваши ощущения. Если вы разберёте свой опыт по полочкам, как он происходил, что у вас было, что вас двигало вперёд, что, наоборот, тормозило, если вы об этом расскажете, это будет супер интересно и суперважно людям услышать. Роман, правильно? Не знаю, может, включитесь, может, >> ээ да, ээ правда в том, что, ну, вождение хороший пример, э, да, как бы потому что на том же Ютбе или где-то ещё там миллион всяких людей, которые рассказывают всякие трюки провождения. Ну, и многие из этих трюков, например, они и на опытных достаточно, ну, на не профессиональных, но опытных по любительски водителей рассчитаны. И некоторые из них ну довольно интересные, да, как мне кажется. То есть там действительно можно под любой уровень подбирать часто. Ну >> Угу. >> Но тем не менее, короче, если вам эту задачу было непросто решить, то, скорее всего, она и по правде непростая, да? И другой разумный человек, когда с ней столкнётся, тоже будет испытывать трудности, да? То есть это не потому, что вы были глупые, да, когда месяц пытались понять, как делать, а потому, что там, правда, есть над чем подумать. Я предлагаю просто из этого исходить. >> Да, есть вот один очень интересный вопрос от Никиты. Что делать, если разонравилась тема, с которой заявился на доклад в процессе его подготовки? То есть выбрали тему, начали готовиться, поняли, что фу, какая-то ерунда, что в этот момент делать. Вот интересная тема. И слушайте, я вот в этом месте, короче, есть разные люди, знаете, есть ээ упорные носороги, да, которые, значит, ээ ну, короче, этот вопрос, ответ на этот вопрос зависит от вашего отношения к тому, до какой степени надо каждое дело доводить до конца. А, то есть я, например, ну, как бы если мне что-то не нравится, я любое дело бросаю. То есть я вот не тот человек, которого, ну, мо можно, значит, ээ взять вот на это, а, типа, уже начал, как бы так, продолжай, уже взялся. Не, я как бы я хозяин своего слова, типа захотел, дал, захотел, взял обратно. Вообще никаких вопросов нет. Вот я реально такой, да. Значит, поэтому если ещё, ну, типа, понимаете, если уже всё в программе, всё опубликовано, вам уже купили билет из Австралии, значит, чтобы вы на конференцию приехали, да, выступать. то в этот момент сниматься, ну, как бы, ну, немножко совестно, просто уже, ну, как бы надо перетерпеть. А если ещё как бы никаких необратимых событий не случилось и вы поняли, что не нравится, ну, и прям прямо поняли, что не нравится, ну, как бы чем раньше вы придёте и скажете: \"Хочу сняться, хочу взять самоотвод\". Не знаю, там у меня в это время будет свадьба друга или что-нибудь ещё такое. Ну, как бы, если вам, то есть можно даже соврать, как бы, что у вас есть какая-то объективная причина, если вам почему-то неудобно признаваться, что вы просто передумали. А, в общем, на ранней стадии, как бы, пока никаких необратимых событий не случилось, ну, можно сняться. Вот на более поздней стадии, ну, как бы надо сжать зубы, как бы ягодицы там и вообще всё, что сжимается, кулаки, как бы, и всё-таки доделать до конца, наверное. >> А я так подозреваю, что человек, например, подал заявку на какую-то тему, передумал, можно ли её изменить именно в программном комитете? >> Ну, на не программный комитет, как бы это ваш ресурс. Вот. Вот смотрите, важно, значит, относитесь к программновому комитету как ресурсу. И вот пойти к своему там куратору или к человеку, который общается с вами от программного комитета и обсудить это с ним или с ней, сказать: \"Вот что-то я, то есть вот эту вот психологическую помощь там, вот они вот это всё окажут, потому что программный комитет - это люди, которые заинтересованы в том, чтобы программа была классная. И они не как церберы работают, да, а как помощники. И вот в первую очередь их так и надо воспринимать, особенно если вы уже в программе. Ну, как бы этих людей надо эксплуатировать, они там для того и сидят. Поэтому, да, пойти обсудить, вместе придумать как бы как докрутить, что поправить вообще, как бы, и вовлекайте их в совместное творчество сколько угодно. И так и надо делать, конечно. А я бы со своей стороны добавила, что, как мне кажется, как я себе представляю, и я была в таких ситуациях тоже, когда подаёшь, заявляешь тему, а потом при подготовке думаешь: \"Чёрт возьми, что-то она не дотягивает\". Это, скорее всего, при признак своей неуверенности и вот этого мандража перед выступлением, что вы думаете, что, эх, надо было лучше выбрать тему, надо было ещё подумать. ещё покумекать. Более интересная тема есть. Это, скорее всего, часто, если это из из-за внутренних переживаний, то как раз та самая неуверенность в себе, тот самый синдром самозванца. А попробовать отнестись к этому спокойно. Выбрали, значит, уже было интересно, значит, уже комитету, а, комитет это заинтересовало, значит, с этой темой и будем работать. Э, например, выберу другую тему для следующей подачи заявки, да? То есть какие-то такие, а, самоуговоры должны сработать. Но опять же, это зависит действительно от человека. Все люди разные. Ещё у нас есть вопрос: как избавиться от слов паразитов? Вол время волнения они прорываются чаще. Здесь, мм, чаще всего история длительной работы. То есть просто одноразовой подготовки к конференции вы это, скорее всего, не сможете сделать. Это прямо работа с техникой речи, с публичными выступлениями. Это достаточно долго. Один из таких простых советов. Мы, девочки, носим кольца и не только девочки. Заметили слово, попросили близких подмечать ваши слова паразиты. Для начала выявите их в своей речи, записав любой свой текст. импровизации на аудио. Можете расшифровать потом и увидеть, как часто у вас повторяются какие-либо слова или звуки, паразиты. А как только вы заметили, переодели пальчик с одной руки на другую, за ещё сказали, ещё переодели колечко с одного пальчика руки на другую руку. А, собственно, это такое автоматическое, опять же, физиологическое, да, действие. движение, которое помогает замечать, тормозить себя, э, в моменте рефлексировать и переиначивать своё привычное поведение. А так не совсем понятен вопрос, как при защите диплома там одногруппники будут. Так, аа, ага, это сейчас про про диплом. Можно, можно я полтора слова ещё про слова паразиты вставлю по своему опыту? От нормального человека мы обычно не ждём настолько же идеальной чистой речи, как от политика или актёра и в общем от человека, который торгует лисом инженером, имеет право говорить как нормальный человек. И у подавляющего большинства людей ээ слова паразиты не раздражают. Да, они есть, но, вообще-то ничего страшного в них обычно нет. Поэтому, э, важно понимать, что, э, есть баг в голове, который именно себя, свою запись, своё аудио, своё видео заставляет воспринимать более критично, чем мы воспринимаем других людей. А ещё сейчас не будем, но это баг в голове. Когда мы себя видим в записи, мы себе не нравимся. И это и это не объективно. Это это это именно баг, да. Но поскольку мы вот это своё вот не нравится, нам надо как-то рационализировать, мы не можем же вот просто здесь, да, не можем принять, нам надо попытаться что-то улучшить. И мы начинаем искать, что же мы делаем не так. И первое, что мы находим, самое простое, что сразу легко найти - это слова паразиты. И мы такие: \"Ох, я так экаю, я так акаю, мне надо что-то с этим сделать\". Тогда как на самом деле вы экаете и акаете не больше, чем другие люди. Обычно есть есть исключительные спецы, которые могут слово значить сказать 13 раз за 2 минуты. Бывает, но это редко. А обычно всё дело именно в том, что вы рационализируете вот эту вот, ну, неприятность видео или аудио, ээ, на которое вы смотрите. А потом там отдельно можно когда-нибудь поговорить, в чём этот баг состоит. Он, ну, там есть у него психологическое объяснение, нейрофизиологическое даже, наверное. Вот. А, ну просто помните, что это баг, да? Вот вы себя смотрите всегда, как бы в первый раз, особенно в записи, вы себе всегда не нравитесь. Это нормально. Каждый человек себе всегда не нравится в записи. Не потому, что он плохой, а потому, что вот так оно устроено. >> Да. А Александр написал, что слова паразиты - это попытка заполнить боязнь молчания. Да, нам страшно потерять внимание слушателей. Нам кажется, что если мы бесконечно говорим, то они никуда не уйдут. Но как раз обратное. Если мы говорим без остановки, то, скорее всего, слушатель устанет и отвлечётся от вас. Да, вы потеряете внимание, потому что паузы - это то, что важно и нужно для аудитории, чтобы воспринимать вас адекватно. По поводу видеозаписи себя или аудиозаписи себя. Ээ, сейчас успокою, наверное, половину тех, кто сомневается в своём голосе и говорит, что, боже, я говорю как обычно, но на записи это какой-то кошмар вообще, когда я себя слушаю. Это просто что-то неудобоворимое. Ужасный голос у меня на записи. Пожалуйста, вот по этому поводу успокойтесь. Надо просто привыкнуть к звучанию голоса на записи, потому что наш собственный голос - это единственный звук в мире, который мы слышим уже сразу преобразованным через пустоты, как в гитаре, вот эта дека пусто пустая, да? А там звук усиливается. Также у нас здесь есть в черепе пустоты, а, через которые, проходя звук от связок, попадает на среднее ухо, и мы его слышим изнутри черепа. Ну и также немножечко через ушки, конечно, тоже. Но это единственный звук собственного голоса. Когда мы его слышим в записи, это как раз со стороны вид, и он нам очень непривычен, так же как а запись видео. Просто это непривычно. С вашим голосом всё в порядке чаще всего. Вот, э, поэтому можете не париться либо просто записывать себя чаще и привыкнуть к звуку своего голоса в записи. Да, сам себя не любите слушать. Это Угу. 90%, а не 50, да? Ага, хорошо. Голосовые зато не рассылаю. Иногда это удобная вещь рассылать голосовые сообщения. Не стесняйтесь, точно не от звучания голоса. Ну что, мы, наверное, будем на этом заканчивать. Если есть ещё вопросы, пожалуйста, пишите их. А пишите Роману, пишите мне. А подписывайтесь на Telegram-канал, в конце концов. А так при защите диплома там будут одногруппники. Не совсем понимаю ваш вопрос. Вы повторяете его второй раз, и я не совсем понимаю, в чём он состоит. Как при защите диплома, там будут одногруппники. Чтом вы имеете в виду? Как? А выступать? Не совсем понятно. Ага. Будете выступать при защите диплома. Там будут одногруппники. И вы стесняетесь одногруппников. А, не совсем понятен вопрос. Вилек, а что вас смущает? Завалят вопросами. Вас одногруппники на защите диплома завалят вопросами. А >> нет, не завалят. Не завалят. Я знаю, я знаю. Нет, не завалят. Они все на нервах, все дрожат, трясутся. Им вообще не до вас. >> Точно. Это 100%. >> М вообще не на вас. Вот. Ээ они более того в большинстве своём вообще не понимают и, ну, как бы на уровне дипломов уже они, скорее всего, очень булком представляют себе содержание. Ну, то есть если это если это математическая, программистская, естественно, научная какая-то дисциплина, про гуманитарные ничего не знаю, не стану врать. Может быть, там также, может, нет, но и там уже достаточно узкие специализации у вас возникают там на магистерском каком-нибудь дипломе, да? Э-э и большинство людей уже не очень хорошо понимают даже, что вы там делаете. Им нам даже ваш научный руководитель-то не сходу вопрос придумает осмысленный. Ну правда, обычно так. Короче, и на дипломе, и на конференции вот люди часто такой есть страх, что вот выйдет тролль какой-то и начнёт мне тролльские вопросы задавать. Вот нет, как бы и настоящего тролля днём с огнём не сыщишь. Я видел один раз его, и то это была, значит, история, когда два человека якобы давно враждовали, и там один выступал, а другой оказался в зале, и его ещё вовремя не заткнули. Он реально, ну, ээ, реально неприятный, но это было вот один раз за вот всю всю всю мою практику, за там, не знаю, вот последние 10 лет, которые я конференциями занимаюсь, попасть в такую ситуацию случайно вероятность очень маленькая, и ей его можно пренебречь. Вот, на мой взгляд. >> Угу. Угу. Да, отлично. Я очень извиняюсь, я никогда не была в такой ситуации на дипломе. И я в академии Гнесиных училась, поэтому там немножко по-другому всё происходит, в принципе, поэтому мне сложно ответить на такой вопрос. Но аа перечислили уже, ребята, накидали вариантов, посадить однокрупников, прогнать доклад друг перед другом, пусть это не вся группа, там три-четыре приятеля ваших вы друг другу покажете дипломы, прогоните, сформулируете вопросы, которые могут быть теоретически, и на них заранее подготовить ответы. Это же касается, в принципе, выступлений. Какие вопросы могут быть, что бы я на них ответил. А, в принципе, чаще всего это всё на поверхности лежит и вполне себе подлежит подготовке. А что ещё я бы хотела сказать? Действительно, люди на дипломе будут заняты своими мыслями, будут прогонять свой диплом в голове, а и вам им будет не до вас. А, и плюс ещё один лайфхак маленький. Пока вы вас вам задали вопрос, пока вы формулируете ответ, скажите, что спасибо за ваш вопрос. И дальше вы формулируете, да, даёте себе отстрочку любыми фразами, которые могут оттянуть немножко время вашего ответа и дать вам время на подготовку. поблагодарить, сделать вообще поблагодарить, сделать комплимент аудитории, а сказать, что вас внимательно слушали, это замечательно, да? Спасибо, что внимательно слушали. У вас получился классный вопрос. Все эти приёмы очень хорошо работают, успокаивают вас и аудиторию. А так вот, собственно, мне кажется, что как будто бы и всё. И мы с вами, наверное, заканчиваем. Да, хотелось бы взять слово отслин. Мы надеемся, что этот мастер-класс вдохновит вас на подачу заявок на HW. А до закрытия CP у нас ещё целая неделя. Я сейчас скину ссылочку в чат. Можете подаваться. Если у вас есть какие-либо вопросы или нужна помощь с темой, пишите программным менеджерам. А программный менеджер Виктория и Елизавета. Также скину сейчас в чат наши телеграммы. Вот. Надеемся, что было полезно. >> Отлично. Отлично. Спасибо большое. Ээ спасибо за ваши вопросы, за ваше активное участие. Роману огромное спасибо за, а такую очень полезную информацию. Здорово. Здорово. Прямо мастер-класс, по-моему, удался >> однозначно. Всё, ребят, дорогие друзья, я, наверное, я попрошу ещё разочек скинуть на всякий случай мой Telegram-канал Лизу в чат. И, а, если у вас будут вопросы по подготовке, тоже пишите. Всем всего хорошего, хорошего вечера. Спасибо за участие. >> Счастливо. Покапокапока. >> Пока-пока. Есть. Всем спасибо. Всего доброго. >> Пока-пока, Елизавета. Спасибо."
}